[
  {
    "title": "宾燚",
    "relative_url": "../info/1061/3376.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3376.htm",
    "html_content": "宾燚，同济大学研究员，博士生导师。主要研究方向为多媒体理解、自然语言处理、多模态大模型等人工智能相关方向。近五年在ACM MM、CVPR、ACL、AAAI等CCF A类会议及TIP、TMM等中科院一区期刊发表论文40余篇。ESI高被引/热点论文1篇。申请/授权发明专利10余件。主持国家自然科学基金及省部级项目5项，主研国家级重大重点项目4项，省部级重大重点项1项。 欢迎对课题组研究方向感兴趣的本科生、硕博士、博士后及研究助理来信垂询，加入课题组共同学习进步！兴趣对象是计算机、软件、自动化、数学、统计等相关专业学生。希望您是这样的：1）有兴趣从事学术研究和前沿技术探索；2）自驱力强，踏实肯干，积极进取，勤动手脑；3）具备良好的编程能力，英语和数理基础；4）热爱生活、热爱运动。欢迎邮件垂询。优秀学生可推荐海外交流、访问和深造，如新加坡国立大学、昆士兰大学、香港理工大学等。 联系邮箱：yi.bin@hotmail.com"
  },
  {
    "title": "陈广",
    "relative_url": "../info/1061/3444.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3444.htm",
    "html_content": "陈广，慕尼黑工业大学自然科学博士，同济大学长聘教授、特聘研究员（青年百人人才计划A岗、B岗）、科学技术研究院副院长（青干计划），曾任慕尼黑工业大学客座高级研究员。入选国家高层次青年拔尖人才计划、国家重点研发计划首席科学家、上海市东方英才（上海市青年拔尖人才）、上海市青年科技启明星、上海科技青年35人引领计划、首批小米青年学者。 主持国家重点研发计划项目、国家自然科学基金委面上/青年项目、上海市人工智能重点专项等项目；以第一作者/通讯作者在CCF A类国际期刊和会议（IEEE TPAMI、IJCV、NeurIPS、ICCV、CVPR、AAAI、ECCV）等发表论文100余篇。获评世界人工智能大会（WAIC）青年优秀论文奖 （WAICYOP奖）、IEEE MFI最佳学生论文奖、IEEE ARM 国际会议先进机器人最佳论文奖等5项奖励；担任11个国际高水平期刊副主编（Associate Editor in Chief）和编委(Associate Editor)（中科院一区SCI期刊IEEE Transactions on Automation Science and Engineering，机器人领域高水平会议International Conference on Robotics and Automation等）。为中国人工智能学会具身智能专委会首任秘书长、中国具身智能大会首届、第二届组织委员会主席、中国计算机学会智能汽车分会执行委员、中国图象图形学会类脑视觉专委会委员、中国自动化学会机器人智能专委会委员、中国汽车工程学会智能汽车交通分会委员/副秘书长。 当前主要研究兴趣为通用具身智能及相关学科交叉研究（生物信息、药物发现等），长期和UC Berkeley/TUM/KTH/ETHZ等国际知名大学保持良好的国际合作。欢迎成绩优异、英语水平优秀、意愿发表高水平学术论文、自驱能力强的低年级本科同学（一年级、二年级、三年级）共同开展研究工作，特别欢迎立志在本校或国外顶尖高校继续深造的同学。实验室欢迎符合条件的校内外同学联系推免研究生/直接攻读博士，欢迎申报博士后一起合作开展研究。 通用具身智能实验室主页: www.embodiment.ai 招生计划：2025年第二批次博士报名截止4月21日，欢迎联系，https://cs.tongji.edu.cn/info/1022/3615.htm"
  },
  {
    "title": "陈永生",
    "relative_url": "../info/1061/2818.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2818.htm",
    "html_content": "姓 名 陈永生 职 称 教 授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 仿真与多媒体处理 导师类型 博／硕导 电子邮件 chenyongsheng@mail.tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 陈永生 男，1966年2月生，1993年4月毕业于北方交通大学，获工学博士学位。教授，博士生导师。 研究领域 城市轨道交通或国铁列车控制系统、模式识别等。 主讲的课程 《计算机系统结构》、《计算机组成原理》等。 负责完成的项目上海市科委重大、重点科技攻关计划项目，国家重点基础研究计划（973）项目子课题、“十一五”国家科技支撑计划重大项目子课题、上海市启明星和曙光学者项目等。其中的主要工程项目有： 1、“高速磁浮交通系统关键设备和专用部件工程化技术研究”十一五国家科技支撑计划重大项目子课题1项 2、“高速磁浮交通系统集成技术测试验证系统研制和综合试验基地建设” 十一五国家科技支撑计划重大项目子课题2项 3、“高速磁浮交通系统关键技术攻关与创新研究”十一五国家科技支撑计划重大项目子课题1项 4、“城市轨道交通列车自动控制（ATC）系统关键设备国产化研制”上海市科委重点攻关项目并获2003上海市科技成果三等奖） 5、“地铁信号系统电磁环境研究 ”上海市重大攻关项目项目 6、“2号线车载安全数据监控板” 上海市科委重点攻关项目 获得的奖励包括2003年上海市科技进步三等奖、2000年上海市高校优秀青年教师。"
  },
  {
    "title": "程鹏",
    "relative_url": "../info/1061/3617.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3617.htm",
    "html_content": "姓 名 程鹏 研究方向 时空数据管理、向量数据管理、空间智能等 导师类型 博/硕导 电子邮件 cspcheng@tongji.edu.cn 办公地址 济事楼332室 程鹏，现任同济大学计算机科学与技术学院研究员，硕博导师。本科及研究生毕业于西安交通大学，博士毕业于香港科技大学。主要研究方向包括时空数据管理、向量数据管理、空间智能等。 近年来在数据库领域的顶级会议和期刊SIGMOD、VLDB、ICDE、TKDE发表40余篇论文。其中关于空间众包隐私保护的学术论文，获得了ACM CIKM 2021数据挖掘国际顶级学术会议的最佳论文提名（Best Paper Nominations）。参与研发的通用空间众包演示论文gMission，获得了VLDB 2014国际会议的杰出演示奖（Excellent Demonstration Award）。 担任数据库数据挖掘领域相关重要国际会议VLDB、ICDE、KDD、DASFAA的程序委员，ICDE 2025领域主席（Area Chair），数据库数据挖掘领域相关重要期刊TKDE、WWWJ、VLDBJ审稿人。主持国家自然科学基金青年基金，上海市浦江人才计划项目，蚂蚁集团校企合作项目。参与科技部科技创新2030-“新一代人工智能”重大项目一项、阿里巴巴集团校企合作项目两项。 指导的研究生获得国家奖学金、上海市优秀毕业生、上海市优秀硕士学位论文奖等。毕业生去向：阿里巴巴，字节跳动，小红书，蚂蚁金服等公司。 近年来，主要围绕向量数据管理和空间智能方向开展研究工作，具体包括： l 向量数据管理：分布式向量检索、多模态向量数据检索、稀疏向量检索等； l 空间智能：空间理解记忆、空间任务推理、空间任务规划等 此外，对空间众包、区块链、隐私保护也有部分延续研究。 课题组招收硕士、博士、博士后，欢迎邮件交流沟通！也欢迎感兴趣的本科生联系，提前感受科研氛围，熟悉科研流程！希望你对科学研究具有饱满的热情，善于思考，积极动手，具备良好的编程能力和英文文献阅读能力，且有志发表高水平学术论文。 更多信息请访问我的个人主页：https://cspcheng.github.io"
  },
  {
    "title": "程久军",
    "relative_url": "../info/1061/2817.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2817.htm",
    "html_content": "姓 名 程久军 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 无人驾驶+智能网联，包括：视频/图像、网络、安全等 导师类型 博导/硕导 电子邮件 chengjj@tongji.edu.cn 联系电话 通讯地址 上海市嘉定区曹安公路4800号电信学院大楼 教授，博士生导师。中国人工智能学会智能交通专业委员会委员。2006年6月毕业于北京邮电大学国家重点实验室宽带网研究中心，获计算机应用技术博士学位。2009年9月在芬兰阿尔托大学数据通信实验室进行为期一年的访问，并从事关于移动计算及物联网等相关技术的博士后研究工作。 2023年获“广东省科技进步二等奖”，2019年获”上海市科技进步二等奖”，2016年获“上海市科技进步二等奖”，2015年获“教育部科技进步二等奖”，2015年获“山东高等学校优秀科研成果三等奖”，2020 / 2012年获“隧道奖教金”，2011年获“同济大学奖教金”，2010年获同济大学大学生电子信息科技创新基地“2010年度优秀科技工作者”，2009年获“同济大学优秀青年教师”和“上海高校选拔培养优秀青年教师科研专项基金”，2008年获“花旗集团奖励金”，2007年获“同济大学青年优秀人才培养行动计划”。 作为项目负责人，主持了国家自然基金面上项目（“基于视觉解析的开放式无人驾驶车群内生性自协机理研究”），国家自然基金面上项目（“面向开放式无人驾驶车群的正则性自协机理研究”），国家自然基金面上项目（“面向车联网大规模网络动态演化过程的通达性机理研究”），上海市自然基金面上项目（“基于耗散结构特征的车联网网络动态演化模型研究”），中央高校基本科研业务费重点领域学科交叉重大项目（“人工智能产业发展的法律及知识产权问题研究”），上海市科委“重点攻关”项目（“上海公安监控视频传输、检索与管理体系研究”），教育部新教师基金项目（“B3G/4G网络环境下移动P2P网络资源搜索与调度机制”），微软亚洲研究院项目（“基于云计算的多媒体共享服务系统”），中央高校基本科研业务费专项资金项目（“社区生活圈互动服务平台关键技术研究”），北京邮电大学网络与交换技术国家重点实验室开放课题（“复杂环境下无人驾驶车群动态演化方法”、“移动P2P网络环境下信息服务的智能协同理论和方法研究”），等等。作为项目第2完成人，分别参加了国家重点基础研究计划973项目课题（“自-协网络体系结构设计方法”），国家“十二五”科技支撑计划项目（“社区物联网创新技术与服务平台与应用示范”），等等。 在《IEEE Transactions on Cybernetics》、《IEEE Transactions on Intelligent Transportation Systems》、《IEEE Transactions on Vehicular Technology》、《IEEE Transactions on Evolutionary Computation》、《IEEE Transactions on Systems, Man and Cybernetics: Systems》、《IEEE Transactions on Neural networks and Learning Systems》、《IEEE Transactions on Industrial Informatics》、《IEEE Transactions on Big Data》、《IEEE Transactions on Services Computing》、《IEEE/ACM Transactions on Computational Biology and Bioinformatics》、《IEEE Transactions on Automation Science and Engineering》等IEEE汇刊及国内外期刊会议上发表/录用论文100余篇，其中高被引（ESI）论文4篇。申请国家发明专利90余项，目前已授权60余项。 在“同济大学国家高性能计算中心同济分中心”和“嵌入式系统与服务计算教育部重点实验室”工作期间，创建并负责“诺基亚―同济大学移动创新俱乐部”，培养并指导研究生和本科生达300多人。指导的学生获得国际“Business Concept Challenge”奖项1项；获得创青春杯（挑战杯）全国大学生创业大赛铜奖1项；获得国家信息安全邀请赛二等奖6项、三等奖9项；获得国家信息安全大赛三等奖7项；诺基亚中国大学移动创新大赛奖项9项。指导学生获得国家大学生创新计划项目10项； 指导学生获得上海市大学生创新计划项目11项；指导学生获同济大学创新计划项目（SITP）50余项。 通过广泛的国内外学术交流与项目合作，在汽车以及无线移动网络的移动性管理研究领域，与同济大学汽车学院新能源汽车产业化研究中心、北京邮电大学网络与交换技术国家重点实验室、北京航空航天大学移动计算实验室、日本富山大学人工智能实验室、瑞典斯德哥尔摩大学网络通信实验室、芬兰阿尔托大学数据通信实验室等建立了良好的合作关系。 《IEEE Transactions on Intelligent Transportation Systems》、《IEEE Transactions on Systems, Man and Cybernetics: Systems》、《IEEE Internet of Things Journal》等IEEE汇刊审稿人。"
  },
  {
    "title": "丁志军",
    "relative_url": "../info/1061/2816.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2816.htm",
    "html_content": "姓 名 丁志军 职 称 教授 学 科 计算机科学与技术 专 业 计算机软件与理论 研究方向 研究方向：云计算及服务、智能化软件工程、大数据智能 导师类型 博/硕导 电子邮件 dingzj@tongji.edu.cn 联系电话 (021)69589378 通讯地址 上海市曹安公路4800号电信大楼 丁志军，博士，教授，博士生导师，同济大学电子与信息工程学院副院长，同济大学计算机科学与技术国家一流本科专业建设点负责人，主持上海市一流课程，获国家教学成果二等奖、上海市教学成果特等奖等。兼任中国自动化学会网络计算专委会主任、中国计算机学会服务计算专委会委员、上海市计算机学会副理事长、上海市人工智能学会理事，IEEE高级会员（Senior Member），国际SCI期刊Computing and Informatics、计算机科学等期刊编委，面向新工科专业建设计算机系列教材编委等。 主要研究领域为云计算及服务、智能化软件工程、大数据智能等。具体研究方向包括Pass云平台、流程智能管理、服务个性化推荐、ERP工业软件、大规模跨地域算力网络、软件演化、模型检测、大数据智能及在金融科技、智慧城市、边缘智能等领域的应用。 先后主持承担国家重点研发计划课题、国家自然科学基金项目和省部级纵向项目。作为主要成员参与国家自然科学基金项目（面上、重大专项等）、973项目、863项目等多项课题。出版学术专著1部，在IEEE TPDS、IEEE TSC、IEEE TSE、IEEE TOC、IEEE TASE、ACM Computing Surveys、ACM TAAS、ACM TECS、中国科学、计算机学报、软件学报等国内外期刊和WWW、ICWS、ICSOC、IPDPS、ICPP等学术会议上发表论文100余篇，获国际会议最佳论文奖和最佳学生论文奖，获全国优秀博士学位论文提名奖、上海市优秀博士学位论文奖。获1项国家技术发明二等奖和2项国家科技进步二等奖，6项省部级科研一等奖励，60余项（中国、美国）授权发明专利等。入选高校计算机专业优秀教师奖励计划、教育部新世纪优秀人才计划、上海市曙光学者计划、上海市青年科技启明星计划与跟踪计划等。 指导的研究生获首届全国人工智能应用场景创新挑战赛总决赛特等奖、国家奖学金、上海市优秀毕业生、上海市优秀硕士学位论文奖等。 欢迎有志攻读硕士、博士、博士后的同学或参与课题创新实践的本科生联系。"
  },
  {
    "title": "杜庆峰",
    "relative_url": "../info/1061/2738.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2738.htm",
    "html_content": "杜庆峰 DU QING FENG 博士 教授，博导智慧城市感知与规划重大工程软件技术教育部工程研究中心 常务副主任电子邮件：Du_cloud@tongji.edu.cn 主讲课程：1.软件工程(上海市重点课程)2.软件测试技术3.软件度量 研究方向：1. 大数据及机器学习2. 软件工程（软件估算模型、软件（系统）故障模型、软件测试与质量控制及软件的韧性等） 目前主要研究领域 1. 深度学习的云平台复杂系统的故障检测、诊断分析，故障注入（测试）及预测模型研究； 2. 知识图谱的微服务架构云平台的智能运维研究； 3. AI（人工智能）语义场景研究。 4. 深度学习的软件缺陷预测方法研究。 工作经验 1991年7月---2003年11月： 2003年至今，同济大学软件学院，中国软件测试认证委员会资深专家、专家组组长，中国软件行业协会软件过程改进分会专家，同济大学第二届教学质量督导专家，国家自然科学基金委员会评议专家，同济大学教学名师. 1994年11月～2003年3月在上海华腾软件公司工作. 1993年10～1994年11月在安徽大潮软件技术公司从事软件开发及管理. 1988年7月～1993年10月在安徽省测绘局工作. 2013年12～2014年7月在美国圣地亚哥州立大学高级研究访问学者. 部分研究项目： 1)主持科技部科技创新2030—重大项目《数字货币风险分析和可信防控技术研究及示范应用》课题《知识驱动的风险防控与数字身份长期安全》。 2)主持国家自然科学基金项目面上项目《SVG格式的时态GIS数据动态解析模型及增量存取机制研究》。 3)主持国家自然科学基金高铁联合基金重点项目《高铁隧道采集-设计-施工一体化智能建造关键技术》子课题。 4)主持科技部国家重点研发计划《城市重大市政设施智能化运维与管控平台构建及应用示范》子课题《市政设施运营状态网络协同自校正与虚拟重构技术研究》。 5)主持与华为合作项目《opnfv测试领域技术研究》。 6)主持与华为合作项目《OPNFV故障注入技术及可靠性测试研究》。 7)主持与华为合项目《电信领域微服务定界定位运维本体模型构建》。 8)主持与华为合作项目《复杂系统更新作业影响半径模型研究》。 部分发表的文章（第一或通讯作者）： Xu jincheng, Qingfeng Du*. Adversarial attacks on text classification models using layer-wise relevance propagation[J]. International Journal of Intelligent Systems, 2020, 35(9): 1397-1415. Xu jincheng, Qingfeng Du*. TextTricker: Loss-based and gradient-based adversarial attacks on text classification models[J]. Engineering Applications of Artificial Intelligence, 2020, 92: 103641. Xu jincheng, Qingfeng Du*. Learning transferable features in meta-learning for few-shot text classification[J]. Pattern Recognition Letters, 2020, 135: 271-278. Xu jincheng, Qingfeng Du*. Learning neural networks for text classification by exploiting label relations[J]. Multimedia Tools and Applications, 2020, 79: 22551-22567. Xu jincheng, Qingfeng Du*. On the Interpretation of Convolutional Neural Networks for Text Classification[C]//24th European Conference on Artificial Intelligence. IOS Press BV, 2020: 2252-2259. Xu jincheng, Qingfeng Du*. A Deep Investigation into fastText[C]//2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS). IEEE, 2019: 1714-1719. Ni yiwei, Qingfeng Du*, Xu jincheng. Document-Improved Hierarchical Modular Attention for Event Detection[C]//International Conference on Knowledge Science, Engineering and Management. Springer, Cham, 2020: 325-335. Qingzhi S., Qingfeng Du*, Chenxi Z., et al. Chinese News Event Corpus Construction Method Based on Syntax Tree[C]//Proceedings of the 2020 3rd International Conference on Big Data Technologies. 2020: 20-25. Qiu Juan, Qingfeng Du*, Qian Chongshu. KPI-TSAD: A Time-Series Anomaly Detector for KPI Monitoring in Cloud Applications. SYMMETRY-BASEL. NOV 2019, 11(11): 1350. Yin K, Qingfeng Du*, Qiu Juan. Analyse resilience risks in microservice architecture systems with causality search and inference algorithms[J]. International Journal of Web and Grid Services, 2020, 16(2): 147-171. Qiu Juan, Qingfeng Du*, Yin K., et al. A causality mining and knowledge graph based method of root cause diagnosis for performance anomaly in cloud applications[J]. Applied Sciences, 2020, 10(6): 2166. Qingfeng Du, Ruolin H., Guo K., et al. A Resilience Test Case Design Method for Network Function Virtualization Platforms[C]. 2018 12th International Conference on Reliability, Maintainability, and Safety (ICRMS). IEEE, 2018: 208-217. Qiu Juan, Qingfeng Du*, He Y., et al. Performance Anomaly Detection Models of Virtual Machines for Network Function Virtualization Infrastructure with Machine Learning[C]. International Conference on Artificial Neural Networks. Springer, Cham, 2018: 479-488. Liu Jiaqi, Qingfeng Du*, Xu Jincheng. A Learning-Based Adjustment Model with Genetic Algorithm of Function Point Estimation.20th IEEE International Conference on High Performance Computing and Communications (HPCC). Exeter, ENGLAND. 2018: 51-58. Qingfeng Du, Ni Z., Zhu R., et al. A Service-Based Testing Framework for NFV Platform Performance Evaluation[C]. 2018 12th International Conference on Reliability, Maintainability, and Safety (ICRMS). IEEE, 2018: 254-261. Qingfeng Du, Huan L., Kanglin Y., et al. VM Reliability Modeling and Analysis for IaaS Could[C]. 2017 International Conference on Cyber-Enabled Distributed Computing and Knowledge Discovery (CyberC). IEEE, 2017: 258-265. Qingfeng Du, Yue T., Tiandi X., et al. A Method of Building Fault Repository for Cloud Infrastructure[C]. 2017 International Conference on Cyber-Enabled Distributed Computing and Knowledge Discovery (CyberC). IEEE, 2017: 220-228. Qiu Juan, Qingfeng Du*, Wang W., et al. Topic Crawler for OpenStack QA Knowledge Base[C]. 2017 International Conference on Cyber-Enabled Distributed Computing and Knowledge Discovery (CyberC). IEEE, 2017: 309-317. Zhang T, Qingfeng Du*, Xu J., et al. Software Defect Prediction and Localization with Attention-Based Models and Ensemble Learning[C]//the 27th Asia-Pacific Software Engineering Conference. IEEE, 2020. Qingfeng Du, Xie T., He Y.. Anomaly Detection and Diagnosis for Container-Based Microservices with Performance Monitoring[C]. International Conference on Algorithms and Architectures for Parallel Processing. Springer, Cham, 2018: 560-572. Li, Jiechu, Qingfeng Du*, et al. Helpful or not?an investigation on the feasibility of identifier splitting via CNN-BiLSTM-CRF.SEKE 2018: 30th International Conference on Software Engineering and Knowledge Engineering. Redwood City, San Francisco Bay, Califor. 2018:175-181. Qingfeng Du, Qiu Juan, Yin K., et al. High availability verification framework for OpenStack based on fault injection[C]. 2016 11th International Conference on Reliability, Maintainability and Safety (ICRMS). IEEE, 2016: 1-7. Qingfeng Du, He Y., Xie T., et al. An Approach of Collecting Performance Anomaly Dataset for NFV Infrastructure[C]. International Conference on Algorithms and Architectures for Parallel Processing. Springer, Cham, 2018: 59-71. 主编教材 1)《高级软件测试技术》，清华大学出版社 教育部“十一五”规划教材主编. 2)《软件测试》，教育部－IBM精品课程. 获奖 第四届同济大学“教学名师”奖 2004同济大学教学奖励金获得者 2005花旗集团“金融信息科技教育基金”优秀奖教金获得者 2009指导学生获得“花旗杯”金融与信息应用大赛三等奖 2010苏邦奖励金二等奖 2011被评为同济大学优秀毕业设计指导教师奖"
  },
  {
    "title": "方钰",
    "relative_url": "../info/1061/2815.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2815.htm",
    "html_content": "姓 名 方钰 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 感知与嵌入式系统 导师类型 博导/硕导 电子邮件 联系电话 通讯地址 上海市曹安公路4800号电信大楼 方钰，女，33岁，博士，教授。2006年获同济大学获博士学位。现就职于同济大学电子与信息工程学院，为同济大学嵌入式系统与服务计算教育部重点实验室、同济大学网格中心、微软--同济大学Windows移动及嵌入式技术中心主要技术负责人。 自攻读博士学位期间至今，一直从事网格计算、嵌入式系统、移动计算、移动导航及自组织网络方面的研究工作。先后参与了国家发改委重大项目“基于下一代互联网的智能交通监控系统”，国家863重大专项项目“市交通信息服务应用网格研究”，上海市科委重大项目“信息网格在交通信息服务中的应用”，国际合作项目“基于下一代无线宽带互联网技术的城市交通信息网络研究”、“基于Windows Mobile的交通实时信息服务系统”等10余项国家与地方科研项目的研究工作。 在JCST，计算机研究与发展，International Journal of Web Services Research等国内外期刊和GCC 2003，IEEE ICSOLI 2005，WCNM 2008等国内外学术会议上共发表论文10余篇，参与申请软件著作权及专利16项。 2007年参与项目“信息网格技术及其在交通信息服务中的应用研究”获教育部科技进步一等奖。2009年参与项目获上海市技术发明一等奖。博士论文“基于网格技术的移动导航数据模型、方法及服务研究”获得同济大学优秀博士论文称号。先后入选2007年同济大学青年骨干教师计划与2007年同济大学青年优秀人才培养行动计划，2008年或上海市优秀青年教师专项基金资助。"
  },
  {
    "title": "关佶红",
    "relative_url": "../info/1061/2814.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2814.htm",
    "html_content": "姓 名 关佶红 职 称 长聘教授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 认知与智能信息处理 导师类型 博导／硕导 电子邮件 jhguan@tongji.edu.cn 联系电话 65982954 通讯地址 上海市曹安公路4800号同济大学电信大楼 同济大学教授、博士生导师，计算机科学与技术专业负责人。现任同济大学研究生院副院长，曾任计算机科学与技术系系主任。1991年于华中师范大学计算机系获理学学士学位，1998年于武汉测绘科技大学计算机系获工学硕士学位，2002年于武汉大学获工学博士学位。1991年至2005年在武汉大学（包括原武汉测绘科技大学）计算机学院（系）从事科研与教学工作，2000年5月晋升副教授，2003年9月晋升教授，2004年6月获博士生导师资格。2005年3月人才引进至同济大学计算机系工作。 2015年获评上海市优秀学术带头人；2009年获评上海市曙光学者；2006年获教育部“新世纪优秀人才支持计划”资助；2004年获武汉市“晨光计划”资助。获教育部科技进步二等奖（排名第1）；上海市优秀博士论文、优秀硕士论文指导教师；中国计算机学会CCF杰出会员。 担任中国计算机学会数据库专委会委员、开放系统专委会委员、生物信息学专委会委员，同济大学计算机科学与技术系学术委员会委员、同济大学计算机科学与技术博士后流动站站务委员会委员。中国计算机学会高级会员、ACM会员。主讲教育部-IBM精品课程、上海市精品课程等。获评宝钢优秀教师奖、同济大学师德师风教师奖、特等奖教金、优秀导师春风化雨奖等。 迄今为止，主持国家自然科学基金、863计划等国家级和其它省部级科研项目等30余项。已发表及合作发表学术论文300余篇，主要在IEEE/ACM Trans.（TKDE、TCBB、TSC、TGRS、TITB）、NCR、Bioinformatics、IEEE Circuits and Systems Magazine、Scientific Reports、Knowledge-based Systems、PRE、EPJB、EPL、Physica A、International Journal on Digital Libraries、IEICE Transactions on Information Systems、Information Processing and Management、Computer and Mathematics with Applications、International Journal of Web Information Systems、Chinese Journal of Electronics、《软件学报》、《计算机研究与发展》、《高技术通讯》等国际期刊、国内核心以上期刊以及AAAI、VLDB、ICDE、SIGIR、RECOMB、BIBM、APBC、GIW、DASFAA、ACM-GIS、PAKDD、WAIM、ICADL等国际、国内学术会议上发表，SCI收录百余篇；与国内外同行合作编辑出版学术著作3部；获国家技术发明专利4项、登记软件著作权5项。 主要研究领域与研究兴趣包括： （1）大数据管理与智能分析、数据库与数据挖掘、深度学习等：主要研究大数据背景下的数据模型、存储、索引、查询、集成、压缩、信息服务、数据挖掘方法、智能分析算法、机器学习方法、深度学习、人工智能方法等，及大数据平台、云计算、GIS等技术，并面向智能交通、智慧城市、海洋大数据、医学大数据、金融大数据、空间数据工程等应用领域与其他相关交叉学科合作开展应用研究和系统开发等； （2）生物信息学和精准医疗方面：主要研究蛋白质结构与功能及相互作用预测、核小体定位、蛋白质相互作用能量热点预测、组蛋白修饰、增强子、启动子预测、微阵列数据分析、代谢网络分析、microRNA-mRNA相互作用预测、遗传与疾病、药物靶点与联合用药分析等，及生物信息数据库、精准医疗数据分析与应用、脑功能影像分析等； （3）复杂网络与博弈方面：针对社交网络等复杂网络研究网络建模、随机游走、网络动力学、博弈、链路预测等，并在社交网络、流言/疾病传播、分子聚合物网络、智能交通网络等方面进行实证研究。 关佶红教授课题组主页：http://dmb.tongji.edu.cn/ 数据管理与生物信息学实验室：同济大学电信学院429北 欢迎有志攻读博士、硕士的同学和从事博士后的研究人员联系我！"
  },
  {
    "title": "何良华",
    "relative_url": "../info/1061/2812.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2812.htm",
    "html_content": "姓 名 何良华 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 脑认知计算；人工智能与模式识别；机器学习；图像处理 导师类型 博导／硕导 电子邮件 helianghua@tongji.edu.cn 联系电话 021-69589867 通讯地址 上海市曹安公路4800号电信大楼 何良华，教授，博导。2005年博士毕业于东南大学后，进入同济大学控制科学与工程博士后站，2007年出站后留校任教。入选上海市启明星计划、教育部新世纪人才计划、“长江学者奖励计划”青年项目。 一直从事图象处理与模式识别、数据挖掘、机器学习等方面的研究。2011年之前，重点研究人脸图像判别与分析、人脸表情判别与分析、语音识别等。2011访问美国哥伦比亚大学医学中心，回国后，重点研究脑认知图像（fMRI）的分析与理解，脑电信号（EEG）的判别与分析、深度神经网络结构的智能学习、大数据下小样本问题的机器学习等方向。 主持多项国家级及省部级基金项目，其中主要包括国家自然科学基金（青年、面上）、教育部博士点基金、教育部重点项目、上海市基础研究重点项目。另外，作为主要完成人，还参与了科技部973、国际重点合作项目、863、发改委重大专项等项目。 在国内外核心刊物共发表文章50多篇，获得教育部高等学校科技进步一等奖2项、二等奖1项，教育部高等学校自然科学二等奖1项，上海市技术发明一等奖1项，申请发明专利8项，授权12项，获得软件著作权7项，通过教育部鉴定2项。 从2006年起，担任IEEE SMC-Systems，IEEE TC, IEEE TVT, IEEE BMI, Pattern Recognition, Pattern Recognition Letters等国际著名刊物的审稿人。 如果您热爱脑科学、认知科学、人工智能，欢迎报考！ 上一条：梁舒"
  },
  {
    "title": "胡亮",
    "relative_url": "../info/1061/2811.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2811.htm",
    "html_content": "姓 名 胡亮 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 人工智能、推荐系统、数据科学 导师类型 博导/硕导 电子邮件 lianghu@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信学院420室 胡亮，分别在上海交通大学计算机科学与工程系，获得计算机应用技术博士学位，以及澳大利亚悉尼科技大学（University of Technology Sydney），高级分析学院（Advanced Analytics Institute，AAI），获得分析学（Analytics）博士学位。研究领域包括推荐系统、机器学习、深度学习、数据科学，以及交叉学科启发和融合的智能技术。在跨领域学习、多模态学习、复杂关系学习、行为序列分析与预测、多目标优化等众多研究方向，发表超过40篇高水平学术论文，其中包括中国计算机学会(CCF) A类刊物20余篇，CCF B以及JCR一区刊物10余篇，包括WWW、IJCAI、AAAI、ICDM、ICWS、TOIS、TKDE、IEEE IS等。 在众多高水平人工智能国际会议（IJCAI、AAAI、ICDM、CIKM、KDD等）担任程序委员会委员，并担任十余个著名人工智能和数据科学相关的国际期刊的审稿人，包括ACM Computing Survey、IEEE TKDE、ACM TOIS、IEEE TPAMI等。以共同主席身份在IEEE ICDM、DSAA等著名国际学术会议上组织了关于人工智能、神经网络和推荐系统的多个研讨会(Workshop)和特别专题（Special Session）。此外，在IJCAI、AAAI、KDD、ICDM等多个顶级人工智能及数据科学会议上，进行了多个关于智能推荐系统的专题报告（Tutorial）。基于所做出的贡献，已获得了十余项科研学术奖励，并入选上海海外高层次人才，以及国家自然科学基金优秀青年科学基金项目（海外）。 热烈欢迎对未知充满好奇，对科研充满热情，有求实、创新、协作精神的同学加入到实验室，共同研究和探索人工智能的基础理论和方法、人工智能+金融/医疗/制造/交通/电子商务等新型的应用、以及受脑科学、神经科学、物理学等交叉学科启发的前沿智能理论和方法。"
  },
  {
    "title": "江建慧",
    "relative_url": "../info/1061/2742.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2742.htm",
    "html_content": "江建慧 博士、教授地址：上海市嘉定区曹安公路4800号邮政编码：201804Email：jhjiang@tongji.edu.cn 办公室：同济大学嘉定校区济事楼418室 [周一、周二、周四] 研究方向：可信赖系统与网络软件可靠性工程VLSI/SoC测试与容错性能评测与设计优化 主讲课程：容错与安全计算 / 本 [14秋~]安全体系结构与管理 / 本 [12春~20春]可信系统 / 硕 [13春~]软件可靠性工程 / 博 [12秋~13秋、15秋~16秋、19秋~20秋] 个人简况 江建慧，男，汉族，1964年11月生，浙江淳安人。1981年进入原上海铁道学院学习，1985年获工学学士学位，1988年获工学硕士学位，后留校任教。1994年7月任副教授，1995年~1999年为原上海铁道大学在职博士研究生，1999年获工学博士学位，2000年12月任教授。2000年4月起于同济大学工作，2000年9月~2002年7月为复旦大学计算机科学与技术博士后流动站博士后。2000年9月聘为硕士生导师，2003年11月聘为博士生导师。2004年~2007年任同济大学电子与信息工程学院计算机科学与技术系副主任，2007年~2011年任同济大学电子与信息工程学院计算机科学与技术系主任，2011年9月起任同济大学软件学院副院长。 兼任中国计算机学会（CCF）容错计算专业委员会副主任、中国计量测试学会集成电路测试专业委员会副主任、上海市高等教育学会高校计算机专业委员会主任，以及《同济大学学报（自然科学版）》、《智能物联技术》编辑委员会委员等。担任过多个国际学术会议和CCF全国性学术会议的会议主席和程序委员会主席、副主席和委员，《电路与系统学报》、《信息网络安全》等刊物的编辑委员会委员，《中国科学：信息科学》测试技术专刊特约编辑。 长期从事容错计算、测试与诊断、性能评测与设计优化等方向的理论研究和技术开发，以及在信息传输和软件、交通运输、电力、制造等行业的工程应用工作。负责和参与完成了国家重点基础研究计划（973）项目1项，国家高技术研究计划（863）项目1项，国家自然科学基金项目（含重点、面上、重大研究计划、青年）7项，上海市科委重点科技攻关计划项目3项，上海市科委基地建设项目1项，铁道部科技发展计划项目3项，上海市教委重点学科项目1项，其他省部级项目5项，以及华为技术有限公司、中广核工程有限公司等国内大型知名企业合作项目14项。现参与国家自然科学基金面上项目2项，负责华为技术有限公司、阿里云计算有限公司等企业合作项目多项。 多项成果用于企业的产品生产线、技术服务平台和工程项目。获国家发明专利9项，软件著作权9项。出版教材《计算机容错技术》（中国铁道出版社，1995）和《安全关键计算机系统》（中国铁道出版社，2003）。在Journal of Computer Science and Technology, IEEE Transactions on Reliability, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, IEEE Transactions on Systems, Man and Cybernetics: Systems, Journal of Electronic Testing: Theory and Applications, 《计算机学报》、《中国科学：信息科学》、《电子学报》、《计算机研究与发展》、《计算机辅助设计与图形学学报》、ITC、DATE、ATS、PRDC等国内外学术刊物和学术会议上发表论文200余篇，SCI/SCIE/EI收录100余篇。 近年来主讲“容错与安全计算”、“安全体系结构与管理”、“可信系统”、“软件可靠性工程”等本科生和研究生课程。主持省部级教改项目多项，发表教改论文多篇。培养获得学位的工学博士生18人、工学硕士生52人、工程硕士生30人，其中，毕业非在职研究生的首次就业单位包括高校（如浙江工业大学、湖州师范学院、上海应用技术学院、上海第二工业大学）、科研院所（如上海计算机软件技术开发中心）、政府机构（如中国人民银行、上海市质量技术监督局）、企业（如华为、腾讯、百度、网易、奇虎360、盛大网络、上汽集团、大唐电信、支付宝、中国银联、中国工商银行、中国建设银行、招商银行、中国平安、上海证券交易所、中国金融期货交易所、Morgan Stanley、Intel、IBM、EMC、Cisco、Yahoo、Motorola、Alcatel、NXP、Nvidia、Synopsys、Advantest、SAP、Autodesk）等。 获华为无线网络产品线“2015年价值合作成果奖”，2014年上海市科技进步一等奖，2013年上海市教学成果一等奖，2006年复旦大学优秀博士后，1997年上海市高校优秀教材二等奖，1997年宝钢教育基金优秀教师奖等奖项或荣誉称号。 部分项目 国家自然科学基金面上项目（61772199）：基于程序状态分析的核函数软件失效预测关键技术研究，2018年~2021年，同济大学方负责人，承担单位：湖州师范学院、同济大学 国家自然科学基金重点项目（61432017）：差错容忍计算器件基础理论与方法，2015年~2019年，同济大学方负责人，承担单位：中国科学院计算技术研究所、香港中文大学深圳研究院、同济大学 江苏省产学研联合创新资金项目（BY2013095）子课题（BY2013095-5-06）：未来网络的容错与容侵，2014年~2015年，负责人，承担单位：同济大学 上海申通地铁集团公司科研项目：轨道交通网络信息化规划与应用研究，2008年~2009年，同济大学方负责人，承担单位：上海计算机软件技术开发中心、同济大学 国家高技术研究发展计划（863计划）项目（2007AA01Z142）：软件可信性评估方法和工具及其应用，2007年~2009年，负责人，承担单位：同济大学 上海市科学技术委员会重点科技攻关计划项目（06DZ15003）：轨道交通乘客信息系统终端控制设备、车辆工况监测、车地通信以及电力、设备监控系统的嵌入式技术应用研究，2006年~2008年，同济大学方负责人，承担单位：上海申通轨道交通研究咨询有限公司、同济大学、东华大学、上海电器科学研究所（集团）有限公司等 国家重点基础研究计划（973计划）课题（2005CB321604）子课题：VLSI高可靠设计与评估，2005年~2007年，子课题负责人，承担单位：同济大学 上海市科学技术委员会重点科技攻关计划项目（04DZ15032）：轨道交通自动售检票系统终端设备嵌入式技术应用，2005年~2006年，同济大学方负责人，承担单位：上海申通轨道交通研究咨询有限公司、同济大学、上海华虹计通智能卡系统有限公司等 国家自然科学基金重大研究计划《半导体集成化芯片系统基础研究》面上课题（90207021）：系统芯片在线测试与容错技术研究，2003年~2005年，负责人，承担单位：同济大学 上海市科学技术委员会信息技术领域重点科技攻关计划项目（035115023）：实时嵌入式软件系统测试技术及平台的研究与应用，2003年~2005年，负责人，承担单位：上海计算机软件技术开发中心、同济大学 上海高等学校青年教师学术基金项目（95QD18）：实时混合容错理论及容错专用部件结构研究和模拟，1995年~1997年，负责人 铁道部科技基金项目（J92X015）：多处理机和VLSI/WSI阵列的自动重构技术及其性能评价，1992年~1994年，负责人 发明专利 江建慧, 于露, 张颖. 基于有界模型检验的微型木马检测方法. 中国发明专利, ZL201810437259.0 江建慧, 张威, 张颖. 基于参数Bootstrap重抽样的软件失效时间预测方法. 中国发明专利, ZL201810693449.9 张颖, 洪欣鹏, 江建慧, 王冬青. 容忍多故障的大规模三维片上网络确定性路径路由方法. 中国发明专利, ZL202010791331.7 张颖, 陈中胜, 季鹏飞, 江建慧. 针对超大规模片上网络容忍众故障的确定性路径路由方法. 中国发明专利, ZL201910222208.0 张颖, 江建慧. 基于有界模型检验的片上网络固定型故障在线测试方法. 中国发明专利, ZL201810072146.5 江建慧, 陆曹波, 张颖. 一种片上网络应用的广度优先贪心映射方法. 中国发明专利, ZL201710599782.9 蒋云良, 楼俊钢, 顾永跟, 沈张果, 江建慧. 一种基于QBGSA-RVR的软件可靠性预测方法. 中国发明专利, ZL201510675965.5 张颖, 江建慧. 一种以内升温方式检测时延故障的定温指令级自测试方法. 中国发明专利, ZL201510012121.2 江建慧, 闵应骅. 自诊断的多模冗余系统. 中国发明专利, ZL01124286.8 教材、专著与报告章节 鄢贵海, 江建慧, 李华伟, 李晓维. 微处理器芯片可靠性设计研究进展. 2012中国计算机科学技术发展报告, 中国计算机学会主编, 北京: 机械工业出版社, 2013, 174-202 刘佳翔, 江建慧, 靳昂. 一个Java程序的动态故障注入工具原型. 工业软件研发、测试与质量管理论丛, 上海: 上海社会科学院出版社, 2012, 36-52 李雪, 江建慧. Linux进程切换和优先级倒置解除时间的精确测量. 工业软件研发、测试与质量管理论丛, 上海: 上海社会科学院出版社, 2012, 17-26 员春欣, 江建慧. 安全关键计算机系统. 北京: 中国铁道出版社, 2003 江建慧. 失效安全技术及自校验技术. 计算机容错技术, 胡谋主编, 第五章, 北京: 中国铁道出版社, 1995, 157-199（获1997年上海市高校优秀教材二等奖） 部分刊物论文 Zhen Wang, Guofa Zhang, Jing Ye, Jianhui Jiang*, Fengyong Li, Yong Wang. Accurate reliability analysis methods for approximate computing circuits. Tsinghua Science and Technology, accepted Naijin Chen, Zhen Wang, Ruixiang He, Jianhui Jiang, Fei Cheng, Chenghao Han. Efficient scheduling mapping algorithm for row parallel coarse-grained reconfigurable architecture. Tsinghua Science and Technology, 2021, 26(5): 724 - 735 Jianhui Jiang, Tao Wang, Zhen Wang. Probability gate model based methods for approximate arithmetic circuits reliability estimation. CCF Transactions on High Performance Computing, 2021, 3(2): 201 - 219 Ying Zhang, Xinpeng Hong, Zhongsheng Chen, Zebo Peng, Jianhui Jiang. A deterministic-path routing algorithm for tolerating many faults on very-large-scale network-on-chip. ACM Transactions on Design Automation of Electronic Systems, 2021, 26(1): 8:1 - 8:26 Jie Xiao, Zhanhui Shi, Weidong Zhu, Jianhui Jiang*, Qianwei Zhou, Jungang Lou, Yujiao Huang, Qiou Ji and Ziwen Sun. Uniform non-Bernoulli sequences oriented locating method for reliability-critical gates. Tsinghua Science and Technology, 2021, 26(1): 24 - 35 Wei Zhang, Xiao Chen, and Jianghui Jiang*. A multi-objective optimization method of virtual machine fault-tolerant static placement for star topological cloud systems. Tsinghua Science and Technology, 2021, 26(1): 95 - 111 Yuchang Mo, Liudong Xing, Jianhui Jiang. Modeling and analyzing linear wireless sensor networks with backbone support. IEEE Transactions on Systems, Man and Cybernetics: Systems, 2020, 50(10): 3912 - 3924 Ying Zhang, Weihong Yu, Xiaodong Chen and Jianhui Jiang*. Parallel genetic algorithm to extend the lifespan of internet of things in 5G networks. IEEE Access, 2020, Vol. 8, pp. 149630 - 149642 Yuchang Mo, Liudong Xing, Wenzhong Guo, Shaobin Cai, Zhao Zhang, Jian Hui Jiang. Reliability analysis of IoT networks with community structures. IEEE Transactions on Network Science and Engineering, 2020, 7(1): 304 - 315 Ying Zhang, Krishnendu Chakrabarty, Zebo Peng, Ahmed Rezine, Huawei Li, Petru Eles, Jianhui Jiang. Software-based self-testing using bounded model checking for out-of-order superscalar processors. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 2020, 39(3): 714 - 727 Jie Xiao, Weifeng Ma, Jungang Lou, Jianhui Jiang, Yujiao Huang, Zhanhui Shi, Qing Shen, and Xuhua Yang. Circuit reliability prediction based on deep autoencoder network. Neurocomputing, 2019, 370, 140 - 154 Jie Xiao, Zhanhui Shi, Jianhui Jiang*, Xuhua Yang, Yujiao Huang, Haigen Hu. A locating method for reliability-critical gates with a parallel-structured genetic algorithm. Journal of Computer Science and Technology, 2019, 34(5): 1136-1151 Zhen Wang, Jianhui Jiang*, Tao Wang. Failure probability analysis and critical node determination for approximate circuits. Integration, the VLSI Journal, 2019, 68(5): 122 - 128 Jie Xiao, Jungang Lou and Jianhui Jiang. A fast and effective sensitivity calculation method for circuit input vectors. IEEE Transactions on Reliability, 2019, 68(3): 938 - 953 Fanrong Kong, Jianhui Jiang*, Yan Huang. An adaptive multi-swarm competition in particle swarm optimizer for large scale optimization. Mathematics, 2019, 7(6), 521 张颖, 张嘉琦, 王真, 江建慧. 基于有界模型检测的门级软件自测试方法. 同济大学学报(自然科学版), 2018, 46(11): 1576 - 1581 肖杰, 李伟, 江建慧*, 杨旭华, 高楠, 胡海根. 一种考虑屏蔽效应的电路输入向量敏感性计算方法. 计算机学报, 2018, 41(10): 2282 - 2294 江建慧, 吴捷程, 孙亚. 一种基于异常控制流的错误程序行为分析方法. 同济大学学报(自然科学版), 2018, 46(7): 972 - 981 Jie Xiao, Jianhui Jiang, Xiaoxin Li, Yujiao Huang, Xuhua Yang, Zhanhui Shi, and Jungang Lou. A novel trust evaluation method for logic circuits in IoT applications based on the E-PTM model. IEEE Access, 2018, 6: 35683 - 35696 Jie Xiao, Jungang Lou, Jianhui Jiang, Xiaoxin Li, Xuhua Yang, and Yujiao Huang. Blockchain architecture reliability-based measurement for circuit unit importance. IEEE Access, 2018, 6: 15326 - 15334 王真, 江建慧*, 陈乃金, 卢光明, 张颖. BTI作用下三因素对集成电路软差错率的影响. 计算机研究与发展, 2018, 55 (5): 1108 - 1116 Ying Zhang, Li Ling, Jianhui Jiang*, and Jie Xiao. Thermal-aware SoC test scheduling with voltage/frequency scaling and test partition. Journal of Electronic Testing: Theory and Applications, 2018, 34(4): 447 - 460 卜登立, 江建慧, 罗文浪. 基于2个阶段遗传算法的MPRM电路面积与SER折中优化. 计算机辅助设计与图形学学报, 2017, 29(10): 1924 - 1934 Fanrong Kong, Jianhui Jiang, Zhigang Ding, Junjie Hu, Weian Guo, Lei Wang. A personalized rolling optimal charging schedule for plug-in hybrid electric vehicle based on statistical energy demand analysis and heuristic algorithm. Energies, 2017, 10(9), 1333 陈乃金, 冯志勇, 江建慧, 何瑞祥, 王真. 行并行可重构单元阵列流水映射性能评估. 同济大学学报(自然科学版), 2017, 45(8): 1218 - 1226 王真, 江建慧*, 陈乃金. 考虑偏置温度不稳定性的软差错率分析. 电子与信息学报, 2017, 39 (7): 1640 - 1645 Chunyan Shuai, Xin Ouyang, Jianhui Jiang, Siqi Li. P-CCBFF: A lightweight cooperative detection and trackback framework of DDoS/DoS attacks. Journal of Internet Technology, 2017, 18(5): 1147 - 1158 凌立, 江建慧*, 张颖, 王真. 基于聚类的异步时钟SoC测试. 电子学报, 2017, 45(3): 740 - 746 卜登立, 江建慧. 基于Pareto支配的MPRM电路面积与可靠性优化. 电子学报, 2016, 44(11): 2653 - 2659 欧阳城添, 江建慧, 王曦. 触发器可靠度计算的F-PTM方法. 电子学报, 2016, 44(9): 2219 - 2226 Jie Xiao, William Lee, Jianhui Jiang, Xuhua Yang. Circuit reliability estimation based on an iterative PTM model with hybrid coding. Microelectronics Journal, 2016, 52, 117 - 123 Xiao Chen and Jianhui Jiang. A method of virtual machine placement for fault-tolerant cloud applications. Intelligent Automation and Soft Computing, 2016, 22(4): 587 - 597 陈乃金, 江建慧. 多叉树数据流图粗粒度可重构单元阵列映射算法. 计算机辅助设计与图形学学报, 2016, 28(7): 1180 - 1187 陈晓, 江建慧. 动态可配置的两阶段虚拟机容错分配方法. 电子科技大学学报, 2016, 45(3): 442 - 447 凌立, 江建慧*. 基于异步时钟的SoC功耗约束测试调度优化. 计算机研究与发展, 2015, 52(11): 2589 - 2598 陈乃金, 江建慧. 一种粗粒度可重构体系结构多目标优化映射算法. 电子学报, 2015, 43(11): 2151 - 2160 陈乃金, 冯志勇, 江建慧. 用于二维RCA跨层数据传输的旁节点无冗余添加算法. 通信学报, 2015, 36(4): 35 - 51 陈乃金, 江建慧. 考虑通信成本和硬件碎片利用的簇划分算法. 计算机辅助设计与图形学学报, 2015, 27(4): 754 - 763 张颖, 江建慧, 李华伟, 李晓维. 基于信号跳变时间可调整的容错路由器. 同济大学学报（自然科学版）, 2015, 43(2): 305 - 311 卜登立, 江建慧. 基于对偶逻辑的混合极性RM电路极性转换和优化方法. 电子学报, 2015, 43(1): 79 - 85 张丹青, 江建慧, 陈林博. 一种对程序故障行为和失效行为的聚类有效性验证方法. 中国科学: 信息科学, 2014, 44(10): 1323 - 1344 肖杰, 江建慧, 梁家荣. 面向晶体管级广义门电路的PTM可靠性计算方法. 中国科学: 信息科学, 2014, 44(10): 1226 - 1238 肖杰, 江建慧, 朱旭光. 一种基于迭代PTM模型的电路可靠性评估方法. 计算机学报, 2014, 37(7): 1508 - 1520 陈晓, 江建慧. 基于量子行为粒子群优化的软件可靠性模型参数估计. 高技术通讯, 2014, 24(5): 479 - 485 肖杰, 江建慧, 杨旭华, 梁家荣. 一个面向缺陷分析的电路成品率与可靠性的关系模型. 电子学报, 2014, 42(4): 747 - 755 陈林博, 江建慧, 张丹青. 用多密钥加密方法防御面向返回编程的攻击. 高技术通讯, 2014, 24(4): 355 - 364 江建慧，刘宇，朱一南，钱剑琤. 一种结合线程特性的SMT指令队列竞争缓解策略. 同济大学学报（自然科学版）, 2013, 41(12): 1889 - 1897 楼俊钢, 江建慧, 沈张果, 蒋云良. 软件可靠性预测的相关向量机模型. 计算机研究与发展, 2013, 50(7): 1542 - 1550 楼俊钢, 蒋云良, 申情, 江建慧. 软件可靠性预测中不同核函数的预测能力评估. 计算机学报, 2013, 36(6): 1303 - 1311 肖杰, 江建慧. 考虑时间因素的不同基本门故障概率计算. 电子学报, 2013, 41(4): 666 - 673 肖杰, 江建慧. 面向缺陷分析的广义门电路故障概率的计算. 计算机辅助设计与图形学学报, 2013, 25(4): 564 - 572 陈乃金, 江建慧. 融合面积估算和多目标优化的硬件任务划分算法. 通信学报, 2013, 34(2): 40 - 55 卜登立, 江建慧. 基于混合多值离散粒子群优化的混合极性Reed-Muller最小化算法. 电子与信息学报, 2013, 35(2): 361 - 367 卜登立, 江建慧. 使用系数矩阵变换极性转换的MPRM电路面积优化. 计算机辅助设计与图形学学报, 2013, 25(1): 126 - 135 欧阳城添, 江建慧. 基于概率转移矩阵的时序电路可靠度估计方法. 电子学报, 2013, 41(1): 171 - 177 胡嘉伟, 江建慧. 一种面向软件可靠性评估的故障注入机制的设计与实现. 计算机辅助设计与图形学学报, 2012, 24(6): 741 - 751 陈乃金, 江建慧, 陈昕, 周洲, 徐莹. 一种考虑执行延迟最小化和资源约束的改进层划分算法. 电子学报, 2012, 40(5): 1055 - 1066 Liangliang Kong and Jianhui Jiang. A worst-case execution time analysis approach based on independent paths for ARM programs. Wuhan University Journal of Natural Sciences, 2012, 17(5): 391 - 399 陈林博, 江建慧, 张丹青. 基于双栈的缓冲区溢出攻击的防御. 同济大学学报（自然科学版）, 2012, 40(3): 452 - 458 孔亮亮, 江建慧, 肖杰, 蒋圆圆. ARM程序执行周期估计的基于模拟的非线性方法. 计算机研究与发展, 2012, 49(2): 392 - 401 肖杰, 江建慧. 结合版图结构信息的基本门电路故障概率估计. 电子学报, 2012, 40(2): 235 - 240 周焕盛, 江建慧. 一个多维信息安全指标体系及等级保护量化模型. 中国科学技术大学学报, 2012, 42(1): 67 - 76 靳昂, 江建慧, 楼俊钢. 基于加速寿命试验的Web服务器测评. 计算机研究与发展, 2011, 47(S): 229 - 236 郑剑, 江建慧. 基于标签转换系统的Web服务行为失配类型的判定方法. 计算机集成制造系统, 2011, 17(12): 2743 - 2751 Jie YIN, Jianhui JIANG, Yu LIU. AC-RMT: A fault-tolerance SMT architecture based on asynchronous checkpoint. Intelligent Automation and Soft Computing, 2011, 17(6): 803 - 813 印杰, 江建慧. 冗余多线程结构的重命名寄存器配对共享分配策略. 计算机研究与发展, 2011, 48(3): 516 - 527 陈林博, 江建慧, 张丹青, 帅春燕. 基于多版本冗余进程的容侵系统. 清华大学学报（自然科学版），2011, 51(S1): 1519 - 1526 杨洋, 帅春燕, 江建慧. 基于堆栈分析的缓冲区溢出漏洞检测方法. 计算机研究与发展, 2011, 47(S): 291 - 295 郑剑, 江建慧. 基于弱同步的服务交互适配方法. 计算机集成制造系统, 2010, 16(8): 1688 - 1695 楼俊钢, 江建慧, 靳昂. 考虑样本与均值差别的软件可靠性模型. 计算机学报, 2010, 33(7): 1279 - 1287 江建慧, 章力源, 金涛, 陈川. 基于k循环随机序列的动态缓冲区溢出防御. 同济大学学报（自然科学版）, 2010, 38(6): 917 - 924 田春岐, 江建慧, 胡治国, 李峰. 一种基于聚集超级节点的P2P网络信任模型. 计算机学报, 2010, 33(2): 345 - 355 孔亮亮, 江建慧, 靳昂. 关于系统性能度量方法. 哈尔滨工业大学学报, 2009, 41(S1): 135 - 141 王真, 江建慧. 考虑版图级因素的PTM中故障感染率的计算. 哈尔滨工业大学学报, 2009, 41(S1): 124 - 129 楼俊钢, 江建慧, 赵时旻, 孔亮亮. 基于随机完全区组设计的嵌入式系统性能分析. 同济大学学报（自然科学版）, 2009, 37(12): 1663 - 1667 王真, 江建慧. 基于概率转移矩阵的串行电路可靠度计算方法. 电子学报, 2009, 37(2): 241 - 247 张蕊, 江建慧, 楼俊钢, 沈君华, 王艳娜. 基于B/S结构的嵌入式系统测试平台. 计算机辅助设计与图形学学报, 2009, 21(1): 13 - 18 江建慧, 唐智杰. 测量嵌入式操作系统实时性能参数的新方法. 同济大学学报（自然科学版）, 2008, 36(9): 1260 - 1266 王真, 江建慧, 员春欣. 高性能处理器的差错校正技术. 计算机研究与发展, 2008, 45(2): 358 - 366 WANG Zhen, JIANG Jianhui, and YANG Guang. Implementation and analysis of probabilistic methods for gate-level circuit reliability estimation. Tsinghua Science and Technology, 2007, 12(S1): 32 - 38 靳昂, 江建慧. 故障注入技术及其应用. 中国计算机学会通讯, 2007, 3(7): 32 - 40 Wang Hongcheng, Jiang Jianhui, and Jin Ang. A performance benchmark suite for real-time embedded systems. High Technology Letters, 2006, 12(S): 55 - 59 Liu Hongtao and Jiang Jianhui. A robustness testing platform for file system. High Technology Letters, 2006, 12(S): 23 - 27 Wei Wang and Jian-Hui Jiang. Hardware complexity and fault response rate of a class of online-testing and fault-tolerant structures in Xilinx CPLD. 哈尔滨工业大学学报, 2006, 38(S): 412 - 416 江建慧, 梁剑华, 靳昂, 胡瑾. Linux上软件实现的瞬时故障注入方案及其实现. 同济大学学报（自然科学版）, 2006, 34(6): 823 - 827 Jian-Hui Jiang. An error recoverable structure based on complementary logic and alternating-retry. Journal of Computer Science and Technology, 2005, 20(6): 885 - 894 江建慧, 员春欣. 芯片级系统的在线测试技术. 计算机研究与发展, 2004, 41(9): 1593 - 1603 陈火军, 江建慧. 门级故障到寄存器传输级故障的映射. 同济大学学报（自然科学版）, 2004, 32(8): 1061 - 1066 江建慧, 朱为国. 嵌入式存储器的内建自测试和内建自修复. 同济大学学报（自然科学版）, 2004, 32(8): 1050 - 1056 JIANG Jianhui, MIN Yinghua, and PENG Chenglian. Fault-tolerant systems with concurrent error-locating capability. Journal of Computer Science and Technology, 2003, 18(2): 190 - 200 江建慧, 闵应骅, 彭澄廉. 一种用于双模冗余系统的健壮故障安全接口. 同济大学学报（自然科学版）, 2002, 30(10): 1164 - 1168 江建慧, 闵应骅, 彭澄廉. N为偶数的并发差错可定位N-模冗余结构. 计算机学报, 2002, 25(8): 837 - 844 江建慧. 交替互补定位器及其用于双模比较冗余结构的差错定位. 计算机研究与发展, 2001, 38(6): 754 - 764 江建慧, 施鸿宝. 具有故障定位能力的健壮故障安全系统. 电子学报, 2000, 28(8): 35 - 38 江建慧, 闵应骅, 施鸿宝. 数字电路并发差错定位的概念与基本结构. 计算机研究与发展, 2000, 37(5): 532 - 542 江建慧, 闵应骅, 施鸿宝. 一种扩展故障安全系统理论. 电路与系统学报, 1999, 4(4): 1 - 9 江建慧, 闵应骅, 施鸿宝. 数字电路并发差错检测的新概念. 计算机研究与发展, 1999, 36(9): 1133 - 1141 江建慧, 赵晓东, 童梅, 高莹心. 组合事务块及其在C语言和FOXPRO中的实现. 计算机研究与发展, 1998, 35(9): 859 - 864 江建慧, 胡谋. 安全逻辑器件与CMOS B/T逻辑电路及其噪声容限. 计算机研究与发展, 1993, 30(5): 55 - 61 部分会议论文 Xinying Liu, Jianhui Jiang*, and Long Li. Computation offloading and task scheduling with fault-tolerance for minimizing redundancy in edge computing. The First Workshop on Dependability Modeling and Design, Wuhan, China, Oct 2021 Zhen Wang, Guofa Zhang, Jing Ye, and Jianhui Jiang*. Reliability evaluation of approximate arithmetic circuits based on signal probability. The 5th IEEE International Test Conference in Asia, Shanghai, China, Aug 2021 Xuliang Chen, Jianhui Jiang*, Wei Zhang, Xuze Xia. Fault diagnosis for open source software based on dynamic tracking. Proceedings of 7th International Conference on Dependable Systems and Their Applications, Xi’an, China, Nov 2020, pp. 263 - 268 Jiaqi Zhang, Ying Zhang, Huawei Li, and Jianhui Jiang. HIT: a hidden instruction Trojan model for microprocessors. Proceedings of 23rd IEEE/ACM/IFIP Design, Automation, and Test in Europe Conference and Exhibition, Grenoble, France, Mar 2020, pp. 1271 - 1274 Xuze Xia, Wei Zhang, and Jianhui Jiang*. Ensemble methods for anomaly detection based on system log. Proceedings of IEEE 24th Pacific Rim International Symposium on Dependable Computing, Kyoto, Japan, Dec 2019, pp. 93 - 94 Qian Wang, Jianhui Jiang*, and Long Li. A reliability automatic assessment framework for open source software. Proceedings of IEEE 24th Pacific Rim International Symposium on Dependable Computing, Kyoto, Japan, Dec 2019, pp. 91 - 92 Tao Wang, Jianhui Jiang*, and Zhen Wang. Reliability estimation of approximate circuits based on probabilistic gate model. Proceedings of IEEE 24th Pacific Rim International Symposium on Dependable Computing, Kyoto, Japan, Dec 2019, pp. 55 - 56 Zhongshen Chen, Ying Zhang, Zebo Peng, Jianhui Jiang. A deterministic-path routing algorithm for tolerating many faults on wafer-level NoC. Proceedings of 22nd IEEE/IFIP Design, Automation, and Test in Europe Conference and Exhibition, Florence, Italy, Mar 2019 Jianhui Jiang, Guangming Lu, Zhen Wang. Methods for approximate adders reliability estimation based on PTM model. Proceedings of 23rd IEEE Pacific Rim International Symposium on Dependable Computing, Taipei, Taiwan, Dec 2018, pp. 221 - 222 Ying Zhang, Lu Yu, Huawei Li, Jianhui Jiang*. Small logic trojan testing using bounded model checking. Proceedings of 2nd IEEE International Test Conference in Asia, Harbin, China, Aug 2018, pp. 85 - 90 Ying Zhang, Krishnendu Chakrabarty*, Huawei Li, Jianhui Jiang*. Software-based online self-testing of network-on-chip using bounded model checking. Proceedings of 48th IEEE International Test Conference, Fort Worth, Texas, USA, Oct 2017 Xiao Chen, Jian-Hui Jiang and Qu Jiang. A method of self-adaptive pre-copy container checkpoint. Proceedings of 21st IEEE Pacific Rim International Symposium on Dependable Computing, Zhangjiajie, China, Nov 2015, pp. 290 - 300 Zhen Wang, Jianhui Jiang. Effect of bias temperature instability on soft error rate. Proceedings of 15th International Conference on Algorithms and Architectures for Parallel Processing (Workshops and Symposiums), Zhangjiajie, China, Nov 2015, pp. 736 - 745 Ying Zhang, Zebo Peng, Jianhui Jiang*, Huawei Li, Masahiro Fujita. Temperature-aware software-based self-testing for delay faults. Proceedings of 18th IEEE/ACM Design, Automation, and Test in Europe Conference and Exhibition, Grenoble, France, Mar 2015 Li Ling and Jianhui Jiang. Exploit voltage and frequency scaling for SoC test scheduling under thermal constraints. Proceedings of 23rd IEEE Asian Test Symposium, Hangzhou, China, Nov 2014, pp. 180 - 185 Danqing Zhang, Jianhui Jiang and Linbo Chen. Program behavior characterization and clustering : An empirical study for failure clustering. Proceedings of the Fourth IEEE International Workshop on Program Debugging, Pasadena, USA, Nov 2013, pp. 144 - 149 Liangliang Kong, Jianhui Jiang. A combined hardware/software measurement for ARM program execution time. Communications in Computer and Information Science, Vol. 337, 2013, 185 - 201 Chen Linbo, Jiang Jianhui and Zhang Danqing. Prevent code reuse attacks by using control flow lazily check. Proceedings of IEEE 18th Pacific Rim International Symposium on Dependable Computing, Niigata, Japan, Dec 2012, pp. 51 - 60 Naijin Chen and Jianhui Jiang. Mapping algorithm for coarse-grained reconfigurable multimedia architectures. Proceedings of 19th IEEE Reconfigurable Architectures Workshop, Shanghai, China, 2012, pp. 281 - 286 Jie Xiao, Jian-Hui Jiang, Xu-Guang Zhu, and Cheng-Tian Ouyang. A method of circuit reliability estimation based on iterative PTM model. Proceedings of IEEE 17th Pacific Rim International Symposium on Dependable Computing, Pasadena, California, USA, Dec 2011, pp. 276 - 277 Jie Yin and Jianhui Jiang. An asynchronous checkpoint-based redundant multithreading architecture. Proceedings of IEEE 16th Pacific Rim International Symposium on Dependable Computing, Tokyo, Japan, Dec 2010, pp. 243 - 244 Ying Wu, Jianhui Jiang, and Liangliang Kong. Sequential frequency vector based system call anomaly detection. Proceedings of IEEE 16th Pacific Rim International Symposium on Dependable Computing, Tokyo, Japan, Dec 2010, pp. 215 - 222 Chengtian Ouyang, Jianhui Jiang and Jie Xiao. Reliability evaluation of flip-flops based on probabilistic transfer matrices. Proceedings of IEEE 16th Pacific Rim International Symposium on Dependable Computing, Tokyo, Japan, Dec 2010, pp. 239 - 240 Liangliang Kong and Jianhui Jiang. A safe measurement-based worst-case execution time estimation using automatic test-data generation. Proceedings of IEEE 16th Pacific Rim International Symposium on Dependable Computing, Tokyo, Japan, Dec 2010, pp. 245 - 246 Jungang Lou, Jianhui Jiang, and Chunyan Shuai. A study on software reliability prediction based on transduction inference. Proceedings of IEEE 19th Asian Test Symposium,Shanghai, China, Dec 2010, pp. 77 - 80 Jie Yin and Jianhui Jiang. Design and analysis of an asynchronous checkpoint-based redundant multithreading architecture. Dependable Computing, vol. 25, San Antonio: TSI Press, 2010, pp. 519 - 524 Ang Jin and Jianhui Jiang. Fault injection scheme for embedded programs at machine code level and verification. Proceedings of 15th IEEE Pacific Rim International Symposium on Dependable Computing, Shanghai, China, Nov 2009, pp. 55 - 62 Lou Jun-gang, Jiang Jian-hui, Shuai Chun-yan, Zhang Rui, and Jin Ang. Software reliability prediction model based on relevance vector machine. Proceedings of 2009 IEEE International Conference on Intelligent Computing and Intelligent Systems, Shanghai, China, Nov 2009, pp. 229 - 233 Ying Wu and Jianhui Jiang. Frequency weighted Hamming distance for system call anomaly detection. Proceedings of the WRI World Congress on Computer Science and Information Engineering, Los Angeles, California, USA, Mar 2009, pp. 105 - 109 Zhang Rui, Jiang Jianhui, Yin Jie, Jin Ang, Lou Jungang, and Wu Ying. A new method for test suite reduction. Proceedings of 9th International Conference for Young Computer Scientists, Zhangjiajie, China, Nov 2008, pp. 1211 - 1216 Ang Jin, Jianhui Jiang, Jiawei Hu, and Jungang Lou. A PIN-based dynamic software fault injection system. Proceedings of 9th International Conference for Young Computer Scientists, Zhangjiajie, China, Nov 2008, pp. 2160 - 2167 Qian Feng-an and Jiang Jian-hui. A novel test case generation method of pair-wise testing. Proceedings of IEEE 16th Asian Test Symposium, Beijing, China, Oct 2007, pp. 149 - 154 Wang Wei and Jiang Jianhui. A new soft IP core for online-testing and fault-tolerant structures. Proceedings of 7th International Conference on ASIC, Guilin, China, Oct 2007, pp. 1006 - 1009 Wang Wei and Jiang Jianhui. A novel method for the construction of self-dual circuits. Proceedings of 6th International Conference on ASIC, Shanghai, China, Oct 2005, pp. 685 - 688 Ang Jin and Jian-Hui Jiang. Software-implemented fault injection at machine code level for ARM architecture. Proceedings of 7th International Conference on Electronic Measurement and Instruments, Vol. 8, Beijing, China, Aug 2005, pp. 8-173 - 8-178 Jian-Hui JIANG. Error detection and correction in VLSI systems by online testing and retrying. Proceedings of IEEE 12th Asian Test Symposium, Xi’an, China, Nov 2003 Na TANG, Jian-Hui JIANG, and Kenneth LIN. A high-performance 32-bit parallel multiplier using modified Booth’s algorithm and sign-deduction algorithm. Proceedings of 5th International Conference on ASIC, Beijing, China, Oct 2003, pp. 1281 - 1284 JIANG Jian-Hui. An efficient implementation scheme of DBench general dependability benchmark framework. Proceedings of 6th International Conference on Electronic Measurement and Instruments, vol. 1, Taiyuan, China, Aug 2003, pp. 836 - 839 Jianhui Jiang, Yinghua Min, and Chenglian Peng. Design and analysis of fault-tolerant memory systems based on replication and error control codes. Proceedings of 5th International Conference on Electronic Measurement and Instruments, Guilin, China, Nov 2001, pp. 463 - 466 Jianhui Jiang, Yinghua Min, and Chenglian Peng. VHDL modeling and analysis of error-control specific circuits for multiple-modular redundant systems with concurrent error location capability. Proceedings of 4th International Conference on ASIC, Shanghai, China, Oct 2001, pp. 570 - 573 Jianhui Jiang, Yinghua Min, and Chenglian Peng. On fault-tolerant systems with concurrent error location capability. Proceedings of 7th International Conference on Computer-Aided Design and Computer Graphics, Kunming, China, Aug 2001, pp. 616 - 623 Jianhui Jiang, Hongbao Shi, Yinghua Min, and Xiaodong Zhao. A novel NMR structure with concurrent output error location capability. Proceedings of IEEE Pacific Rim International Symposium on Dependable Computing, Hong Kong, Dec 1999, pp. 32 - 39 Jianhui Jiang, Yinghua Min, and Hongbao Shi. A theory of extended fault-masking digital circuits with concurrent error detection capability. Proceedings of 6th International Conference on Computer-Aided Design and Computer Graphics, Shanghai, China, Dec 1999, pp. 691 - 697 Jianhui Jiang, Mou Hu, and Hongbao Shi. A novel structure of multioutput hybrid logic networks based on self-checking logic and fail-safe logic for fault diagnosis. Proceedings of 5th International Conference on Computer-Aided Design and Computer Graphics, vol. 2, Shenzhen, China, Dec 1997, pp. 471 - 476 Jianhui Jiang and Mou Hu. The extended self-checking properties of alternating-complementary logic systems. Proceedings of International Workshop on Computer-Aided Design, Test, and Evaluation for Dependability, Beijing, China, July 1996, pp. 258 - 263 Jiang Jianhui and Hu Mou. Fault tolerance and pipelining of VLSI combinational logic networks. Proceedings of IEEE Region 10 International Conference on Computer, Communication, Automation and Power Engineering, vol.1, Beijing, China, Oct 1993, pp. 44 - 48 主要学术任职与学术活动 副主任，中国计算机学会容错计算专业委员会，2012年01月~ 副主任，中国计量测试学会集成电路测试专业委员会，2018年~ 常务委员，中国计算机学会嵌入式系统专业委员会，2016年~ 主任，上海市高等教育学会高校计算机专业委员会，2017年06月~ 副主任，上海市高等教育学会高校计算机专业委员会，2013年08月~2017年06月 委员，《同济大学学报（自然科学版）》编辑委员会，2018年~ 委员，《智能物联技术》编辑委员会，2018年~ 委员，《信息网络安全》编辑委员会，2014年~2016年 委员，《电路与系统学报》编辑委员会，2004年~2006年 特约编辑，《中国科学：信息科学》测试技术专刊，2014年，第44卷，第10期 General Co-Chair, The 5th International Test Conference in Asia, 2021 Program Co-Chair, The First Workshop on Dependability Modeling and Design (WDMD), 2021 Program Co-Chair, IEEE 11th Workshop on RTL and High Level Testing (WRTLT), 2010 Tutorial Chair, IEEE 19th Asian Test Symposium (ATS), 2010 Program Committee member, IEEE Pacific Rim International Symposium on Dependable Computing (PRDC), 2009 - 2011, 2015, 2017 - 2021 Program Committee member, IEEE ATS, 2007, 2010, 2018 Program Committee member, IEEE WRTLT, 2003, 2007, 2018 Program Committee member, IEEE Workshop on Dependable and Secure Nanocomputing (WDSN), 2011 大会共同主席，CCF全国容错计算学术会议，2021年 程序委员会主席，CCF全国容错计算学术会议，2015年 程序委员会共同主席 / 副主席，CCF中国测试学术会议，2006/2010/2020年 程序委员会主席，全国可信计算技术及应用学术研讨会，2004年 论坛共同主席，CCF中国测试学术会议，2018年 论坛共同主席，CCF全国容错计算学术会议，2017/2019年 程序委员会委员，CCF全国容错计算学术会议，2003/2005/2007/2009/2011/2013/2017年 程序委员会委员，CCF中国测试学术会议，2002/2004/2008/2012/2014/2016年 程序委员会委员，中国信息和通信安全学术会议，2011/2012年 程序委员会委员，CCF全国软件测试学术会议，2007/2009/2011年 程序委员会委员，CCF全国嵌入式系统学术会议，2016年 主要奖励和荣誉 同济大学教学成果一等奖，同济大学，2017年 华为无线网络产品线“2015年价值合作成果奖”，华为技术有限公司，2016年 上海市科技进步一等奖，上海市人民政府，2015年 上海市教学成果一等奖，上海市教育委员会、上海市人力资源和社会保障局，2013年 复旦大学优秀博士后，复旦大学，2006年 同济大学教学奖励金教学系列二等奖，同济大学，2005年 同济大学隧道奖励金二等奖，同济大学，2002年 铁道部青年科技拔尖人才，铁道部，1999年 宝钢教育基金优秀教师奖，宝钢教育基金理事会，1997年 上海市高校优秀教材二等奖，上海市教育委员会，1997年 第四届上海高校优秀青年教师，上海市教育委员会，1997年 铁道部科技进步四等奖，铁道部，1996年 第三届上海高校优秀青年教师，上海市教育委员会，1995年 上海市科技进步三等奖，上海市人民政府，1995年"
  },
  {
    "title": "李光耀",
    "relative_url": "../info/1061/2810.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2810.htm",
    "html_content": "姓 名 李光耀 职 称 研究员 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 仿真与多媒体处理 导师类型 博／硕导 电子邮件 联系电话 021-69587942 通讯地址 上海市曹安公路4800号电信大楼 研究领域 计算机辅助设计分析和仿真，虚拟现实，城市仿真和图形图像。 课程 计算机辅助分析与仿真 项目（主要承担项目） 1、基于虚拟现实技术的电力系统维修检测仿真培训系统/上海市科委国际合作项目 2、月球探测环境建模与演示方法研究/科技部863项目 3、基于x-线片的三维正颔骨骼形态和咬合关系研究/国家自然科学基金 4、应用旋动理论对成人渐进性下颌后缩发生机制的研究/国家自然科学基金 5、水环境对建筑空间环境影响的数字化关键技术研究/国家自然科学基金 6、基于图像结构和图像逻辑视觉认知分析的图像修复方法/国家自然科学基金 7、A919大型客机建模规范验证/大飞机专项 8、数字海洋地质网络三维信息服务系统/地质矿产专项 9、基于skyline海岸带综合地质调查数据成果展示/地质矿产专项 10、数据挖掘客户服务平台/上海市经信委 11、三维动画制作集成管理平台/上海市经信委 12、洋山深水港电力系统维修检测辅助仿真系统/上海市经信委 13、全数字化供配电综合仿真系统/上海市产学研计划 14、现代冶金企业过程质量大数据分析与决策平台/上海市产学研计划 15、公交新能源车辆充电综合决策技术现状及发展趋势分析/上海市产学研计划 16、可编程嵌入式电子设备的安全工业无线网络技术研发与应用/上海市经信委 17、视觉失真可容忍的群体化图像视频传输理论与方法/国家自然科学基金重点项目 18、口腔正畸数学三维图像诊断系统的研究/教育部优秀青年教师计划 出版物 论文 1、Chen Q, Li G, Xie L, et al. Structure guided image completion using texture synthesis and region segmentation[J]. Optik, 2019, 185: 896-909. （SCI） 2、Chen Q, Li G, Xie L, et al. Structure constrained image completion by geometric transformation model and dynamic patches[J]. Journal of Modern Optics, 2019, 66(7): 786-798. （SCI） 3、Li W, Li G, Yue W, et al. Realistic single-image super-resolution using autoencoding adversarial networks[J]. Journal of Electronic Imaging, 2018, 27(6): 063020. （SCI） 4、Xie E, Zang Y, Shao S, et al. Scene Text Detection with Supervised Pyramid Context Network[J]. arXiv preprint arXiv:1811.08605, 2018. （CCF A类会议） 5、Xiao Q, Li G, Xie L, et al. Real-world plant species identification based on deep convolutional neural networks and visual attention[J]. Ecological informatics, 2018, 48: 117-124. （SCI） 6、L. Xie, G. Li, M. Xiao, et al. Hyperspectral Image Classification Using Discrete Space Model and Support Vector Machine [J]. IEEE Geoscience and Remote Sensing Letters, 2017, 14(3): 374-378. （SCI） 7、L. Xie, G. Li, M. Xiao, et al. Band selection algorithm based on information entropy for hyperspectral image classification [J]. Journal of Applied Remote Sensing, 2017, 11(2): 026018. （SCI） 8、Tang K, Xie L, Li G. A multiple classifier system based on Ant-Colony Optimization for Hyperspectral image classification[C]//Journal of Physics: Conference Series. IOP Publishing, 2017, 787(1): 012011. (EI) 9、Jiang M, Li G, Xie L, et al. Adaptive classifier for steel strip surface defects[C]//Journal of Physics: Conference Series. IOP Publishing, 2017, 787(1): 012019. (EI) 10、Pan Yuqing, Li Guangyao, Yang Li. Numerical Simulation of the Effects of Water Surface in Building Environment[C]// IOP Conference Series: Earth and Environmental Science, (EI) 11、Mang Xiao, Guangyao Li, Lei Peng, et al. Completion of images of historical artifacts based on salient shapes[J]. Optik-International Journal for Light and Electron Optics, 2016, 127(1): 396-400. (SCI) 12、Li Xie, Guangyao Li, Mang Xiao, et al. Novel classification method for remote sensing images based on information entropy discretization algorithm and vector space model[J]. Computers & Geosciences, 2016, 89: 252-259. (SCI) 13、Zhou Y, Tan Y, Li G. Improve 3-D Reconstruction from Single and Multiple Images by Image Processing Methods[J]. Journal of Computational and Theoretical Nanoscience, 2016, 13(8): 5231-5241. (SCI) 14、Tan Y, Zhou Y, Li G, et al. Computational aesthetics of photos quality assessment based on improved artificial neural network combined with an autoencoder technique[J]. Neurocomputing, 2016, 188: 50-62. (SCI) 15、Mang Xiao, Guangyao Li, Jiang Y., et al. Image Completion using Belief Propagation Based on Planar Priorities[J]. KSII Transactions on Internet & Information Systems, 2016, 10(9) : 4405-4418. (SCI) 16、Li Yi, Guangyao Li, Mingming Jiang. An End-to-End Steel Strip Surface Defects Recognition System Based on Convolutional Neural Networks[J]. Steel Research International, 2016. (SCI) 17、Jun Xu, Guangyao Li. A two-stage improved ant colony optimization based feature selection for web classification[J]. International Journal of Innovative Computing, Information and Control, 2016, 12(6), 1851-1864. (EI) 18、周毅敏, 李光耀. 多重光照色差下图像平滑美化处理算法[J]. 计算机科学, 2016, 43(10): 287-291. 19、Xiao M, Li G, Xie L, et al. Contour-guided image completion using a sample image[J]. Journal of Electronic Imaging, 2015, 24(2): 023029(1)-023029(11). (SCI) 20、Xiao M, Li G, Tan Y, et al. Image Completion Using Similarity Analysis and Transformation[J]. International Journal of Multimedia and Ubiquitous Engineering, 2015, 10(4): 193-204. (EI) 21、Zhou Y, Li G, Tan Y. Computational Aesthetics of Photos Quality Assessment and Classification Based on Artificial Neural Network with Deep Learning Methods[J]. network, 2015, 8(7): 273-282. (EI) 22、李光耀, 秦洁. 建筑布局对空间舒适性影响的数值模拟[J]. 同济大学学报(自然科学版), 2015, 43(06): 853-858. (EI) 著作 1、《城市发展的数据逻辑》 科学技术出版社 2、《城市仿真技术》 同济大学出版社"
  },
  {
    "title": "刘关俊",
    "relative_url": "../info/1061/2809.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2809.htm",
    "html_content": "姓 名 刘关俊 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机软件与理论 研究方向 Petri网与并发理论、时序逻辑与模型检测、强化学习与无人机协同、机器学习与网络交易欺诈检测、人机物系统、实时嵌入式系统、工作流系统 导师类型 博导／硕导 电子邮件 liuguanjun@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号同济大学电信学院235室 刘关俊，教授，博士生导师。2011年获得同济大学计算机软件与理论专业博士学位，先后于新加坡科技设计大学、德国柏林洪堡大学（德国洪堡基金资助）从事博士后研究工作，2013年进入同济大学计算机科学系（目前为计算机科学与技术学院）工作至今。是中国计算机学会高级会员（形式化方法专委会常委、软件工程专委会执委、理论计算机科学专委执委）、中国自动化学会会员（网络计算专委会委员）、中国人工智能学会会员、上海市人工智能学会会员（可信智能系统专委会副主任委员）、上海市计算机学会会员（理论计算机专委会委员）、上海市信息学会理事、IEEE Senior Member，是 IEEE Transactions on Computational Social Systems副主编（Assciate Editor）、Artificial Intelligence and Autonomous Systems编委（Editorial Board Member）。 已出版学术专著4本，编著教材1本、发表学术论文160余篇，包括SCIENCE CHINA - Information Sciences、IEEE/CAA Journal of Automatica Sinica、ACM T-CPS、ACM T-ECS、IEEE T-SC、IEEE T-II、IEEE T-ASE、IEEE T-ITS、IEEE T-CSS、IEEE T-SMC-S、IEEE T-IV、IEEE T-CE、计算机学报、软件学报、航空学报等国内外期刊论文100余篇、以及International Conference on Theory and Applications of Petri Nets and Concurrency等国际会议论文60余篇。相关研究得到国家自然科学基金（重点项目、面上项目、青年基金项目）、上海市曙光人才项目基金、教育部高校产学研创新基金、中央高校交叉项目基金（重大）、德国洪堡基金、航天五院科研基金、华为胡杨林基金的资助。 获得国家科技进步二等奖（2016）、中国电子学会自然科学一等奖（2016）、自动化学会自然科学一等奖（2019）、吴文俊人工智能技术发明一等奖（2019）、上海市技术发明一等奖（2019）、上海市科技进步一等奖（2015）、教育部国务院学位委员会首届博士研究生学术新人奖（2010）、上海市优秀博士学位论文奖（2014）、上海市计算机学会协同计算与信息服务专委会优秀论文奖（2017）、13th IEEE ICNSC最佳学生论文提名奖（2016）等。 研究兴趣：Petri网与并发理论、时序逻辑与模型检测、强化学习与无人机协同、机器学习与网络交易欺诈检测、人机物系统、实时嵌入式系统等 讲授课程：组合数学（本科生）、离散数学（本科生）、Concrete Mathematics（研究生）。 实验室主页：https://flml.tongji.edu.cn"
  },
  {
    "title": "刘路",
    "relative_url": "../info/1061/3308.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3308.htm",
    "html_content": "."
  },
  {
    "title": "刘钦源",
    "relative_url": "../info/1061/2808.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2808.htm",
    "html_content": "姓 名 刘钦源 职 称 教授 学 科 计算机科学与技术 专 业 计算机应用技术 研究方向 多传感器数据融合、异常检测和故障诊断、大数据分析和机器学习 导师类型 博/硕导 电子邮件 liuqy@tongji.edu.cn 联系电话 通讯地址 上海市嘉定区曹安公路4800号电信大楼（邮政编码：201804） 刘钦源，同济大学电子与信息工程学院教授、博导，计算机科学与技术系副主任。入选国家优青、上海晨光学者。2012年本科毕业于华中科技大学，2017年博士毕业于清华大学，获清华大学优秀博士学位论文一等奖、中国自动化学会优秀博士学位论文奖、清华大学优秀毕业生等荣誉。2014-2016年间多次赴香港科技大学电子及计算机工程学系从事研究工作，2016-2017年赴布鲁奈尔大学计算机科学系任国际研究员，2021-2022年于工业和信息化部产业发展促进中心任国家重点研发计划项目主管。 研究方向包括多传感器数据融合、异常检测和故障诊断、大数据分析和机器学习等。主持/参与国家自然科学基金、国家重点研发计划、科技创新2030“新一代人工智能”重大项目等10余项国家及省部级项目。出版Spinger专著1部，发表论文40余篇，IEEE汇刊及一区论文20余篇，5篇论文入选ESI高被引论文。曾获北京市自然科学二等奖、北京市麒麟科学技术奖、吴文俊人工智能科学技术优秀青年奖、ACM上海新星奖、世界人工智能大会青年优秀论文提名奖等荣誉。担任Control Eng Pract、Int J Syst Sci等5个国际期刊客座编辑/副编辑/编委，10余个国际会议副编辑/程序委员会委员/邀请组主席，20余个国内外期刊及会议的审稿人。担任中国人工智能学会青工委、中国自动化学会故障诊断专委会、中国指挥与控制学会智能控制与系统专委会、中国电子学会区块链分会等多个二级学会委员；国家自然科学基金、国家重点研发计划、上海市科技进步奖与技术发明奖评审专家。 每年招收博士后、博士生及硕士生，欢迎对本课题组感兴趣的同学来信咨询。"
  },
  {
    "title": "刘琴",
    "relative_url": "../info/1061/2739.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2739.htm",
    "html_content": "刘琴 Liu Qin 教授 主讲课程：1) 软件测试 2)软件需求工程 3)AI-Based System 模型评估曾主讲课程:1)C++/Java 面向对象编程语言 2)面向对象建模语言UML 3)高级软件测试分析 4)软件工程 研究方向：交叉学科深度学习网络研究 Deep Learning Network in BioInformatics 异构数据相关性分析 Heterogeneous Data Relevancy Analysis人工智能系统测试方法AI-Based System Testing Methods 职务及研究经历 同济大学软件学院教授、博士生导师，曾任软件学院常务副院长(2008-2017)，教育部软件工程专业教学指导委员会委员，教育部ACM中国专业委员会委员(第一届)，中国计算机学会软件工程委员会委员，英国高等教育协会会员，英国高等院校注册讲师，国际测试认证委员会ISTQB大中华分会联合发起人及大中华区首席代表，ISO29119软件与系统测试国际标准Co-editor。曾在英国Northuambira大学获得博士学位并在国内外企业、高校分别任职。任软件学院常务副院长期间，在周兴铭院士指导下，成功带领全院师生申办了软件工程一级博士授予点和工程博士领域授予点， 并在2017年教育部学科评估中进入前10%。近年来带领课题组在生物信息、测绘等交叉领域开展了结合先验知识的深度神经网络模型、异源异构数据深度学习、自然语言处理、时空数据处理等相关的研究工作，开展了一系列关于疾病药敏分析、地表对象识别等的具体领域融 合探索和研究，并积累了一定的研究成果。曾获上海市教学一等奖（2009），国家级教学二等奖（2009）；获得国家发明专利5项，主持国家及省部级科研项目10余项，发表论文40余篇。与瑞士洛桑理工大学（EPFL）IOT实验室合作基于云平台的物联网数据分析与处理技术研究；曾参加英国首相计划PMI2项目研究；与SAP EBAY等国内外知名IT企业联合研究，于2012年组织引进了美国伯克利大学（Berkeley)与硅谷创业顾问打造的大学生创业课程，全程参与了同济大学和美国斯坦福大学（Stanford）联合进行的Design Innovation创新及创业教程。2018年10 月至 2019 年 8月赴美国埃默里大学 Emory University 生物统计学和生物信息学系做访问学者, 并逐步开展了生命科学和医药学领域的联合研究。 拟招收数据分析与数据挖掘、分布式系统、移动计算方面的本科毕业设计项目和硕士研究生，在分布式环境下对异源异构大数据进行高效精确处理，同时提供机会参与企业以及国际高校的合作研究交流，有意向同学请发送邮件至qin.liu@tongji.edu.cn 拟招收直博、博士和博士后研究生1-2名, 参加学科交叉领域项目:1)生命科学协同药敏分析研究；2）测绘地表识别深度学习网络研究。 博士研究生: 肖葭凯 (直博2017年毕业) 腾讯财付通风险管理部，深度学习自然语言处理研究 游小明 (工程博士2018年毕业) 中国电子科技集团32所, 面向大数据的智能分析平台关键技术研究 宁德军 (工学博士 2019年毕业)中科院上海高等研究院智慧城市研究中心, 基于开源软件社区智慧感知挖掘模型研究 部分论文简介 [1] Zhu Hongming, Wu Guodong, Wang Zeju, Xu Manxin, Liu Qin, Liu Sicong, and Du Bowen*. MTN: A Multi-scale Transformer Network for Different Resolution Remote Sensing Images Change Detection[C]. Accepted by 2023 IEEE International Conference on Systems, Man, and Cybernetics (SMC) [2] Yao Kainan, Wang Xiaowen, Li Wannian, Zhu Hongming, Jiang Yizhi, Li Yulong, Tian Tongxuan, Yang Zhaoyi*, Liu Qi*, and Liu Qin*. Semi-supervised heterogeneous graph contrastive learning for drug-target interaction prediction[J]. Computers in Biology and Medicine, 2023: 107199. [3] Wang Xiaowen, Zhu Hongming, Chen Danyi, Yu Yongsheng, Liu Qi*, and Liu Qin*. A complete graph-based approach with multi-task learning for predicting synergistic drug combinations[J]. Bioinformatics, 2023, 39(6): btad351. [4] Wang Xiaowen, Zhu Hongming, Jiang Yizhi, Li Yulong, Tang Chen, Chen Xiaohan, Li Yunjie, Liu Qi*, and Liu Qin*. PRODeepSyn: predicting anticancer synergistic drug combinations by embedding cell lines with protein–protein interaction network[J]. Briefings in Bioinformatics, 2022, 23(2): bbab587. [5] Qin Liu; Letong Han;Rui Tan;Hongfei Fan;Weiqi Li, Hongming Zhu *, Bowen Du,Sicong Liu; Hybrid Attention Based Residual Network for Pansharpening,Remote Sensing. 2021, 13, 1962.https://doi.org/10.3390/rs13101962 部分科研项目简介 科技部，No. 2021YFF1201200，国家科技部2021重点研发计划生物与信息融合（BT与IT融合）专项，“生物数据深度挖掘与知识融合的智能系统研发与示范应用”项目，“研究生物医学知识图谱融合推理技术体系”课题。2021- 国家科技部，重点研发计划云计算和大数据专项子课题，2016YFB1000805，基于大数据的软件智能开发方法和环境，2016.07-2019.06。 国家自然科学基金，青年科学基金项目资助，61103006，基于熵的成本估算关键数据集合的 发现方法，2012.09-2014.12。 上海市科学技术委员会上海市科委,国际项目, 12510706200，基于云平台的物联网数据分析和处理技术研究，2012.10-2014.09。 国家科技部，“十一五”国家科技支撑计划子课题，2006BAJ11B09，村镇动态监测优化应用平台建设与集成示范-城乡动态监测信息集成的应用服务平台构建”，2008.01-2010.12。 获批专利 刘琴;朱宏明;杨晓雯;周游;张旎，一种图数据存取方法及系统，2018-02-09 ,中国,CN201510028305.8. 张大陆;王佳晟;朱宏明;刘琴，基于RPL的自适应多径路由方法，2016-07-13，中国,CN201310210965.9. 刘琴; 朱宏明; 杨筱雯; 关瑞博; 褚晓圆，基于非正交坐标系下软件成本评估方法，2016-04-20，中国,CN201210378855.9. 史扬，刘琴，穆斌，赵钦佩，韩景轩，前向安全的不可拆分数字签名方法，专利号ZL201410407512.X 史扬，刘琴，穆斌，赵钦佩，韩景轩，基于身份的不可拆分数字签名方法，专利号ZL201410403433.1 翻译教程 · 刘琴等译，《软件测试基础教程》，“国际软件测试认证委员会（ISTQB）指定教材”人民邮电出版社图灵公司2009 · 刘琴等译，《软件测试高级教程1 - 软件测试管理者》，国际软件测试认证委员会（ISTQB）指定教材”，清华大学出版社2012 · 刘琴等译，《软件测试高级教程2 – 高级软件测试分析师》，国际软件测试认证委员会（ISTQB）指定教材”，清华大学出版社2012 学术职位： · 英国高等教育协会会员 · 国际测试认证委员会ISTQB大中华地区首席代表 · TMMi中国分会主席 · 中国计算机学会软件工程专业委员会委员 · 中国软件测试认证委员会专家 · 中国软件行业协会过程改进分会专家 · ISO29119 Part 4，11标准负责人"
  },
  {
    "title": "刘庆文",
    "relative_url": "../info/1061/2807.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2807.htm",
    "html_content": "姓 名 刘庆文 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 无人机/车集群系统、生成式AI大模型（AIGC）、智能物联网、无线定位/通信/传能 导师类型 博导/硕导 电子邮件 qliu@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 刘庆文，教授、博士生导师，国家级海外优青。美国明尼苏达大学硕士/博士，中国科学技术大学学士。在无线网络跨层设计和优化领域发表多篇论文，他引3000余次；一篇第一作者论文他引1000余次，是该领域数万文献中他引最多的IEEE Transactions汇刊长文之一。一篇无线资源调度算法论文曾被列为IEEE Xplore Top 100 Documents Access。获多项世界/美国专利，该核心专利及所属公司被Cisco思科公司成功收购。 近五年获批纵向项目7项，包括主持和参与国家自然科学基金面上项目3项，参与国家重点研发子项目1项，主持教育部科技发展中心高校产学研创新基金1项，主持“2022年度学科交叉联合攻关项目”1项。入选2021年爱思唯尔（Elsevier）中国高被引学者；获得2022年“华为技术领域挑战难题火花奖”。近五年发表通讯/第一作者论文37篇，包括，中科院一区TOP期刊27篇、中科院二区TOP期刊2篇、会议论文8篇（CCF-A类论文2篇）。近五年申请中国发明专利24项，获得授权14项，实审公开10项。 担任IEEE Transactions on Wireless Communications编辑，担任2018 IEEE ICNC, 5G & Beyond Symposium共同主席，以及2018 IEEE WCSP, 5G & Beyond Symposium共同主席，参与会议组织工作；在2018、2020 IEEE Globecom及2023 IEEE WCNC会议中担任TPC委员。多次受邀出席国内外旗舰学术会议并做特邀报告，包括：受邀在2017中国计算机大会（CNCC）、2017 ICCC、2019 IEEE WCNC和2022OWPT会议做特邀报告。 欢迎联系，应聘本课题组在学术研究或工程实践方向的研究员，研究助理，博士后，保送或报考我们的研究生，或参与本科生课题实践。 实验室主页：https://lmqclare.github.io/Winglab/"
  },
  {
    "title": "刘锡伟",
    "relative_url": "../info/1061/2806.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2806.htm",
    "html_content": "姓 名 刘锡伟 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 网络与分布式计算 导师类型 博导/硕导 电子邮件 xwliu@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 刘锡伟，1982年生，2008年博士毕业于复旦大学数学科学学院（硕博连读），获上海市优秀毕业生称号。2010年，从复旦大学物理学博士后流动站出站后进入同济大学电子与信息工程学院计算机科学与技术系任教，历任讲师、副教授。2016.12起，任教授。 一、教学： 1.本科课程：离散数学、服务计算概论、复杂网络导引、数据结构与算法分析。 2.硕士课程：计算机数学基础。 3.教学获奖：获2014年度同济大学隧道奖教金。 二、科研： 1.研究方向：复杂网络的同步与控制、神经网络平衡点稳定性等。 2.主持项目：国家自然科学基金2项（面上和青年各1，青年已结题）、上海市青年科技启明星计划1项、上海市晨光人才计划1项（已结题）、上海市自然科学基金项目1项、中国博士后基金（一等资助）1项（已结题）、同济大学校内项目4项（已结题）。 3.参与项目：科技部973计划、国家自然科学基金重点项目、国家科技支撑计划、上海市学科带头人计划等。 4.学术论文：ResearcherID：K-5366-2013。ORCID：0000-0003-3165-443X。SCI期刊文章24篇（第一作者21篇），其中一/二区期刊文章14篇；EI会议文章14篇（均为第一作者）。ESI高被引论文4篇，SCI总引用次数超过1000次，单篇文章最高被引用超过500次。 5.学术服务：担任JCR一区期刊Neurocomputing的编委。任多个国际/国内会议的TPC。 6.科研获奖：获2015年度教育部自然科学二等奖（排名第2）。 三、人才培养： 指导的硕士生4人获国家奖学金、2人获上海市优秀毕业生、1人获同济大学优秀毕业生、5人获校级奖学金或捐赠奖学金。 欢迎有志于攻读硕士和博士的同学联系（请务必附学习成绩单或相关科研论文）。"
  },
  {
    "title": "苗夺谦",
    "relative_url": "../info/1061/2805.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2805.htm",
    "html_content": "姓 名 苗夺谦 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 认知与智能信息处理 导师类型 博／硕导 电子邮件 dqmiao@tongji.edu.cn 联系电话 上海市曹安公路4800号电信大楼 通讯地址 苗夺谦，国际粗糙集学会会士（IRSS Fellow）、中国人工智能学会会士(CAAI Fellow)。现任同济大学计算机系教授、博士生导师；数据科学与大数据技术专业负责人，计算机系教务委员会主任；电信学院学术委员会副主任，电信学院学位委员会委员；嵌入式系统与服务计算教育部重点实验室副主任。曾任计算机系系主任，电信学院副院长，计算机与信息技术国家级实验教学示范中心主任。 主要研究领域包括：人工智能、机器学习、大数据分析、文本与图像理解、粒度计算等，内容涉及目标检测、自然语言处理、智能视频分析、多粒度建模和不确定性分析等。在国内外重要学术刊物与会议上发表SCI论文180余篇，其中ESI高被引论文4篇。出版教材和学术著作12部，授权专利20余项。主持完成国家自然科学基金项目6项，在研项目有国家重点研发计划课题1项、公安部重大研究计划项目1项、国家自然科学基金项目2项。 荣获重庆市自然科学一等奖（2010）、中国人工智能学会吴文俊人工智能自然科学二等奖（2018）。国家教学成果二等奖（2010）、上海市教学成果一等奖（2009）、同济大学教学成果特等奖（2008、2020）。《人工智能原理与技术》入选国家一流课程（2020）、《人工智能》与《中文信息处理》为上海市精品课程（2017、2013）。教育部-IBM中国优秀教师奖（2010）、宝钢教育优秀教师奖（2011）、同济大学立德树人优秀教师奖（2017）。 目前担任国际粗糙集学会理事长；国家自然科学基金委信息学部评议组专家；中国人工智能学会常务理事/粒计算与知识发现专委会主任；上海市人工智能学会副理事长；上海市计算机学会副理事长；上海市学位委员会计算机学科评议组专家；上海市计算机科学与技术专业教学指导委员会副主任。 目前担任国际SCI期刊《Information Sciences》副编辑（AE）、《International Journal of Approximate Reasoning》副编辑、《CAAI Transactions on Intelligence Technology》副编辑；国内期刊《计算机研究与发展》编委等。 个人网页：https://iip.tongji.edu.cn 实验室：智能信息处理实验室（电信大楼501室） 欢迎有志攻读硕士、博士、博士后的同学联系。"
  },
  {
    "title": "穆斌",
    "relative_url": "../info/1061/2741.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2741.htm",
    "html_content": "穆斌 MU BIN 教授（二级）、博导 办公室：同济大学嘉定校区济事楼312 L室 电子邮件：binmu@tongji.edu.cn 主讲课程： 数据库原理与应用（国家双语教学示范课程、上海市重点课程、上海高校示范性全英语教学课程） 研究方向： 人工智能及其可解释性，机器学习，神经网络，大气及海洋大数据分析，智能数据同化 主持或参与科研项目（课题）情况： 1、国家自然科学基金【原创探索计划】项目“物理-数据双驱动的端到端神经同化方法 NeuralDA 研究”，项目批准号42450163，2025-01至2027-12，主持。 2、国家重点研发计划“全球变化及应对”专项项目“大数据与深度学习方法创新地球系统模式发展及应用研究”之课题二“复杂地球系统过程与现象的时空相关性研究”，课题编号2020YFA0608002，2020-11至2025-04，主持。 3、国家自然科学基金联合基金【重点】项目“基于因果推断和物理引导的面向天气预报与气候预测的深度学习理论算法及可解释性研究”，项目编号：U2142211，2022.01-2025.12，第二负责人。 4、国家自然科学基金【面上】项目“多模态数据驱动的海气耦合台风概率预报模型”，项目编号：42075141，2021.01-2024.12，第二负责人。 5、上海市2020年度“科技创新行动计划”社会发展科技攻关“公共安全/突发公共安全事件应急处理处置”专题项目“基于风云卫星智能精准观测针对极端天气事件的长三角航空运行安全应对研究”之课题二“针对CNOP的高效智能算法开发与应用“，课题编号 20dz1200702， 2020-09-01至2023-08-31，第二负责人。 6、2019年重点领域学科交叉重大“中央高校基本科研业务费专项资金”项目“基于深度神经网络的台风路径强度和降水精准预报研究”，项目编号22120190207，2019-08-01日至2021-07-31，主持。 7、国家重点基础研究发展计划（973计划）课题“信息服务的运行支撑平台及在交通和医疗信息服务中的实证研究”，课题编号 2010CB328106，第二负责人。 8、江苏省信息化建设重点示范工程项目“太仓市智慧城市大数据智能分析系统研发”，第二负责人。 学术论文： 【1】TianXing: A Linear Complexity Transformer Model with Explicit Attention Decay for Global Weather Forecasting ，Yuan, Shijin; Wang, Guansong; Mu, Bin; Zhou, Feifan，Advances in Atmospheric Sciences | 2025年 【2】Incorporating heat budget dynamics in a Transformer-based deep learning model for skillful ENSO prediction，Mu, Bin; 崔悦涵; Yuan, Shijin; Qin, Bo，NPJ CLIMATE AND ATMOSPHERIC SCIENCE | 2024年 | 7卷 | 1期 【3】基于深度学习的全球热带气旋生成预测模型及其可解释性分析，穆斌; 王馨; 袁时金; 陈宇轩; 王冠淞等7名作者，中国科学:地球科学 | 2024年 | 54卷 | 12期 | 3708-3733页 【4】Multivariate Upstream Kuroshio Transport (UKT) Prediction and Targeted Observation Sensitive Area Identification of UKT Seasonal Reduction，穆斌; Yang-Hu, Yifan; Qin, Bo; 袁时金，OCEAN MODELLING | 2024年 | 189卷 【5】A generative adversarial network-based unified model integrating bias correction and downscaling for global SST，袁时金; 冯新; 穆斌; Qin, Bo; Wang, Xin等6名作者，Atmospheric and Oceanic Science Letters | 2024年 | 17卷 | 1期 【6】Toward a Learnable Climate Model in the Artificial Intelligence Era，Huang, Gang; Wang, Ya; Ham, Yoo-Geun; 穆斌; Tao, Weichen等6名作者，Advances in Atmospheric Sciences | 2024年 | 41卷 | 7期 | 1281-1288页 【7】A deep learning-based bias correction model for Arctic sea ice concentration towards MITgcm，袁时金; 朱师辰; Luo, Xiaodan; 穆斌，Ocean Modelling | 2024年 | 188卷 【8】Developing intelligent Earth System Models: An AI framework for replacing sub-modules based on incremental learning and its application，穆斌; 赵紫君; 袁时金; Qin, Bo; Dai, Guo-Kun等6名作者，Atmospheric Research | 2024年 | 302卷 【9】An extension to ensemble forecast of conditional nonlinear optimal perturbation considering nonlinear interaction between initial and model parametric uncertainties ，Mu, Bin; Zhao, Zi-Jun; Yuan, Shi-Jin; Chen, Xing-Rong; Qin, Bo等6名作者，Atmospheric Research | 2024年 | 311卷 【10】A deep learning-based global tropical cyclogenesis prediction model and its interpretability analysis，Mu, Bin; Wang, Xin; Yuan, Shijin; Chen, Yuxuan; 王冠淞等7名作者，Science China Earth Sciences | 2024年 【11】IceTFT v1.0.0: interpretable long-term prediction of Arctic sea ice extent with deep learning，穆斌; 罗晓丹; 袁时金; Liang, Xi，GEOSCIENTIFIC MODEL DEVELOPMENT | 2023年 | 16卷 | 16期 | 4677-4697页 【12】A paralleled embedding high-dimensional Bayesian optimization with additive Gaussian kernels for solving CNOP，袁时金; 刘娅璇; Qin, Bo; 穆斌; Zhang, Kun，Ocean Modelling | 2023年 | 184卷 【13】A radiative transfer deep learning model coupled into WRF with a generic fortran torch adaptor，穆斌; 陈璐; 袁时金; Qin, Bo，FRONTIERS IN EARTH SCIENCE | 2023年 | 11卷 【14】Dimension shifting based intelligent algorithm framework to solve conditional nonlinear optimal perturbation，袁时金; 刘娅璇; Zhang, Huazhen; 穆斌，Computers and Geosciences | 2023年 | 176卷 【15】NAO Seasonal Forecast Using a Multivariate Air–Sea Coupled Deep Learning Model Combined with Causal Discovery，穆斌; 姜欣; 袁时金; 崔悦涵; Qin, Bo，Atmosphere | 2023年 | 14卷 | 5期 【16】Error Evolutions and Analyses on Joint Effects of SST and SL via Intermediate Coupled Models and Conditional Nonlinear Optimal Perturbation Method，穆斌; 秦小云; 袁时金; Qin, Bo，JOURNAL OF MARINE SCIENCE AND ENGINEERING | 2023年 | 11卷 | 5期 【17】Estimating the tropical cyclone wind structure using physics-incorporated networks，袁时金; 尤钱湖; 穆斌; 秦博; Xu Jing，FRONTIERS IN EARTH SCIENCE | 2023年 | 10卷 【18】PIRT: A Physics-Informed Red Tide Deep Learning Forecast Model Considering Causal-Inferred Predictors Selection，穆斌; 秦博; 袁时金; Wang, Xin; Chen, Yuxuan，IEEE Geoscience and Remote Sensing Letters | 2023年 | 20卷 【19】CAU: A Causality Attention Unit for Spatial-temporal Sequence Forecast，Qin, Bo; Meng, Fanqing; Fang, Xianghui; Dai, Guokun; 袁时金等6名作者，IEEE Transactions on Multimedia | 2023年 | 1-15页 【20】ENSO-GTC: ENSO Deep Learning Forecast Model With a Global Spatial-Temporal Teleconnection Coupler，穆斌; 秦博; 袁时金，Journal of Advances in Modeling Earth Systems | 2022年 | 14卷 | 12期 【21】Feature extraction-based intelligent algorithm framework with neural network for solving conditional nonlinear optimal perturbation，袁时金; 张华桢; 刘娅璇; 穆斌，Soft Computing | 2022年 | 26卷 | 14期 | 6907-6924页 【22】A deep learning urban traffic congestion forecast model blending the temporal continuity and periodicity，穆斌; Huang, Yuxi，ACM International Conference Proceeding Series | 2022年 | 602-607页 【23】Ensemble Forecast for Tropical Cyclone Based on CNOP-P Method: A Case Study of WRF Model and Two Typhoons，袁时金; Shi Bo; 赵紫君; 穆斌; Zhou Fei-fan等6名作者，JOURNAL OF TROPICAL METEOROLOGY | 2022年 | 28卷 | 2期 | 121-138页 【24】Simulation, precursor analysis and targeted observation sensitive area identification for two types of ENSO using ENSO-MC v1.0 ，穆斌; 崔悦涵; 袁时金; 秦博，GEOSCIENTIFIC MODEL DEVELOPMENT | 2022年 | 15卷 | 10期 | 4105-4127页 【25】Optimal Precursors Identification for North Atlantic Oscillation Using the Parallel Intelligence Algorithm，穆斌; 李婧; 袁时金; 罗晓丹; Dai, Guokun，Scientific Programming | 2022年 | 2022卷 【26】The NAO Variability Prediction and Forecasting with Multiple Time Scales Driven by ENSO Using Machine Learning Approaches，穆斌; 李婧; 袁时金; Luo, Xiaodan，Computational Intelligence and Neuroscience | 2022年 | 2022卷 【27】GCN Model combined with Bi-GRU for traffic prediction，穆斌; Zhen, Lin，Proceedings of SPIE - The International Society for Optical Engineering | 2022年 | 12259 【28】ENSO-ASC 1.0.0: ENSO deep learning forecast model with a multivariate air-sea coupler，穆斌; 秦博; 袁时金，GEOSCIENTIFIC MODEL DEVELOPMENT | 2021年 | 14卷 | 11期 | 6977-6999页 【29】The ELM Model with Residual Compensation Based on ARIMA for North Atlantic Oscillation Index Prediction，Luo, Xiaodan; 袁时金; 穆斌; Li, Jing，ACM International Conference Proceeding Series | 2021年 | 122-126页 【30】An improved continuous tabu search algorithm with adaptive neighborhood radius and increasing search iteration times strategies，袁时金; 徐运佳; 穆斌; Zhang, Linlin; Ren, Juhui等7名作者，International Journal on Artificial Intelligence Tools | 2021年 | 30卷 | 2期 【31】Typhoon Intensity Forecasting Based on LSTM Using the Rolling Forecast Method，袁时金; Wang, Cheng; 穆斌; Zhou, Feifan; Duan, Wansuo，ALGORITHMS | 2021年 | 14卷 | 3期 【32】Efficient executions of community earth system model onto accelerators using GPUs，袁时金; Wang, Cheng; 穆斌; 罗晓丹，ACM International Conference Proceeding Series | 2020年 | 192-199页 【33】CNOP-P-Based Parameter Sensitivity Analysis for North Atlantic Oscillation in Community Earth System Model Using Intelligence Algorithms，穆斌; 李婧; 袁时金; 罗晓丹; Dai, Guokun，ADVANCES IN METEOROLOGY | 2020年 | 2020卷 【34】Applying Convolutional LSTM Network to Predict El Niño Events: Transfer Learning from the Data of Dynamical Model and Observation，穆斌; Ma, Shaoyang; 袁时金; Xu, Hui，ICEIEC 2020 - Proceedings of 2020 IEEE 10th International Conference on Electronics Information and Emergency Communication，2020年 | 215-219页 【35】Data Assimilation by Artificial Neural Network using Conventional Observation for WRF Model，袁时金; Shi, Bo; 穆斌，ACM International Conference Proceeding Series | 2020年 | 62-67页 【36】Multi-scale downscaling with bayesian convolution network for ENSO SST pattern，穆斌; 秦博; 袁时金，Proceedings - 2020 5th International Conference on Electromechanical Control Technology and Transportation, ICECTT 2020 | 2020年 | 359-362页 【37】A Climate Downscaling Deep Learning Model considering the Multiscale Spatial Correlations and Chaos of Meteorological Events，穆斌; 秦博; 袁时金; 秦小云，Mathematical Problems in Engineering | 2020年 | 2020卷 【38】Prediction of north atlantic oscillation index associated with the sea level pressure using DWT-LSTM and DWT-ConvLSTM networks，穆斌; 李婧; 袁时金; 罗晓丹，Mathematical Problems in Engineering | 2020年 | 2020卷 【39】Applying Convolutional LSTM Network to Predict El Nino Events: Transfer Learning from The Data of Dynamical Model and Observation，穆斌; 马少阳; 袁时金; Xu, Hui，PROCEEDINGS OF 2020 IEEE 10TH INTERNATIONAL CONFERENCE ON ELECTRONICS INFORMATION AND EMERGENCY COMMUNICATION (ICEIEC 2020) | 2020年 | 215-219页 【40】NAO Index Prediction using LSTM and ConvLSTM Networks Coupled with Discrete Wavelet Transform，穆斌; 李婧; 袁时金; 罗晓丹; Dai, Guokun，Proceedings of the International Joint Conference on Neural Networks | 2019年 | 2019-July卷，匈牙利布达佩斯 【41】ENSO Forecasting over Multiple Time Horizons Using ConvLSTM Network and Rolling Mechanism，穆斌; Peng, Cheng; 袁时金; Chen, Lei，Proceedings of the International Joint Conference on Neural Networks | 2019年 | 2019-July卷，匈牙利布达佩斯 【42】Identifying Typhoon Targeted Observations Sensitive Areas Using the Gradient Definition Based Method，穆斌; Ren, Juhui; 袁时金; Zhou, Feifan，ASIA-PACIFIC JOURNAL OF ATMOSPHERIC SCIENCES | 2019年 | 55卷 | 2期 | 195-207页 【43】Prediction of north atlantic oscillation index with convolutional LSTM based on ensemble empirical mode decomposition，袁时金; 罗晓丹; 穆斌; Li, Jing; Dai, Guokun，Atmosphere | 2019年 | 10卷 | 5期 【44】INTELLIGENT ALGORITHMS FOR SOLVING CNOP AND THEIR APPLICATIONS IN ENSO PREDICTABILITY AND TROPICAL CYCLONE ADAPTIVE OBSERVATIONS，穆斌; Zhang Lin-lin; 袁时金; 钱一闻; 温仕成等7名作者，JOURNAL OF TROPICAL METEOROLOGY | 2019年 | 25卷 | 1期 | 63-81页 【45】The Optimal Precursors for ENSO Events Depicted Using the Gradientdefinition-based Method in an Intermediate Coupled Model ，穆斌; Ren, Juhui; 袁时金; Zhang, Rong-Hua; Chen, Lei等6名作者，Advances in Atmospheric Sciences | 2019年 | 36卷 | 12期 | 1381-1392页 【46】Optimal precursors of double-gyre regime transitions with an adjoint-free method，袁时金; 李糜; Wang, Qiang; Zhang, Kun; 张华桢等6名作者，Journal of Oceanology and Limnology | 2019年 | 37卷 | 4期 | 1137-1153页 【47】CNOP-P-based parameter sensitivity for double-gyre variation in ROMS with simulated annealing algorithm，袁时金; 张华桢; 李糜; 穆斌，Journal of Oceanology and Limnology | 2019年 | 37卷 | 3期 | 957-967页 【48】A modified direct search algorithm based on kernel density estimator with three mapping strategies for solving nonlinear optimization，Zhang, Lin-Lin; 穆斌; 袁时金，Journal of Computers (Taiwan) | 2019年 | 30卷 | 4期 | 17-30页 【49】Parallel PCA-Based Bacterial Foraging Optimization Algorithm for Identifying Optimal Precursors of North Atlantic Oscillation，穆斌; Jing Li; 袁时金; 罗晓丹; Guokun Dai，2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS). Proceedings | 2019年 | 1171-7页 【50】A novel approach for solving CNOPs and its application in identifying sensitive regions of tropical cyclone adaptive observations，Zhang, Linlin; 穆斌; 袁时金; Zhou, Feifan，NONLINEAR PROCESSES IN GEOPHYSICS | 2018年 | 25卷 | 3期 | 693-712页 【51】Parallel dynamic search fireworks algorithm with linearly decreased dimension number strategy for solving conditional nonlinear optimal perturbation，穆斌; 赵珺晖; 袁时金; 颜景豪，Proceedings of the International Joint Conference on Neural Networks | 2017年 | 2017-May卷 | 2314-2321页，美国阿拉斯加 【52】CNOP-Based Sensitive Areas Identification for Tropical Cyclone Adaptive Observations with PCAGA Method ，Zhang, Lin-Lin; 袁时金; 穆斌; Zhou, Fei-Fan，ASIA-PACIFIC JOURNAL OF ATMOSPHERIC SCIENCES | 2017年 | 53卷 | 1期 | 63-73页 【53】An efficient approach based on the gradient definition for solving conditional nonlinear optimal perturbation ，穆斌; Ren, Juhui; 袁时金，Mathematical Problems in Engineering | 2017年 | 2017卷 【54】CACO-LD: Parallel Continuous Ant Colony Optimization with Linear Decrease Strategy for Solving CNOP，袁时金; 陈韵怡; 穆斌，Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) | 2017年 | 10637 LNCS卷 | 494-503页 【55】Parallel Modified Artificial Bee Colony Algorithm for Solving Conditional Nonlinear Optimal Perturbation，Ren, Juhui; 袁时金; 穆斌，Proceedings - 18th IEEE International Conference on High Performance Computing and Communications, 14th IEEE International Conference on Smart City and 2nd IEEE International Conference on Data Science and Systems, HPCC/SmartCity/DSS 2016 | 2016年 | 333-340页，澳大利亚悉尼 【56】PCAFP for Solving CNOP in Double-Gyre Variation and Its Parallelization on Clusters，袁时金; 李糜; 穆斌; Wang, Jingpeng，Proceedings - 18th IEEE International Conference on High Performance Computing and Communications, 14th IEEE International Conference on Smart City and 2nd IEEE International Conference on Data Science and Systems, HPCC/SmartCity/DSS 2016 | 2016年 | 284-291页，澳大利亚悉尼 【57】PCGD: Principal components-based great deluge method for solving CNOP，温仕成; 袁时金; 穆斌; Li, Hongyu; Ren, Juhui，2015 IEEE CONGRESS ON EVOLUTIONARY COMPUTATION (CEC) | 2015年 | 1513-1520页 【58】PCAGA: Principal Component Analysis Based Genetic Algorithm for Solving Conditional Nonlinear Optimal Perturbation，穆斌; Zhang, Linlin; 袁时金; Li, Hongyu，2015 INTERNATIONAL JOINT CONFERENCE ON NEURAL NETWORKS (IJCNN) | 2015年 【59】Parallel dynamic step size sphere-gap transferring algorithm for solving conditional nonlinear optimal perturbation，袁时金; 颜景豪; 穆斌; Li, Hongyu，Proceedings - 2015 IEEE 17th International Conference on High Performance Computing and Communications, 2015 IEEE 7th International Symposium on Cyberspace Safety and Security and 2015 IEEE 12th International Conference on Embedded Software and Systems, HPCC-CSS-ICESS 2015 | 2015年 | 559-565页 【60】PPSO: PCA based particle swarm optimization for solving conditional nonlinear optimal perturbation，穆斌; 温仕成; 袁时金; Li, Hongyu，Computers and Geosciences | 2015年 | 83卷 | 65-71页 【61】A Parallel Sensitive Area Selection-Based Particle Swarm Optimization Algorithm for Fast Solving CNOP，Yuan Shijin, Ji Feng, Yan Jinghao, Mu Bin，22nd International Conference on Neural Information Processing (ICONIP)，土耳其伊斯坦布尔 【62】Parallel Cooperative Co-evolution Based Particle Swarm Optimization Algorithm for Solving Conditional Nonlinear Optimal Perturbation，Yuan Shijin, Zhao Li, Mu Bin，22nd International Conference on Neural Information Processing (ICONIP)，土耳其伊斯坦布尔 【63】Parallel dynamic step size sphere-gap transferring algorithm for solving conditional nonlinear optimal perturbation，Yuan Shijin, Yan Jinghao, Mu Bin, Li Hongyu，17th IEEE International Conference on High Performance Computing and Communications, IEEE 7th International Symposium on Cyberspace Safety and Security and IEEE 12th International Conference on Embedded Software and Systems, 美国纽约 【64】PCAGA: Principal Component Analysis Based Genetic Algorithm for Solving Conditional Nonlinear Optimal Perturbation，Bin Mu，Linlin Zhang，Shijin Yuan，Hongyu Li，2015 International Joint Conference on Neural Networks (IJCNN)，爱尔兰基拉尼 【65】User-QoS-based Web Service Clustering for QoS Prediction，Fuxin Chen, Shijin Yuan, Bin Mu，the 22nd IEEE International Conference on Web Services， CCF-B，美国纽约 【66】PCGD: Principal components-based great deluge method for solving CNOP，Wen, Shicheng，Yuan, Shijin，Mu, Bin，Li, Hongyu，Ren, Juhui，IEEE Congress on Evolutionary Computation, CEC 2015，日本仙台 其他 加拿大纽布伦瑞克大学高级访问学者"
  },
  {
    "title": "饶卫雄",
    "relative_url": "../info/1061/2735.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2735.htm",
    "html_content": "饶卫雄 rao weixiong 教授、博士http://sse.tongji.edu.cn/wrao wxrao (at) tongji.edu.cn 主讲课程：数据挖掘机器学习分布式系统 研究方向：机器学习及深度强化学习应用时空数据科学移动计算/边缘计算 目前本研究组在移动计算、数据科学等方向拟招收博士/硕士研究生。拟根据同学的个人兴趣，与海外的多个研究机构和工业界广泛合作为同学提供良好的研究和工程实践机会。如有兴趣，请发送邮件至邮箱（wxrao (at) tongji.edu.cn）。 最近更新 [NEW] (2020/07) Three Paper got accepted: \"Context-aware Telco Outdoor Localization\" accepted by IEEE Trans. on Mobile Computing (TMC), \"SST: Synchronized Spatial-Temporal Trajectory Similarity Search\" accepted by Springer GeoInformatic, and \"IFLoc: Indoor Height Estimation by Telco Data\" by IEEE MDM 2020 . (2020/01) Three Paper got accepted: \"Transfer Learning-Based Outdoor Position Recovery with Cellular Data\" accepted by IEEE Trans. on Mobile Computing (TMC), \"A Data-driven Sequential Localization Framework for Big Telco Data\" accepted by IEEE Trans. on Knowledge and Data Engineering (TKDE), and \"Accurate Demand Forecasting for Retails with Deep Neural Networks\" by EDBT 2020 (short paper). (2019/11) Our Paper \"DeepLoc: Deep Neural Network-based Telco Outdoor Location Recovery\" by Yige Zhang, Yu Xiao, Kai Zhao and Weixiong Rao won the Best Paper Award at MobiQuitous 2019 (see the photo). Two papers got accepted by ACM CIKM 2019: 1) \"PRNet: Outdoor Position Recovery for Heterogenous Telco Data by Deep Neural Network\" and 2) \"Experimental Study of Multivariate Time Series Forecasting\". Congs to Yige and Jiaming. We are orgnazing the 5th Joint Finland-China-Germany Workshop on Mobile Networking, Analytics and Edge Computing. Welcome to attend the worshop (2018-09-04). One poster paper and one demo paper are accepted by Sensys 2018: Deep Neural Network-based Telco Outdoor Localization (Poster) by Yige Zhang, Weixiong Rao, Yu Xiao, and Frequent Pattern-based Trajectory Completion (Demo) by Zhiqiang. Zhang, Weixiong Rao, Fehmi Ben Abdesslem (2018-09-04) Dr Kun Zhang from CMU visted us and gave the talk \"Causal Modeling and Machine Learning\" (2018-7-13) Dr Yu Xiao from Aalto U. visited us and give the talk \"Visual Crowdsourcing for Smart Mobility\" (2018-6-21) One paper is accepted by ALGOSENSORS 2018: Localization of MR Records with Missing RSSI Information by Jinhua Lv, Qinpei Zhao, Weixiong Rao, Yige Zhang, Mingxuan Yuan, Jia Zeng (2018-07) 赵鹏访问纽约城市大学、美国纽约大学城市科学和发展中心的Dr. Huy T. Vo (2017年11-12月). 张奕格访问德国慕尼黑工业大学Prof. Dr.-Ing. Jörg Ott和Dr. Aaron Yi DING (2017年10月). 2017/09: 参加德国慕尼黑工业大学\"Mobile Networking, Analytics and Edge Computing\"FGC 2017 研讨会，报告题目：When Outdoor Localization meets Telco Big Data Our paper \"Topic Model-Based Road Network Inference from Massive Trajectories\" won IEEE MDM 2017 Best Paper Award (see the photo) 个人简介 自2014年中期加入同济大学软件学院, 曾在英国剑桥大学计算机实验室(2013), 芬兰赫尔辛基大学 计算科学系(2011-2012)和香港科技大学计算机科学与工程系(2010) 分别从事副研究员和博士后研究。在2005-2009年期间在香港中文大学计算机科学与工程系学习，获博士学位。此前分别在北方交通大学和上海交通大学获得本科和硕士学位。 研究方向及项目 1、分布式计算： 面向高维稀疏语义空间的云端高通量匹配机理的研究 [国家自然科学基金面上项目 2016-2019] 面向集群云平台的并行内容发布和订阅技术研究 [上海自然科学基金项目 2015-2017] 2、时空数据科学： 面向异构稀缺标注样本的全城用户数字足迹恢复关键技术研究 [国家自然科学基金面上项目 2020-2023] 立体定位技术研究 [企业合作项目 2019-2020] 室内外混合定位技术及应用研究 [中央高校基金项目 2017-2019] 电信时空洞察引擎技术合作项目 [企业合作项目 2016-2017] 深度推荐引擎研究 [企业合作项目 2017-] 指导学生 博士生：2019：尹嘉铭[合作]、沈佳静；2020：杨思绮；2021：周添龙 毕业生：2016级（答辩时间：2021年中）：赵鹏-->美团金融；张奕格-->华为上海。 硕士生： 2021级：高宏业；时奕晨 2020级：杨广大 2019级：胡嘉鑫[合作]、余秉权、竺金浩 毕业生：2018级：吕金华-->蚂蚁金服-->货拉拉、张志强-->北大读博；2017级（廖山河-->京东北京、邸晓蕾-->上海证券交易所信息公司、张颖-->国泰君安)；2016级 (陈柏君-->SAP、冯涛-->京东)；2015级 (黄雨琨-->百度、钟韵松-->上海航天技术研究院、李国华、袁鹏程-->国泰君安、刘思琦-->中国证券登记结算) 本科毕设： 2015届：赵俊尧、陆艺青、梁圃核；2016届：胡圣托、姜木慧、黄徐欢、赵鹏、张奕格；2017届：代东洋、廖山河、吴雨霏、刘旭东"
  },
  {
    "title": "申恒涛",
    "relative_url": "../info/1061/3337.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3337.htm",
    "html_content": "申恒涛教授，欧洲科学院院士、国际计算机学会会士（ACM Fellow）、国际电气与电子工程师协会会士（IEEE Fellow）、美国光学学会会士（OSA Fellow）、科睿唯安全球高被引科学家，是同济大学计算机科学与技术学院院长。他分别于2000年和2004年获得了新加坡国立大学计算机科学系一等荣誉学士和博士学位。随后加入昆士兰大学并于2011年底成为教授。他一直从事最前沿的计算机科学研究，研究方向包括多媒体搜索，计算机视觉，人工智能，和大数据管理。 申恒涛教授持续20多年在多媒体大数据的分析、理解、索引和搜索等方面深入研究，在国际上率先实现了实时的近重复视频内容搜索系统。累计发表了500多篇高水平同行评审论文，包括200多篇 IEEE/ACM Transactions和300多篇CCF A类论文,并获得了10个国际会议和期刊的最佳论文奖，包括A类会议ACM Multimedia 2017最佳论文奖和ACM SIGIR 2017最佳论文-Honourable Mention奖，以及IEEE Transactions on Multimedia 2020最佳论文奖。他获得2010年澳洲计算研究与教育学会授予的Chris Wallace Award，2012年澳大利亚研究理事会Future Fellowship，中华全国总工会颁发的2016年第六届“中国侨界贡献奖”，2020年四川杰出人才奖，2021年四川省高等教育教学成果奖一等奖，2022年CCF-ACM人工智能奖，以及2022年科学探索奖。曾管理了15个国家级科学研究项目，包括国家科技部科技创新2030—“新一代人工智能”重大项目，国家自然科学基金会重点项目，国家自然科学基金会国际合作重点项目等。 申恒涛教授目前/曾经担任ACM Transactions of Data Science, IEEE Transactions on Image Processing, IEEE Transactions on Multimedia, and IEEE Transactions on Knowledge and Data Engineering编委。申恒涛教授作为大会联合主席在成都成功举办了多媒体领域唯一的CCF A类学术会议ACM Multimedia 2021，也曾在澳大利亚分别作为Local Organization Co-Chair和TPC Co-Chair成功举办过数据库领域CCF A类学术会议ICDE 2013和多媒体领域CCF A类学术会议ACM Multimedia 2015。"
  },
  {
    "title": "沈莹",
    "relative_url": "../info/1061/3607.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3607.htm",
    "html_content": "沈莹 SHEN YING 副教授、博士https://csyingshen.github.io/main/yingshen@tongji.edu.cn 主讲课程：用户交互技术软件体系结构模式识别 研究方向：语音信号处理自然语言处理生物信息学 教学工作 主讲课程： 用户交互技术 模式识别 软件体系结构 科研项目 国家自然科学基金面上项目：“基于图卷积网络的RNA二级/三级结构预测”，2020-2023，主持 上海市自然科学基金面上项目：“环视泊车位检测系统中关键技术的研究”，2019～2021，主持 国家自然科学基金青年科学基金项目: “RNA结构功能域识别和提取”，2014.01～2016.12，主持 部分论文简介 期刊论文 Huizhu Ren and Ying Shen*, \"RNA-binding residues prediction using structural features\", BMC Bioinformatics, vol. 16, pp. 249, 2015. Ying Shen and Lin Zhang, \"Gene function prediction with knowledge from Gene Ontology\", Int. J. Data Mining and Bioinformatics, vol. 13, no. 1, pp. 50-62, 2015. Ying Shen, Hau-San Wong, Shaohong Zhang, and Lin Zhang, \"RNA structural motif recognition based on least-squares distance\", RNA, vol. 19, no. 10, pp. 1183-1191, 2013. Ying Shen, Shaohong Zhang, Hau-San Wong, and Lin Zhang, “Characterization of semantic similarity on Gene Ontology based on a shortest path approach”, Int. J. Data Mining and Bioinformatics, vol. 10, no.1, pp. 33-48, 2014. Lin Zhang, Zhixuan Ding, Hongyu Li, Ying Shen*, Jianwei Lu, \"3D Face Recognition Based on Multiple Keypoint Descriptors and Sparse Representation\", PLoS ONE, vol. 9, no. 6, e100120:1-9, 2014. Lin Zhang, Zhixuan Ding, Hongyu Li, Ying Shen*, \"3D Ear Identification Based on Sparse Representation\", PLoS ONE, vol. 9, no. 4, e95506:1-9, 2014. Ying Shen, Hau-San Wong, Shaohong Zhang, and Zhiwen Yu, “Feature-based 3D motif filtering for ribosomal RNA”, Bioinformatics, vol. 27, no. 20, pp. 2828-2835, 2011. 会议论文 Yin Shen and Lin Zhang, \"The hasp motif: A new type of RNA tertiary interactions\", in Proc. ICIC2017. Huizhu Ren, Ying Shen*, and Lin Zhang, \"The λ-turn: A new structural motif in ribosomal RNA\", in Proc. ICIC2015. Ying Shen and Lin Zhang, \"Improving classification accuracy using Gene Ontology information\", in: Proc. ICIC2013. Ying Shen, Shaohong Zhang, and Hau-San Wong, \"A new method for measuring the semantic similarity on Gene Ontology\", in: Proc. BIBM, pp. 533-538, 2010. 专利 获奖经历"
  },
  {
    "title": "史清江",
    "relative_url": "../info/1061/2734.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2734.htm",
    "html_content": "Prof. Qingjiang Shi (史清江) Office：442L@Jishi Building Email：shiqj AT tongji DOT edu DOT cn, Wechat: SJTUMN Google Scholar: https://scholar.google.com/citations?user=8xoKeR0AAAAJ&hl=zh-CN 欢迎懂感恩、不矫情、有追求、心态乐观、好奇心极强、数理基础良好的同学报考硕/博士研究生，也欢迎学有余力且能够坚持的本科生加入网络与机器智能实验室从事人工智能/优化算法与应用方面的研究，将为大家推荐名校深造和名企实习的机会。实验室目前的项目主要包括国家重点研发计划、国家自然科学基金与企业院所委托的工程项目。注：网络通信方向招生原则上要求学生是电子/通信/物联网专业毕业。 Recent research directions/近期研究方向: 1. Intelligent communications and networking 2. Machine learning for big data analytics 3. Optimization methods and distributed computing Brief intro/简介: Dr. Qingjiang Shi received his Ph.D. degree in electronic engineering from Shanghai Jiao Tong University, Shanghai, China, in 2011. From September 2009 to September 2010, he visited Prof. Z.-Q. (Tom) Luo's research group at the University of Minnesota, Twin Cities. In 2011, he worked as a Research Scientist at Bell Labs China. From 2012, He was with the School of Information and Science Technology at Zhejiang Sci-Tech University. From Feb. 2016 to Mar. 2017, he worked as a research fellow at Iowa State University, USA. From 2018, He is currently a professor with the School of Software Engineering at Tongji University. His interests lie in algorithm design and analysis with applications in machine learning, signal processing and wireless networks. So far he has published more than 80 IEEE journals and filed more than 40 national patents. Dr. Shi was an Associate Editor for the IEEE TRANSACTIONS ON SIGNAL PROCESSING. He was the recipient of IEEE Signal Processing Society Best Paper Award in 2022, the Huawei Technical Cooperation Achievement Transformation Award (2nd Prize) in 2022, the Huawei Outstanding Technical Achievement Award in 2021, the Golden Medal at the 46th International Exhibition of Inventions of Geneva in 2018, the First Prize of Science and Technology Award from China Institute of Communications in 2017, National Excellent Doctoral Dissertation Nomination Award in 2013, Shanghai Excellent Doctorial Dissertation Award in 2012, and the Best Paper Award from the IEEE PIMRC’09 conference. Recent works/近期代表性工作: [1] X. Zhao, S. Lu, Q. Shi* and Z. -Q. Luo, \"Rethinking WMMSE: Can Its Complexity Scale Linearly With the Number of BS Antennas?,\" IEEE Transactions on Signal Processing, vol. 71, pp. 433-446, 2023, doi: 10.1109/TSP.2023.3244104. [2] Y. Dong, X. Jiang, H. Zhou, Y. Lin, Q. Shi*, \"SR2CNN: Zero-Shot Learning for Signal Recognition\", IEEE Transactions on Signal Processing, 2021, vol. 69, pp. 2316-2329, 2021. [3] Q. Shi and M. Hong, \"Penalty Dual Decomposition Method For Nonsmooth Nonconvex Optimization—Part I&II: Algorithms and Applications,\" IEEE Transactions on Signal Processing, 2020. doi: 10.1109/TSP.2020.3001906. [4] L. Xie, J. Liu, S. Lu, T.-H. Chang, and Q. Shi*, \"An Efficient Learning Framework For Federated XGBoost Using Secret Sharing And Distributed Optimization\"，ACM Transactions on Intelligent Systems and Technology, vol. 13, no. 5, pp.1-28, 2022. [5] H. Sun, X. Chen, Q. Shi, M. Hong, X. Fu, N. Sidiropoulos, \"Learning To Optimize: Training Deep Neural Networks For Interference Management,\" IEEE Transactions on Signal Processing, vol. 66, no. 20, pp. 5438-5453, 2018 荣誉与获奖： 1) 2022 IEEE信号处理协会最佳论文奖 2）2020-2023爱思唯尔中国高被引学者 3）2022年华为技术合作成果转化二等奖 4）2020年华为优秀技术成果奖 5）2017年任国际信号处理顶级期刊IEEE Trans. Signal Process.编委 6）2018年获日内瓦国际发明展发明金奖 7）2018年获中国通信学会自然科学一等奖 8）2014年获得全国百篇优秀博士学位论文提名奖 9）2013年获得上海市研究生优秀成果（博士学位论文）奖 10）2009年获得国际个人移动通信领域IEEE PIMRC会议最佳论文奖， 11）2019年获得全国Intel杯人工智能软件创新大赛一等奖（优秀指导教师） 12）2019年获第五届中国“互联网+”大学生创新创业大赛上海赛区一等奖（优秀指导教师） 近期主持的部分项目: 【1】国家重点研发计划项目，学习优化理论与方法及其在5G中的应用，2022YFA1003900，2023.1-2027.12，在研，主持 【2】国家自然科学基金重点项目，大规模通信信号处理的分布式机器学习方法，62231019， 2023.1-2027.12，在研，主持 【3】国家重点研发计划（政府间国际合作重点专项）项目，基于物联网和大数据的智能建筑管理关键技术研究，2017YFE0119300，2019.1-2021.12，结题，主持 【4】华为技术有限公司合作项目，基于L2O的调度，2022.10-2023.10，在研，主持 【5】中电科某所委托项目，低零感知与计算技术，2023.9-2024.9，在研，主持 毕业学生去向: 刘嘉琦（23届硕士，百度） 周福佳（23届硕士，字节） 陆鹏威（22届硕士，阿里） 董益宏（22届硕士，北大计算机攻博） 颜子彦（21届硕士，腾讯） 陆思远（co-supervised 21届硕士，华为） 余 豪（co-supervised 21届硕士，获国奖，字节）"
  },
  {
    "title": "史扬",
    "relative_url": "../info/1061/2733.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2733.htm",
    "html_content": "史扬 教授 博导电子邮件：sseyangshi AT 126 DOT com 主讲课程：密码学与区块链（研）信息安全基础（本/研）软件项目管理（本/研）离散数学C语言程序设计 研究方向：信息安全与密码学包括应用密码学、区块链与数字货币、网络安全、数据安全与隐私计算、软件安全 欢迎计算机、软件工程、数学、通信电子等专业背景的同学报考硕士/博士研究生。根据同学的发展规划和个人兴趣，可以参加国家自然科学基金等国家级课题研究，与国内外著名IT企业的校企合作项目，以及与海外的高等院校的联合研究等，获得科研能力、实际项目经验及国际交流访学的经验等方面的提升。如有兴趣，请邮件联系（sseyangshi AT 126 DOT com）。 工作经验 2011.11至今 同济大学软件学院 现任 教授 博导 2007.10至2010.09 同济大学管理科学与工程博士后流动站 博士后 2005.10至2011.11 上海浦东中软科技发展有限公司 高级工程师，副总经理 主持在研项目 国家自然科学基金项目：面向区块链的密码算法私钥抗白盒攻击方法与关键技术（项目编号62172301，负责人） 国家自然科学基金项目：面向白盒攻击环境的最小约束多维协同混淆理论与方法（项目编号61772371，负责人） 教育部科技发展中心高校产学研创新基金：面向数字货币钱包的签名相关算法混淆保护研究（2019重点项目，负责人） 教育部产学合作项目：基于微众银行FISCO BCOS区块链平台的应用与实践探索（微众银行，2020，负责人） CCF-绿盟科技“鲲鹏”科研基金：面向内容的结构化数据分类分级智能算法研究（绿盟科技，2021，负责人） 自主原创基础研究项目：抗云端缓存攻击的密码算法空间阻抗混淆保护方法研究（中央高校科研业务费 ，2021，负责人） 区块链安全、密码及优化技术研究与咨询（质子云，2019，负责人） 已完成的重要纵向科研项目 国家自然科学基金项目：白盒攻击环境下安全关键代码保护的广义混淆变换方法研究（项目编号61202382，负责人） 中央高校基本科研业务费：移动应用安全和用户体验交互设计的安全关键代码混淆研究（负责人） 中央高校基本科研业务费：移动应用安全和用户体验交互设计的安全关键代码混淆研究（2017延续资助，负责人） 中央高校基本科研业务费-学科交叉类：基于大数据的社交网络传播机理与模型研究（2017重点项目，负责人） 国家重点研发计划“云计算和大数据”重点专项:“基于大数据的软件智能开发方法和环境”(项目编号2016YFB1000800，主要研究人员) 国家重点研发计划 自动驾驶电动汽车测试与评价技术 （项目编号2018YFB0105100，信息安全评估方法研究） 国家高技术研究发展计划（863项目）：基于web服务和多Agent的MC供应链跨企业生产调度DSS集成研究，（项目编号2007AA04Z151，主要研究人员） 国家自然科学基金项目：动态供应链中基于本体和Multi-Agent的多企业生产调度分布式仿真建模（项目编号71071114，主要研究人员） 国家自然科学基金项目：面向高维稀疏语义空间的云端高通量匹配机理的研究（项目编号61572365，主要研究人员） 教育部博士点基金：基于多Agent和动态数据驱动的生产调度建模与仿真（项目编号200802470009，主要研究人员） 已完成的重要横向科研项目 TEE中身份认证软件的混淆保护研究（支付宝，2018，负责人） 移动APP保护和用户体验交互设计技术咨询（华宇，2016，负责人） 面向Android平台基于ART运行环境的代码混淆器的开发（Google，2016，负责人） 基于大数据挖掘的大规模僵尸网络检测平台（360，2015，主要研究人员） 英特尔中国智能交通发展战略研究（Intel，2014，主要研究人员） 学术任职与社会服务 国家自然科学基金评审人 中国密码学会会员，区块链专业委员会委员 中国计算机学会 高级会员，容错计算专业委员会执行委员，计算法学分会执行委员 教育部学位中心 学位论文评审专家 上海市政府采购咨询专家 上海市科技奖励评审专家 上海工业控制系统信息安全技术服务联盟理事 上海市自然科学基金评审专家 上海市“科技创新行动计划”启明星项目评审专家 上海市科技型中小企业技术创新资金项目评审专家 高水平学术期刊审稿人：IEEE TIFS (IEEE Transactions on Information Forensics and Security)、Computer Journal、JCST (Journal of Computer Science and Technology)、Science China - Information Science 学术会议服务 CCF CFTC2021 第十九届中国计算机学会全国容错计算学术会议 程序委员会主席 IEEE Blockchain-2021: The International Symposium on Fintech and Blockchain Systems Program Co-Chairs 学术论文 第一作者发表学术论文三十余篇，其中EI/SCI收录二十余篇，近年部分第一作者论文如下： [1] “SDSRS: A Novel White-Box Cryptography Scheme for Securing Embedded Devices in IIoT,” IEEE Transactions on Industrial Informatics, 2020. 中科院1区Top期刊. [2] “A Light-Weight White-Box Encryption Scheme for Securing Distributed Embedded Devices,” IEEE Transactions on Computers, 2019. CCF-A类期刊，spotlight paper. [3] “Obfuscatable Anonymous Authentication Scheme for Mobile Crowd Sensing,” IEEE Systems Journal, 2019. [4] A Light-Weight White-Box Encryption Scheme for Securing Distributed Embedded Devices“An Obfuscatable Designated Verifier Signature Scheme,” IEEE Transactions on Emerging Topics in Computing, 2017.[5] “An Obfuscatable Aggregatable Signcryption Scheme for Unattended Devices in IoT Systems,” IEEE Internet of Things Journal, 2017. 中科院1区Top期刊.[6] “Light-weight white-box encryption scheme with random padding for wearable consumer electronic devices,” IEEE Transactions on Consumer Electronics, 2017.[7] “An ultra-lightweight white-box encryption scheme for securing resource-constrained IoT devices,” in ACSAC 2016 (CCF B类会议).[8] “一种白盒攻击模型下的安全加密算法,” 第二十六届全国信息保密学术会议，2016 (大会优秀论文). 获奖经历 2012年上海市科学技术进步奖 2012年度同济大学校级优秀工作者 2013年度同济大学软件学院铭创教育基金 指导研究生获奖 2017年上海市优秀毕业生（韩景轩，现就职于华为） 2019年同济大学优秀硕士学位论文（韦吾境，现就职于微软） 2019年同济大学优秀硕士学位论文（梁竞文，现就职于字节跳动）"
  },
  {
    "title": "孙杳如",
    "relative_url": "../info/1061/2804.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2804.htm",
    "html_content": "姓 名 孙杳如 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 认知与智能信息处理（人工智能、机器学习与类脑计算、计算机视觉、自然语言处理、智能人机交互） 导师类型 博导/硕导 电子邮件 yaoru@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 同济大学计算机科学与技术系教授、博士生导师。曾在爱丁堡大学人工智能系获人工智能博士学位、伯明翰大学行为的脑科学中心等高校研究院从事科研工作。主要研究领域包括人工智能、计算机视觉、自然语言处理、自主机器人等。主持过国家自然科学基金委、科技部、上海市科委等国家级和省部级多个人工智能领域科研项目，研究成果包括发表于Artificial Intelligence、IEEE Transactions等国际高水平期刊及会议上的学术论文以及国际和国内发明专利等，担任过多个国际SCI期刊编委和客座编委、国际学术会议主席和程序委员会主席等。 实验室：认知与智能计算实验室（电信大楼478） 欢迎有志攻读硕士、博士、博士后、访问学者等的同学和同仁与我联系。"
  },
  {
    "title": "谭成翔",
    "relative_url": "../info/1061/2803.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2803.htm",
    "html_content": "姓 名 谭成翔 职 称 教授 学 科 计算机科学与技术学科 专 业 网络空间安全 研究方向 网络空间治理、大数据与跨语种智能理解、智能系统安全 导师类型 博／硕导 电子邮件 jerrytan@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 谭成翔，1965年生, 工学博士（1994年），工学学士（1985年），博士生导师（2000年起）、信息安全专业负责人，国家互联网信息办公室教育部“网络空间国际治理研究基地”（同济）副主任，上海司法鉴定专家库专家。曾任JSPS特别研究员，东京大学外国人客员研究员。中国电信移动互联系统与应用安全国家工程实验室技术委员。参与创建国家反计算机入侵和防病毒研究中心并任首任技术负责人。主持完成一系列重要的等级保护、智能理解与网络空间治理、数字犯罪取证、信任管理和异构身份联盟领域的关键技术研究与产业化服务工作。 主要研究领域包括安全智能与隐私保护、大数据与跨语种智能理解、移动计算与智能系统安全。欢迎有志于网络空间安全与人工智能的同学加入团队。"
  },
  {
    "title": "汪海航",
    "relative_url": "../info/1061/2801.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2801.htm",
    "html_content": "姓 名 汪海航 职 称 教 授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 网络与分布式计算 导师类型 博／硕导 电子邮件 wanghh@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 1965年3月生，浙江奉化人。1994年毕业于浙江大学，获工学博士学位，1994~1996年在同济大学CIMS研究中心从事博士后研究工作。1997年以来，先后担任同济大学经济与管理学院副院长、电子与信息工程学院副院长。现任同济大学计算机科学与技术系教授、博士生导师，美国UTA客座教授，国家863计划信息技术领域评审专家、国家自然科学基金管理科学部评审专家，国家创新基金信息安全领域评审专家，上海市科委电子与信息工程领域专家等职。 长期从事信息安全与可信业务系统、电子商务与供应链管理、企业信息化、机电控制及其自动化、生产与运作管理等领域的研究和教学工作。先后主持和参加过的国家级、省部级、国际合作以及企业合作项目等二十多项。其中国家自然科学基金项目3项，国家863计划项目5项，其他省部委级项目多项。在国内外核心期刊上发表学术论文六十多篇，其中十多篇被EI收录。曾获得国家发明专利一项，“世界华人重大学术成果”一项。目前正在从事国家发改委信息安全专项、国家863计划项目以及上海市科技支撑计划项目等多个课题的研究工作。"
  },
  {
    "title": "王成",
    "relative_url": "../info/1061/2800.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2800.htm",
    "html_content": "姓 名 王成 职 称 教 授 学 科 计算机科学与技术 专 业 智能与网络空间安全 研究方向 智能安全与网络计算 导师类型 博导/硕导，欢迎有志攻读网络空间安全、数据科学、人工智能、数字金融安全和网络计算方向的同学以及有志做博士后研究的同仁与我联系。 电子邮件 cwang@tongji.edu.cn 联系电话 通讯地址 同济大学嘉定校区智信馆214室 王成，男，山东荣成人，现为嵌入式系统与服务计算教育部重点实验室副主任、上海市计算机学会常务理事及网络专委会主任，IEEE Senior Member。2009-2014年曾赴香港科技大学和加拿大渥太华大学做访问学者和博士后研究；2013年晋升为研究员，2015年晋升为教授。从事智能安全与网络计算研究，在网络空间安全、人工智能、并行与分布计算、计算机网络及交叉综合领域著名学术期刊和会议上发表高水平论文（CCF A类及IEEE/ACM Transactions系列50余篇），获得学术会议最佳论文奖3次和提名奖2次，包括移动计算领域旗帜会议之一ACM MobiHoc 2014年度唯一最佳论文奖（国内学者首获）。研究成果被领域诸多同行（中/美/西欧/日本国家院士、ACM/IEEE 等学会Fellow、国际学术期刊主编和学术会议大会主席等）引用或正面评价。申请技术发明专利51项，已授权27项。 承担科研项目情况：作为项目负责人主持科技部国家重点研发计划课题、工信部工业互联网创新发展工程项目课题、国家自然科学基金面上项目和青年项目、教育部新教师基金项目、中国博士后科学基金特别资助项目、中国博士后科学基金面上一等资助项目和同济大学青年优秀人才培养行动计划项目等；作为项目骨干参与国家自然科学基金重大集成项目、973、863和国际重大科技合作计划等。 获奖及荣誉：入选上海市优秀青年学术带头人计划、教育部新世纪优秀人才支持计划、上海市青年拔尖人才开发计划、上海市曙光学者计划、上海市青年科技启明星计划和同济大学中青年领军人才计划等。 获得国家科技进步二等奖、上海市技术发明一等奖、上海市科技进步一等奖、英国工程技术学会（IET）创新提名奖、吴文俊人工智能技术发明奖一等奖、中国电子学会自然科学一等奖、中国自动化学会自然科学一等奖和中国计算机学会（CCF）优秀博士论文奖。 学术服务任职：担任ACM中国图灵大会（ACM TURC 2023）程序委员会副主席、中国计算机大会（CNCC 2018）“优博的培养与成长论坛”论坛主席、ACM TURC 2017 “物联网与网络空间安全论坛”论坛主席、IEEE/ACM UCC 2016和ACM TURC 2018组织委员会主席；担任领域重要学术会议的程序委员会委员（包括AAAI、KDD、IJCAI、IEEE ICDCS、IEEE ICC和IEEE GLOBECOM等）。曾任Ad Hoc & Sensor Wireless Networks和Frontiers of Computer Science等SCI国际期刊编委；2014年被评为并行分布式系统领域顶级期刊IEEE Transactions on Parallel and Distributed Systems的“Top Reviewer”，获得IEEE Computer Society优良服务奖；2016 年作为 IEEE/ACM UCC 2016组织主席获得IEEE Computer Society 杰出服务奖。 团队人才培养：课题组在前期积累了与著名金融和工业企业的项目合作经验，建立了优越的平台基础条件。课题组博士生和硕士生持续获得国家奖学金、校级奖学金、学术先锋、上海市优秀毕业生和各类学术会议/学会最佳论文奖及提名奖等荣誉与奖励。课题组所培养的多位学生毕业后继续深造于国外常春藤高校、任教于国内重点高校以及从业于中国证券保险行业著名国企和国内外互联网一线企业等。"
  },
  {
    "title": "王小平",
    "relative_url": "../info/1061/2843.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2843.htm",
    "html_content": "姓 名 王小平 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 软件与信息服务 导师类型 硕导 电子邮件 xpwang6510@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号同济大学电子与信息工程学院计算机系"
  },
  {
    "title": "王晓国",
    "relative_url": "../info/1061/2798.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2798.htm",
    "html_content": "姓 名 王晓国 职 称 教授 学 科 计算机科学与技术 专 业 计算机科学与技术 研究方向 大数据与互联网金融反欺诈 导师类型 博／硕导 电子邮件 xiaoguowang@mail.tongji.edu.cn 联系电话 通讯地址 上海市曹安路4800号电子与信息工程学院 王晓国，同济大学电子与信息工程学院计算机科学与技术系教授，博士生导师，工学博士。IEEE上海分会副主席。 主要从事智慧城市、大数据、互联网金融反欺诈等领域的研究和应用工作。 主持或作为主要参与人员，承担和完成了包括国家高技术研究发展计划（863）、教育部和财政部、上海市科委、上海市经委等以及其他省市、企业的多个科研项目，获得国家教学成果二等奖1次、上海市教学成果奖1等奖、二等奖多次。发表被EI、SCI收录的论文30多篇。"
  },
  {
    "title": "汪政",
    "relative_url": "../info/1061/3377.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3377.htm",
    "html_content": "姓 名 汪政 职 称 研究员 学 科 计算机科学与技术 专 业 计算机应用技术 研究方向 多模态具身智能、多媒体理解、计算机视觉 导师类型 博/硕导 电子邮件 zh_wang@tongji.edu.cn 通讯地址 嘉定校区济事楼332 汪政，现任同济大学计算机学院研究员，博士生导师。2011年本科毕业于浙江大学，2014-2015年于德国宇航中心DLR进行CSC博士联合培养，2017年博士毕业于浙江大学。其后在电子科技大学从事多媒体理解、计算机视觉、多模态具身智能等方向的研究工作。 近五年在包括但不限于CVPR、ICCV、ACM MM、AAAI、SIGIR等CCF A类会议，TPAMI、TIP、TCYB、TNNLS、TMM、TCSVT等IEEE汇刊上累计发表论文50余篇，ESI高被引/热点论文1篇。授权专利11件。主持国家自然科学基金及省部级项目5项，主研国家级重大重点项目3项，省部级重大重点项目2项。 担任IEEE TIP、TCYB、TMM、TNNLS、TCSVT等业内多个国际知名期刊；CVPR、ICCV、NeurIPS、ICLR、ACM MM、AAAI、ECCV等多个国际知名会议的审稿人，PRCV、ChinaMM等多个国内知名会议区域主席。 近年来，主要围绕可信多模态具身智能方向开展科学研究工作，具体包括： 1） 具身智能：融合触觉的VLA、Affordance Learning、高效的动作生成等； 2） 多媒体理解：视频理解、视-触觉表征学习、跨媒体检索等； 3） 计算机视觉：对抗攻击、对抗防御等； 欢迎对课题组感兴趣的不同专业背景（计算机、软件、自动化、控制、数学等）的硕博士、博士后来信垂询！希望您具备如下特点：1）有强大的自我驱动力去从事相关方向的学术研究；2）踏实肯干，积极进取，勤动手脑；3）具备良好的编程能力，英语和数学基础；4）有良好的团队合作意识。特别鼓励有兴趣的本科生与课题组进行合作。"
  },
  {
    "title": "卫志华",
    "relative_url": "../info/1061/2797.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2797.htm",
    "html_content": "姓 名 卫志华 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 认知与智能信息处理 导师类型 博导/硕导 电子邮件 zhihua_wei@tongji.edu.cn 联系电话 021-69589250 通讯地址 上海市曹安公路4800号电信学院408室 卫志华，同济大学教授，同济大学模式识别与智能系统专业博士，法国里昂二大信息学博士。现任同济大学计算机科学与技术系教授，博士生导师，计算机科学与技术系副主任，同济大学计算机与信息技术国家级实验教学示范中心主任，担任上海市计算机学会学术工作委员会副主任，中国文化产业协会文化元宇宙专委会副秘书长，中国人工智能学会粒计算与知识发现专业委员会委员，中国人工智能学会自然语言理解专业委员会委员，国际期刊Array副主编等职。研究方向包括：机器学习、图像内容分析、自然语言处理等，在CVPR、IJCAI、WWW等国际会议和Trans. Cybernetics等国际期刊发表论文80余篇，出版教材2部；近年来主持国家重点研发计划项目课题、国家自然科学基金项目等国家级项目6项，主持上海市和企业合作项目20余项，组织完成了公安部重大专项1项，先后获得国家级教学成果二等奖、上海市教学成果特等奖、上海市科技进步二等奖、吴文俊人工智能自然科学二等奖等奖项。主持建设了“中文信息处理”国家级一流线下课。"
  },
  {
    "title": "武妍",
    "relative_url": "../info/1061/2796.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2796.htm",
    "html_content": "姓 名 武妍 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 认知与智能信息处理 导师类型 博/硕导 电子邮件 yanwu@tongji.edu.cn< 联系电话 通讯地址 上海市曹安公路4800号电信大楼 武 妍 女，1999年11月获工学博士学位。2000年10月至2003年3月于复旦大学电子科学与技术博士后流动站从事博士后研究工作。2000年12月起任同济大学计算机科学与技术系副教授，2005年6月起任同济大学计算机科学与技术系教授，2006年起任博士生导师。 主要学术任职包括中国人工智能学会神经网络与计算智能专业委员会委员、中国人工智能学会粗糙集与软计算专业委员会委员。 研究领域覆盖人工智能、深度学习、神经网络、模式识别、图像处理与智能无人驾驶等方面。 目前主讲的课程有本科生的《数据结构》、《人工智能原理》、《机器学习》等，研究生的《人工智能原理》、《计算智能技术》和《人工神经网络》等。 负责和参与完成的项目包括国家自然科学基金项目5项，铁道部科技发展计划项目1项，上海市教委重点学科项目1项，上海市自然科学基金项目1项，上海市博士后资助项目1项，以及其他项目10项。 研究成果主要包括在《IEEE Transactions on Biomedical Circuits and Systems》、《Scientific Reports》、《Neurocomputing》、《Journal of Pattern Recognition and Artificial Intelligence》、《Biomedical Engineering / Biomedizinische Technik》、《Soft computing》、、《Chinese Journal of Electronics》、《电子学报》、《计算机研究与发展》、《红外与毫米波学报》等国内外学术刊物及国际学术会议上发表论文120多篇，其中60多篇被SCI/EI收录，主编由上海交通大学出版社出版的21世纪高等学校教材《Visual Foxpro程序设计教程》（第二版）(2007）和《Visual Foxpro程序设计上机实验指导》（第二版）（2007）。参与编著由上海科技教育出版社出版的《智能视觉图像处理―多通道图像的无监督学习方法及其他方法》（2002）。"
  },
  {
    "title": "向阳",
    "relative_url": "../info/1061/2795.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2795.htm",
    "html_content": "姓 名 向阳 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 人工智能与智能信息处理 导师类型 博/硕导 电子邮件 shxiangyang@tongji.edu.cn 联系电话 13321992818 通讯地址 上海市曹安公路4800号电信大楼436室 向阳 同济大学教授，博士生导师，1999年12月毕业于哈尔滨工业大学获博士学位。兼任上海市信息学会副会长、上海市建设与交通技术委员会委员、大数据流通与交易技术国家工程实验室专家委员会专家、中国电子商务创新推进联盟专家委员会委员、中国软件行业协会系统工程分会理事，多届国家及上海市科技奖励会议评审专家。 长期从事大数据领域有关问题研究，具体研究方向包括：大数据智能信息处理、数据挖掘、数据仓库、智能决策支持系统、语义计算、智能问答系统、知识图谱、搜索引擎、信息系统等。近年来已主持完成和主持在研973课题1项（网络大数据计算的基础理论及其应用研究之课题四网络大数据内容建模与语义理解方法研究）、国家自然科学基金项目4项、国家863项目1项、国家科技支撑计划项目1项、上海市科委经信委项目6项、获教育部科学技术进步二等奖2项（其中1项排名第1）、获上海市科技进步二等奖1项（排名第1），获山东省科技进步三等奖1项、获山东省教委科技进步二等奖1项。发表学术论文100余篇，申请获批发明专利10项，获软件著作权5项。出版专著3本，出版国家十一五规划教材1本。 主要教学工作有：为博士生开设“数据仓库与数据挖掘技术”、“智能决策支持系统”等；为本科生开设“数据库原理”、“数据仓库与数据挖掘技术”“信息系统分析与设计”、“电子商务概论”等。"
  },
  {
    "title": "肖国宝",
    "relative_url": "../info/1061/3305.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3305.htm",
    "html_content": "姓 名 肖国宝 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 机器学习、模式识别、计算机视觉 导师类型 博／硕导 电子邮件 gbx@tongji.edu.cn 通讯地址 上海市曹安公路4800号济事楼 肖国宝，博士毕业于厦门大学计算机科学与技术，2016-2018 厦门大学 航空航天学院 博士后，IEEE 高级会员，TIP/TMM/TCSVT等国际期刊审稿人，CVPR/ICCV/ECCV/AAAI等国际会议审稿人。 课程 Python程序设计、机器学习与模式识别、人工智能导论 在研项目 1. 国家自然科学基金面上项目“基于深度拓扑学习的高精准图像特征匹配方法研究”，时间：2025.01-2028.12，主持 2. 国家自然科学基金面上项目“基于多视图空间一致性的鲁棒模型拟合理论研究及应用”，时间：2021.01-2024.12，主持 3. 国家自然科学基金青年项目“新型确定性模型拟合方法研究及其应用”，时间：2018.01-2020.12，主持 4. 中国博士后第62批基金面上项目一等资助“基于超图的模型拟合方法研究及其在运动分割中的应用”，时间：2017.08-2018.07，主持 学术成果及荣誉 主要专注于计算机视觉、机器学习和大模型应用等方面的基础与应用研究，第一/通讯作者在TPAMI, IJCV, TIP, ICCV,ECCV, AAAI等国际高水平学术期刊/会议上发表学术论文50余篇，其中SCI一区和CCF A类期刊/会议30余篇。拥有国家发明专利11项，科研成果成功转化9项，出版《科学出版社》专著一部。 曾获得中国图象图形学学会“优秀博士学位论文”（全国10人）、福建省“优秀博士学位论文”、福建五四青年奖章、福州市青年科技奖等。 部分成果如下： 1. Guobao Xiao, Jun Yu，Jiayi Ma，Deng-Ping Fan and Ling Shao, Latent Semantic Consensus For Deterministic Geometric Model Fitting，IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024, 46 (9), 6139 - 6153 (SCI/JCR-1,TOP期刊, CCF A, IF=20.8) 2. Guobao Xiao, Xin Liu, Zhen Zhong, Xiaoqin Zhang, Jiayi Ma and Haibin Ling,T-Net++: Effective Permutation-Equivariance Network for Two-View Correspondence Pruning，IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024,1-17 (SCI/JCR-1, TOP期刊, CCF A, IF=20.8) 3. Hanzi Wang#, Guobao Xiao#(Equal Contribution), Yan Yan and David Suter, Searching for representative modes on hypergraphs for robust geometric model fitting, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2019, 41(3), 687-711(SCI/JCR-1, TOP期刊, CCF A, IF=20.8) 4. Guobao Xiao, Hanzi Wang*, Yan Yanand David Suter, Superpixel-guided two-view deterministic geometric model fitting, International Journal of Computer Vision (IJCV), 2019, 127 (4), 323-339 (SCI/JCR-2, TOP期刊, CCF A, IF=11.6) 5. Guobao Xiao, Hanzi Wang*, Jiayi Ma and David Suter, Segmentation by Continuous Latent Semantic Analysis for Multi-structure Model Fitting, International Journal of Computer Vision (IJCV), 2021, 129,2034-2056 (SCI/JCR-2, TOP期刊, CCF A, IF=11.6) 6. Guobao Xiao, Jiayi Ma*, Shiping Wang and Changwen Chen, Deterministic Model Fitting by Local-NeighborPreservation and Global-Residual Optimization, IEEE Transactions on Image Processing (TIP), 2020, 29, 8988-9001 (SCI/JCR-1, TOP期刊, CCF A, IF=10.8) 7. Linxin Zheng, GuobaoXiao*, Ziwei Shi, Shiping Wang and Jiayi Ma,MSA-Net: Establishing Reliable Correspondences by Multi-Scale Attention Network, IEEE Transactions on Image Processing (TIP), 2022, 31, 4598-4602 (SCI/JCR-1, TOP期刊, CCF A, IF=10.8) 8. Xin Liu, Guobao Xiao*, Riqing Chen*and Jiayi Ma, PGFNet: Preference-Guided Filtering Network for Two-View Correspondence Learning, IEEE Transactions on Image Processing (TIP), 2023, 32,1367-1378 (SCI/JCR-1, TOP, CCF A, IF=10.8) 9. Shunxing Chen, Guobao Xiao*, Junwen Guo, Qiangqiang Wu and Jiayi Ma, DHM-Net: Deep Hypergraph Modeling for Robust Feature Matching, IEEE Transactions on Image Processing (TIP), 2024 (SCI/JCR-1,TOP, CCF A, IF=10.8) 10. Junwen Guo, GuobaoXiao*, Shiping Wang and Jun Yu, Graph Context Transformation Learning for Progressive Correspondence Pruning, Thirty-EighthAAAI Conference on Artificial Intelligence (AAAI), 2024 (CCF A类会议) 11. Xiangyang Miao, GuobaoXiao*, Shiping Wang and Jun Yu, Graph Context Transformation Learning for Progressive Correspondence Pruning, Thirty-Eighth AAAI Conference on Artificial Intelligence (AAAI), 2024 (CCF A类会议) 12. Tangfei Liao, Xiaoqin Zhang*, Li Zhao, Tao Wang and Guobao Xiao*, Graph Context Transformation Learning for Progressive Correspondence Pruning, Thirty-Eighth AAAI Conference on Artificial Intelligence (AAAI), 2024 (CCF A类会议) 13. Zhen Zhong, Guobao Xiao*, Linxin Zheng, Yan Lu and Jiayi Ma, T-Net: Effective Permutation-Equivariant Network for Two-View Correspondence Learning, IEEE International Conference on Computer Vision (ICCV), 2021,1950-1959 (CCF A类会议) 14. Hanzi Wang, Guobao Xiao(Equal Contribution), Yan Yan, David Suter, Mode-seeking on hypergraphs for robust geometric model fitting, International Conference on Computer Vision (ICCV), 2015, 2902-2910 (CCF A类会议) 15. Zhenni Yu, Xiaoqin Zhang*, Li Zhao, Yi Bin and Guobao Xiao*, Exploring Deeper! Segment Anything Model with Depth Perceptionfor Camouflaged Object Detection, Proceedings of the 32nd ACM International Conference on Multimedia (MM), 2024, 4322--4330, (CCF A类会议) 欢迎有志于计算机视觉、机器学习、大模型领域的优秀硕士与博士研究生加入我们的团队，共同探索和创新！ 注：本团队对学生要求较为严格，要求有丰富的深度学习编程基础和(博士生)要求发表SCI一区/CCF A 会议等科研基础！ https://guobaoxiao.github.io/"
  },
  {
    "title": "闫春钢",
    "relative_url": "../info/1061/2794.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2794.htm",
    "html_content": "姓 名 闫春钢 职 称 教 授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 计算机协同与服务计算、可信计算、智能计算等 导师类型 博/硕导 电子邮件 cgyan2@163.com 联系电话 021-69589867 通讯地址 1986年于山东科技大学应用数学专业获理学学士学位，1993年于山东科技大学运筹学与控制论专业获理学硕士学位，2006年于同济大学计算机应用技术专业获工学博士学位。1999年到同济大学工作，现任教授，博（硕）士生导师。近年来获得国家级奖项2项、省部级奖项1项；主持国家863项目2项、国家工信部项目1项、国家自然科学基金2项、省部级项目多项；已在《IEEE Transactions on Systems Man and Cybernetics, Part A: Systems》、《IEEE Transactions on Automation Science and Engineering》等国内外核心刊物及国际会议发表论文40余篇。主要研究方向：计算机协同与服务计算、可信计算、智能计算等。 科研项目（2010-2015）： 主持项目： 1.软件安全性病态模型及其检测、防治技术研究，国家863项目 2.普适计算环境支撑系统中的路网信息服务技术研究，国家863项目 3.支持国产CPU的编译系统及工具链之五（核高基重大专项），国家工信部 5.面向社会秩序的社会计算理论和方法研究，国家自然科学基金 6.无线传感网与无线局域网共存系统的容量研究，上海市科委 7.交通状态指数高性能计算及决策应用关键技术研究，上海市科委 论文著作（主要论文）： 1. Modeling and Validating E-commerce Business Process Based on Petri Nets. IEEE Transactions on Systems Man and Cybernetics, Part A: Systems.卷号: 44/期号:3/页码:327-341, 2014.（第二） 2.Modeling and Verification of Online Shopping Business Processes by Considering Malicious Behavior Pattern. IEEE Transactions on Automation Science and Engineering.卷号: PP/期号:99/页码:1-16, 2014.（第二） 3.A Novel Method for Calculating Service Reputation.期刊名：IEEE Transactions on Automation Science and Engineering.卷号：10/期号：3/页码：634-642,2013.（第二） 获得奖励： 1.基于虚拟超市技术的大规模网络资源管理及其应用,国家技术发明奖,排名3, 2010年 2.面向复杂问题结构可计算的决策支持系统研究与应用,教育部科学技术进步奖,排名2 2010年 3.城市交通智能路网的关键技术及应用,国家科学技术进步奖,排名10, 2014年"
  },
  {
    "title": "杨恺",
    "relative_url": "../info/1061/2793.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2793.htm",
    "html_content": "姓 名 杨恺 职 称 长聘教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 AI+网络，多层优化，无线通信和物联网 导师类型 硕导/博导 电子邮件 kaiyang@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号智信馆 杨恺现任同济大学长聘教授，上海自主智能无人系统科学中心博导，上海计算机学会网络专委会副主任，国家级人才。杨恺博士分别在东南大学, 新加坡国立大学, 哥伦比亚大学获得学士, 硕士,和博士学位。曾经在哥伦比亚大学，贝尔实验室, NEC 美国研究所，美国华为研究院等多个高校和研究院从事教学和研究工作。曾任哥伦比亚大学客座教授。 研究领域为运筹学与信息科学的交叉领域，近期聚焦在AI+网络和人工智能中的多层优化问题。在ICML, NeurIPS, ICLR，SIGIR， INFOCOM和IEEE TDSC, IEEE JSAC, IEEE Transactions on Wireless Communications, IEEE Transactions on Information Theory，IEEE Transactions on Signal Processing 等人工智能顶会和网络期刊上以通讯作者或者第一作者发表论文80余篇。并拥有30余项专利。杨恺博士主持开发的网络大数据系统已经被多个顶级运营商使用。杨博士获哥伦比亚大学 Elihau Jury Award, 贝尔实验室技术贡献奖，贝尔实验室最佳研究团队奖, 美国华为技术突破一等奖和未来之星, 2023 IJCAI 时间序列研讨会最佳论文提名奖等多个奖项。杨恺担任多个国际期刊的编辑和客座编辑，并曾经担任多个世界知名学术会议的技术分会主席。承担包括国家自然科学基金面上项目、教育部-中移动联合基金等项目与课题。 欢迎有志于科研的同学报考本课题组的博士，硕士，应聘研究员，研究助理，博士后，或参与本科毕业设计。 实验室主页：https://kaiyangcn.github.io/"
  },
  {
    "title": "杨志强",
    "relative_url": "../info/1061/2842.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2842.htm",
    "html_content": "姓 名 杨志强 职 称 教 授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 认知与智能信息处理 导师类型 硕 导 电子邮件 YZQ98K@163.com 联系电话 通讯地址 上海市四平路1239号电子与信息工程学院 杨志强 男，1964年12月生，博士，教授。计算机基础教室室主任，同济大学计算机与信息技术教学实验中心基础平台主任（国家级教学实验示范中心）；上海市计算机基础教育协会秘书长，华东地区计算机基础教育研究会常务理事，全国高校计算机基础教育研究会理工专业委员会委员。连续两次获同济大学优秀青年教师称号，上海市育才奖，入选同济大学第四届(2009年)教学名师奖（全校公示中）；连续两届获国家教学成果二等奖，连续3届获上海市教学成果一等奖；编写出版18部教材，发表了《汉语韵律短语切分》等多篇论文和教改论文。 研究领域 语音信号处理、计算机基础教学。 主讲课程 大学计算机基础、C/C++程序设计课程、数据库技术与应用、数据库技术与应用，以及研究生的语音信号处理课程。 主持或参与的课题： 1．理工科本科生计算机实践能力培养改革与实践（第2负责人），教育部，2006-2009 2．基于网络环境的计算机基础教学改革与实践（第2负责人），教育部世行贷款项目，2000-2003 3．计算机与信息技术国家级教学实验示范中心基础平台建设，教育部，2007- 4．数据库技术与应用精品课程建设，上海市教委，2008-2013 5．大学计算机基础精品课程建设，上海市教委、教育部，2005-2010 6．VB程序设计精品课程建设，上海市教委、教育部，2005-2010 7．大学计算机基础课程资源库建设，高等教育出版社，2005-2006 8．大学计算机基础教学团队建设（第2负责人），上海市教委、教育部，2008- 9．《C/C++程序设计教程》十一五国家级规划教材建设，教育部，2006-2010 10．多媒体技术与应用精品课程建设，同济大学，2008-2013 11．C/C++程序设计课程精品课程建设，同济大学，2005-2010 12．Web技术与应用课程教学改革与实践，校课程建设项目，2007-2009 13．C/C++程序设计课程教学改革与实践，同济大学重点课程建设项目，2003-2005 14．无损图像数据隐藏的理论（第2负责人），国家自然科学基金，2004-2007 2．获得的表彰/奖励 大学生计算机实践和创新能力培养与实践 上海市教学成果一等奖 2009； 新世纪初的计算机基础教育改革与实践 国家级教学成果二等奖，上海市教学成果一等奖 2005； 面向21世纪计算机基础教育改革与实践 国家级教学成果二等奖 上海市教学成果一等奖 2009； 数据库技术与应用 上海市精品课程 上海市教委； 同济大学精品课程 2007 2008； C/C++程序设计课程 同济大学精品课程 2004； 上海市育才奖 上海市教委 2001； 同济大学第四届教学名师奖（公示中）2009； 同济大学优秀青年教师 连续两届1999 2001； 同济大学苏邦俊奖教金 一等奖 2005。"
  },
  {
    "title": "尹长青",
    "relative_url": "../info/1061/2729.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2729.htm",
    "html_content": "尹长青 YIN CHANG QING 教授电子邮件: 主讲课程：计算机网络信息安全 研究方向：新媒体AR网络安全 教学工作 主讲课程： 1)计算机网络 2) 信息安全 部分科研项目简介 2009年 参与研发、设计世博会的城市文明馆 2008年参与“中意友好年新媒体作品展”、国家级项目“国家图书馆虚拟现实”项目 国家重点攻关（S219）项目 “计算机网络化病毒的防治及追踪技术研究” 职责：系统设计和部分实现 国家863计划课题 “核心路由器公平排队技术研究”，职责：算法研究、系统设计和部分系统实现 上海市电力公司二次系统安全软课题研究，职责：需求分析，设计，认证和签名实现 华为基金 无线数据包队列算法研究，职责：建模与模拟仿真 上海市档案馆利用管理系统，职责：设计与部分实现，数据库触发器设计和存储过程优化 上海市期货交易所网上交易平台，职责：需求分析，设计和网络通信实现 获奖经历 2009年获得 国家发明专利一项 参与的个人数字伙伴软件被评为99年度江苏省科研三等奖"
  },
  {
    "title": "袁时金",
    "relative_url": "../info/1061/2730.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2730.htm",
    "html_content": "袁时金 Yuan Shijin 博士，教授，博导yuanshijin2003@163.com 主讲课程： 数据库原理与应用（国家双语教学示范课程、上海市重点课程、上海高校示范性全英语教学课程） 内存计算与内存数据库 研究方向：人工智能及其可解释性，机器学习，神经网络，大气及海洋大数据分析 主持或参与科研项目（课题）情况： 1. 国家自然科学基金联合基金【重点】项目“基于因果推断和物理引导的面向天气预报与气候预测的深度学习理论算法及可解释性研究”，项目编号：U2142211，2022.01-2025.12，主持。 2. 国家自然科学基金【面上】项目“多模态数据驱动的海气耦合台风概率预报模型”，项目编号：42075141，2021.01-2024.12，主持。 3. 国家重点研发计划“全球变化及应对”专项项目“大数据与深度学习方法创新地球系统模式发展及应用研究”之课题四“深度神经网络预测模型发展与动力模式结果订正方法研究”，课题编号2020YFA0608004，2020-11至2025-04，第二负责人。 4. 上海市2020年度“科技创新行动计划”社会发展科技攻关“公共安全/突发公共安全事件应急处理处置”专题项目“基于风云卫星智能精准观测针对极端天气事件的长三角航空运行安全应对研究”之课题二“针对CNOP的高效智能算法开发与应用“，课题编号 20dz1200702， 2020-09-01至2023-08-31，主持。 5. 国家自然科学基金【青年基金】项目“智能算法求解CNOP性能优化及其应用”，项目编号：41405097，2015.01-2017.12，主持。 6. 国家高技术研究发展计划(863计划)项目”地球系统模式中的高效并行算法研究与并行耦合器研制”之课题“海气耦合模式CNOP的高效并行算法及其优化”，课题编号 2010AA012304，2011.07-2012.12，第二负责人。 7． 中国科学院知识创新工程重要方向项目”条件非线性最优扰动方法在黑潮路径变异可预报性研究中的应用”之课题“黑潮路径变异的数值模拟与分析研究”，课题编号：KZCX2-EW-201，2011.01-2013.12，第二负责人。 8. 2019年重点领域学科交叉重大“中央高校基本科研业务费专项资金”项目“基于深度神经网络的台风路径强度和降水精准预报研究”，项目编号22120190207，2019-08-01日至2021-07-31，第二负责人。 9. 江苏省信息化建设重点示范工程项目“太仓市智慧城市大数据智能分析系统研发”，主持。 学术论文： 期刊论文： (1) Bin Mu#, Yuehan Cui, Shijin Yuan*, et al. Simulation, precursor analysis and targeted observation sensitive area identification for two types of ENSO using ENSO-MC v1.0[J]. Geoscientific Model Development, 2022, 15(10): 4105-4127. (2) Bin Mu#, Bo Qin, Shijin Yuan*. ENSO-ASC 1.0.0: ENSO deep learning forecast model with a multivariate air–sea coupler[J]. Geoscientific Model Development, 2021, 14(11): 6977-6999. (3) Shijin Yuan#, Huazhen Zhang, Yaxuan Liu, Bin Mu*. Feature extraction-based intelligent algorithm framework with neural network for solving conditional nonlinear optimal perturbation[J]. Soft Computing, 2022: 1-18. (4) Bin Mu#, Jing Li, Shijin Yuan*, et al. The NAO Variability Prediction and Forecasting with Multiple Time Scales Driven by ENSO Using Machine Learning Approaches[J]. Computational Intelligence and Neuroscience, 2022. (5) Bin Mu#, Jing Li, Shijin Yuan*, et al. Optimal precursors identification for North Atlantic oscillation using the parallel intelligence algorithm[J]. Scientific Programming, 2022. (6) Shijin Yuan#, Bo Shi, Zijun Zhao, Bin Mu*, et al. Ensemble Forecast for Tropical Cyclone Based on CNOP-P Method: A Case Study of WRF Model and Two Typhoons[J]. Journal of Tropical Meteorology, 2022, 28(2): 121-138. (7) Bin Mu#, Bo Qin, Shijin Yuan*, et al. ENSO Deep Learning Forecast Model: A Survey [J]. Clivar Exchange, 2021. (8) Shijin Yuan#, Cheng Wang, Bin Mu*, et al. Typhoon intensity forecasting based on LSTM using the rolling forecast method[J]. Algorithms, 2021, 14(3): 83. (9) Bin Mu#, Jing Li, Shijin Yuan*, Xiaodan Luo,Prediction of North Atlantic Oscillation Index Associated with the Sea Level Pressure Using DWT-LSTM and DWT-ConvLSTM Networks, Mathematical Problems in Engineering, 2020.10.05/Volume 2020. (10) Bin Mu#, Jing Li, Shijin Yuan*, Xiaodan Luo, Guokun Dai, CNOP-P-Based Parameter Sensitivity Analysis for North Atlantic Oscillation in Community Earth System Model Using Intelligence Algorithms, Advances in Meteorology, 2020.10.15/Volume 2020. (11) Bin Mu#, Bo Qin, Shijin Yuan*, Xiaoyun Qin, A Climate Downscaling Deep Learning Model considering the Multiscale Spatial Correlations and Chaos of Meteorological Events, Mathematical Problems in Engineering, 2020.11.17/Volume 2020. (12) Bin MU#, Juhui REN , Shijin YUAN*, Rong-Hua ZHANG, Lei CHEN , and Chuan GAO，The Optimal Precursors for ENSO Events Depicted Using the Gradientdefinition-based Method in an Intermediate Coupled Model，ADVANCES IN ATMOSPHERIC SCIENCES, VOL. 36, DECEMBER 2019, 1–12. (13) Shijin Yuan#，Xiaodan Luo，Bin Mu*，Jing Li，Guokun Dai，Prediction of North Atlantic Oscillation Index with Convolutional LSTM Based on Ensemble Empirical Mode Decomposition，Atmosphere 2019, 10(5), 252. (14) YUAN Shijin#, ZHANG Huazhen, LI Mi, MU Bin*, CNOP-P-based parameter sensitivity for double-gyre variation in ROMS with simulated annealing algorithm. Journal of Oceanology and Limnology, 2019, 37 (3): 957-967. (15) YUAN Shijin#, LI Mi, WANG Qiang, ZHANG Kun, ZHANG Huazhen, MU Bin*，Optimal precursors of double-gyre regime transitions with an adjoint-free method. Journal of Oceanology and Limnology, 2019, 37 (4): 1137-1153. (16) Zhang Linlin#, Mu Bin, Yuan Shijin*, et al. A novel approach for solving CNOPs and its application in identifying sensitive regions of tropical cyclone adaptive observations. Nonlinear Processes in Geophysics, 2018, 25(3): 693-712. (17) Mu Bin#, Zhang Linlin, Yuan Shijin*, et al. Intelligent Algorithms for Solving CNOP and Their Applications in ENSO Predictability and Tropical Cyclone Adaptive Observations. Journal of Tropical Meteorology, 2018, 25(1): 63-81. (18) Zhang Linlin#, Yuan Shijin*, Mu Bin, et al. CNOP-based sensitive areas identification for tropical cyclone adaptive observations with PCAGA method. Asia-Pacific Journal of Atmospheric Sciences, 2017, 53(1):63-73. (19) Zhang Linlin#, Mu Bin, Yuan Shijin*. A Modified Direct Search Algorithm based on Kernel Density Estimator with Three Mapping Strategies for Solving Nonlinear Optimization. Journal of Computers. (2018，EI) (20) Mu Bin#, Ren Juhui, Yuan Shijin*, Zhou feifan. Identifying Typhoon Targeted Observations Sensitive Areas Using the Gradient Definition Based Method, Asia-Pacific Journal of Atmospheric Sciences, 2018: 1-13. (21) Mu Bin#, Ren Juhui, Yuan Shijin*. An efficient approach based on the gradient definition for solving conditional nonlinear optimal perturbation, Mathematical Problems in Engineering, 2017. (22) Mu Bin#, Wen Shicheng, Yuan Shijin*, Li Hongyu. PPSO: PCA based particle swarm optimization for solving conditional nonlinear optimal perturbation. Computers & geosciences, 83 (2015): 65-71. (23) Wen Shicheng#, Yuan Shijin*, Li Hongyu, Mu Bin, Robust ensemble feature extraction for solving conditional nonlinear optimal perturbation, In ternational Journal of Computational Science and Engineering, 2015.01.01, 11(4): 349~359. (24) Yuan Shijin#*, Wen Shicheng, Li Hongyu, Zhang Xinfeng, Liu Qin, An optimization framework for adjoint-based climate simulations: A case study of the Zebiak-Cane model, International Journal of High Performance Computing Applications, 2014.5, 28(2): 174~182. 会议论文： (1) Shijin Yuan#, Cheng Wang, Bin Mu, et al. Efficient Executions of Community Earth System Model onto Accelerators Using GPUs[C]//2020 6th International Conference on Robotics and Artificial Intelligence. 2020: 192-199. (2) Bin Mu#, Bo Qin, Shijin Yuan*, Multi-Scale Downscaling with Bayesian Convolution Network for ENSO SST Pattern, 2020 5th International Conference on Electromechanical Control Technology and Transportation (ICECTT), May. 15-17, 2020, Nanchang, online, China, pp. 359-362. (3) Shijin Yuan#， Bo Shi, Bin Mu*, Data Assimilation by Artificial Neural Network using Conventional Observation for WRF Model, 2020 5th International Conference on Machine Learning Technologies, June 19-21, 2020, Beijing, online, China, pp. 62-67. (4) Bin Mu#, Shaoyang Ma, Shijin Yuan*，Hui Xu, Applying Convolutional LSTM Network to Predict El Nino Events: Transfer Learning from the Data of Dynamical Model and Observation, 2020 10th IEEE International Conference on Electronics Information and Emergency Communication (ICEIEC 2020), July 17-19, 2020, Beijing, online, China, pp. 215-219. (5) B. Mu#, J. Li, S. Yuan*, X. Luo and G. Dai, \"Parallel PCA-Based Bacterial Foraging Optimization Algorithm for Identifying Optimal Precursors of North Atlantic Oscillation,\" 2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS), Zhangjiajie, China, 2019, pp. 1171-1177. 中国张家界 (6) Mu, B.#, Peng, C., Yuan, S.*, & Chen, L. (2019, July). ENSO Forecasting over Multiple Time Horizons Using ConvLSTM Network and Rolling Mechanism. In 2019 International Joint Conference on Neural Networks (IJCNN) ,IEEE. 匈牙利布达佩斯 (7) Mu, B.#, Li, J., Yuan, S.*, Luo, X., & Dai, G. (2019, July). NAO Index Prediction using LSTM and ConvLSTM Networks Coupled with Discrete Wavelet Transform. In 2019 International Joint Conference on Neural Networks (IJCNN) , IEEE. 匈牙利布达佩斯 (8) Shijin Yuan#，Yunyi Chen，Bin Mu*, CACO-LD: Parallel Continuous Ant Colony Optimization with Linear Decrease Strategy for Solving CNOP, 24nd International Conference on Neural Information Processing, ICONIP 2017, Guangzhou, China, November, 2017. 中国广州 (9) Bin Mu#*, Site Li, Shijin Yuan, An improved effective approach for urban air quality forecast ,2017 13th International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery (ICNC-FSKD), Guilin, China, 2017.7.29-2017.7.31. 中国桂林 (10) Bin Mu#， Junhui Zhao， Shijin Yuan*， Jinghao Yan， Parallel Dynamic Search Fireworks Algorithm with Linearly Decreased Dimension Number Strategy for Solving Conditional Nonlinear Optimal Perturbation， 2017 International Joint Conference on Neural Networks (IJCNN)，Anchorage, Alaska, USA，2017.5.14-2017.5.19. 美国阿拉斯加 (11) Yuan Shijin#*, Mi Li, Bin Mu, Jingpeng Wang, PCAFP for Solving CNOP in Double-Gyre Variation and its Parallelization on Clusters, 2016 IEEE 18th International Conference on High-Performance Computing and Communications, Sydney, Australia, 2016.12.12-2016.12.14. 澳大利亚悉尼 (12) Ren Juhui#, Yuan Shijin*, Mu Bin, Parallel modified artificial bee colony algorithm for solving conditional nonlinear optimal perturbation, 2016 IEEE 18th International Conference on High-Performance Computing and Communications, Sydney, Australia, 2016.12.12-2016.12.14. 澳大利亚悉尼 (13) Yuan Shijin#*, Qian Yiwen, Mu Bin, Paralleled continuous tabu search algorithm with sine maps and staged strategy for solving CNOP, 15th International Conference on Algorithms and Architectures for Parallel Processing, ICA3PP 2015, Zhangjiajie, China, 2015.11.18-2015.11.20. 中国张家界 (14) Yuan Shijin#*, Ji Feng, Yan Jinghao, Mu Bin, A Parallel Sensitive Area Selection-Based Particle Swarm Optimization Algorithm for Fast Solving CNOP, 22nd International Conference on Neural Information Processing (ICONIP), Istanbul, TURKEY, 2015.11.9-2015.11.12. CCF-C.土耳其伊斯坦布尔 (15) Yuan Shijin#*, Zhao Li, Mu Bin, Parallel Cooperative Co-evolution Based Particle Swarm Optimization Algorithm for Solving Conditional Nonlinear Optimal Perturbation, 22nd International Conference on Neural Information Processing (ICONIP), Istanbul, Turkey, 2015.11.9-2015.11.12. 土耳其伊斯坦布尔 (16) Yuan Shijin#*, Yan Jinghao, Mu Bin, Li Hongyu, Parallel dynamic step size sphere-gap transferring algorithm for solving conditional nonlinear optimal perturbation, 17th IEEE International Conference on High Performance Computing and Communications, IEEE 7th International Symposium on Cyberspace Safety and Security and IEEE 12th International Conference on Embedded Software and Systems, HPCC-ICESS-CSS 2015, New York, USA , 2015.8.24-2015.8.26. 美国纽约 (17) Wen, Shicheng#，Yuan, Shijin*，Mu, Bin，Li, Hongyu，Robust PCA-based genetic algorithm for solving CNOP， 11th International Conference on Intelligent Computing, ICIC 2015，Fuzhou, China，2015.8.20-2015.8.23. 中国福州 (18) Bin Mu#，Linlin Zhang，Shijin Yuan*，Hongyu Li， PCAGA: Principal Component Analysis Based Genetic Algorithm for Solving Conditional Nonlinear Optimal Perturbation, 2015 International Joint Conference on Neural Networks (IJCNN)，Killarney, Ireland，2015.7.12-2015.7.17. 爱尔兰基拉尼 (19) Fuxin Chen#, Shijin Yuan*, Bin Mu，User-QoS-based Web Service Clustering for QoS Prediction， ICWS 2015：the 22nd IEEE International Conference on Web Services, New York City, USA, 2015.6.27-2015.7.2. CCF-B. 美国纽约 (20) Wen, Shicheng#，Yuan, Shijin*，Mu, Bin，Li, Hongyu，Ren, Juhui, PCGD: Principal components-based great deluge method for solving CNOP, IEEE Congress on Evolutionary Computation, CEC 2015，Sendai, Japan，2015.5.25-2015.5.28. 日本仙台 (21) Bin Mu#，Su Li，Shijin Yuan，QoS-Aware Cloud Service Selection Based on Uncertain User Preference， RSKT 2014: the 9th International Conference on Rough Sets and Knowledge Technology，2014年10月, Lecture Notes in Artificial Intelligence，RSKT2014：pp.589-600, Shanghai, China, 2014.10.24-2014.10.26. 中国上海 (22) Wen, Shicheng#，Yuan, Shijin*，Mu, Bin，Li, Hongyu，Chen, Lei, SAEP: Simulated Annealing Based Ensemble Projecting Method for Solving Conditional Nonlinear Optimal Perturbation, 14th International Conference on Algorithms and Architectures for Parallel Processing (ICA3PP)，Dalian, China，2014.8.24-2014.8.27. 中国大连 (23) Mu, Bin#，Wen, Shicheng，Yuan, Shijin*，Li, Hongyu, Orthogonal Neighborhood Preservation Projection Based Method for Solving CNOP, 10th International Conference on Intelligent Computing (ICIC)，Taiyuan, China，2014.8.3-2014.8.6. 中国太原 (24) Hongyu Li#，Jie Bian，Shijin Yuan*，Parallel Optimization of the MM5 Adjoint Model， 15th IEEE International Conference on High Performance Computing and Communications, HPCC 2013 and 11th IEEE/IFIP International Conference on Embedded and Ubiquitous Computing, EUC 2013，Zhangjiajie, China，2013.11.13-2013.11.15. 中国张家界 (25) Li, Hongyu#，Zhou, Weiyu，Yuan, Shijin*，Wen, Shicheng, ACStack: Adaptive composite stack for adjoint models in code optimization, 15th IEEE International Conference on High Performance Computing and Communications, HPCC 2013 and 11th IEEE/IFIP International Conference on Embedded and Ubiquitous Computing, EUC 2013，Zhangjiajie, China，2013.11.13-2013.11.15. 中国张家界 (26) Li, Hongyu#，Qin, Jiachuan，Yuan, Shijin*，Bian, Jie, Code parallel refactoring of the Zebiak-Cane model based on JASMIN, 2013 3rd International Conference on Computer Science and Network Technology, ICCSNT 2013，Dalian, China，2013.10.12-2013.10.13. 中国大连"
  },
  {
    "title": "曾国荪",
    "relative_url": "../info/1061/2802.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2802.htm",
    "html_content": "姓 名 曾国荪 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 软件与信息服务 导师类型 博／硕导 电子邮件 gszeng@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号智信馆517室 曾国荪，本科、硕士、博士均毕业于上海交通大学。现为同济大学计算机科学与技术系教授，“计算机软件与理论”专业博士生导师。是国家重点研发计划项目首席科学家，上海市优秀学科带头人，国家科技奖励评审专家，国家自然科学基金项目评议专家。长期从事云计算、大数据并行分布处理、内容信任与安全、智能搜索等领域的研究工作。先后主持完成了1项973课题、3项863课题、1项国家重点研发计划、7项国家自然和社科基金项目、11项教育部/上海市科委重大重点项目。先后参与了国家和省部级科研项目10余项。在IEEE TSC、TR、TCSS、中国科学、计算机学报、软件学报等国内外核心刊物上发表学术论文260余篇。出版专著4部。申请发明专利50余项。指导博士研究生30余名，其中1名获IBM全球博士英才奖。获2010国家技术发明奖二等奖，获2009上海市技术发明奖一等奖，获2007年教育部科技进步一等奖。"
  },
  {
    "title": "张冬冬",
    "relative_url": "../info/1061/2792.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2792.htm",
    "html_content": "姓 名 张冬冬 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机应用技术 研究方向 图像处理、深度学习、模式识别、人工智能 导师类型 博/硕导 电子邮件 ddzhang@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号同济大学电信学院428室 2007年3月毕业于上海交通大学，获工学博士学位。2007年1月至2008年10月于香港中文大学从事博士后研究工作。2009年3月任同济大学讲师，2010年12月评为副教授，2017年12月评为教授。同济大学嵌入式系统与服务计算教育部重点实验室骨干教师。入选2009年《同济大学青年优秀人才培养行动计划》及2011年《同济大学青年英才计划》。获同济大学青年骨干教师出国研修项目资助于2014年8月-2015年2月在伦敦大学玛丽女王学院进行学术交流。 研究方向：图像处理、深度学习、模式识别、人工智能等 主持及参与的项目： 主持国家自然科学基金项目1项、上海科委科技创新领域重点项目课题1项、上海市自然基金项目1项、同济大学中央高校基本科研业务费专项资金项目1项；嵌入式系统与服务计算教育部重点实验室开放课题1项；负责实施完成国家发改委重大专项项目1项；参与973项目子课题1项。 研究成果： 在《IEEE Trans. On Circuit and System for Video Technology》、《IEEE Trans. On Consumer Electronic》、《Signal Processing: Image Communication》、《SPIE Journal of Optical Engineering》等国内外重要学术刊物上发表论文20多篇，SCI和EI收录20余次，他人引用70余次。参与提交MPEG国际标准提案4项，作为第一发明人获得美国发明专利授权1项和国家发明专利授权12项。 主要学术任职： YOCSEF上海AC委员， IEEE国际会议VCIP 2010技术程序委员会委员，国际期刊SPIE Journal of Optical Engineering、Signal Processing: Image Communication、Journal of Visual Communication and Image Representation，及国际会议IEEE International Conference on Image Processing、IEEE International Symposium on Circuits and Systems、IEEE International Conference on Multimedia and Expo等会议审稿人，SITP项目指导教师。 获得的奖励： 1. 2018年上海科技进步二等奖1项（排名第2）、科技发明奖1项（排名第14） 2. 2017年同济大学教学成果奖二等奖1项 3. 2014年CERNET二十年建设中做出突出贡献的先进个人 4. 2009年同济大学电子与信息工程学院青年教师讲课比赛特等奖 5. 2009年上海市优秀博士学位论文奖"
  },
  {
    "title": "张军旗",
    "relative_url": "../info/1061/2791.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2791.htm",
    "html_content": "姓 名 张军旗 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机软件与理论 研究方向 专注仿生群体智能、群体机器人、多智能体系统、强化学习等人工智能领域，欢迎有钻研精神和各类竞赛经历的同学报考。 导师类型 博导/硕导 电子邮件 zhangjunqi@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信大楼 张军旗教授长期研究仿生群体智能优化理论与算法，已应用于群体机器人等无人集群系统的协同与自主决策等领域。主持完成上海教委科研创新计划自然科学重大项目1项，国家自然科学基金项目4项，上海科委面上项目1项。已在《IEEE Trans. onEvolutionary Computation》、《IEEE Trans. on Cybernetics》、《IEEE Trans. On Automatic Control》、《IEEE Transactionson Systems, Man, and Cybernetics: Systems》、《IEEETransactions on Intelligent Transportation Systems》、《IEEETransactions on Control Systems Technology》、《IEEETransactions on Automation Science and Engineering》等IEEETrans.系列国际顶尖期刊以第一或通讯作者发表论文20多篇，在进化计算及机器人领域顶级国际会议发表论文60多篇，获发明专利11项，软件著作权6项，IEEE-WILEY Press出版英文专著一部。获得北京大学2007-2008年度优秀博士后奖、首届中国博士后特别资助基金，2015年入选IEEE高级会员，是国际群体与演化智能学会特邀会员和北京大学研究生群体智能暑期学校主讲教师，入选中央高校基本科研业务费专项资金资助项目基础研究人才培养计划；入选同济大学“优青”“培育”“骨干”等青年英才计划；是国家自然科学基金、教育部、中国和平利用军工技术协会、兵器联合基金、华东建筑集团的评审专家。2014年，获国家留学基金委资助，作为访问学者到美国新泽西理工学院跟随IEEEFellow周孟初教授访问一年。培养3人荣获“上海市优秀毕业研究生”称号，12人获得研究生国家奖学金，3人获得同济大学优秀博士硕士学位论文，3人获得同济大学优秀硕士生奖学金。2022-2023年度任上海市虹口区北外滩开发建设管理办公室副主任，助力北外滩数字化转型。欢迎在数学方面基础较好、动手能力强、在科学研究方面有潜力的考生报考攻读博士或硕士，特别是已有发表高水平文章、参与科研项目经历或参加过各种国内外竞赛并获奖，比如ACM系列、国家数学建模比赛等。欢迎科研基础较好的博士生来做博士后。 著作： [1]. JunQi Zhang, Mengchu Zhou, \"LearningAutomata and Their Applications to Intelligent Systems\", Wiley-IEEEPress，445 Hoes Lane，Piscataway, NJ 08854，Sarah Spurgeon, Editor in Chief，Published by John Wiley & Sons, Inc., Hoboken, New Jersey，United States，Published simultaneously in Canada，November 2023(ISBN: 978-1-394-18849-9). 已发表或已录用期刊文章 [1]. DuanWei Wu, JunQi Zhang, Mengchu Zhou, \"ABin-Packing-Based Method for Path Planning of Air-Ground CooperativeSystem\", IEEE Transactions on Vehicular Technology (IF: 6.8，车辆技术领域的国际顶级期刊，JCR一区，中科院二区Top), accepted, 2024. [2]. JunQi Zhang, YunZhe Wu,Mengchu Zhou, \"Cooperative Dual-task Path Planning for PersistentSurveillance and Emergency Handling by Multiple Unmanned Ground Vehicles\",IEEE Transactions on Intelligent Transportation Systems (IF: 8.5，智能交通领域的国际顶级期刊，JCR交通科学与技术领域一区，中科院一区Top), DOI: 10.1109/TITS.2024.3421894, 2024. [3]. Zang Di, Cui, Zhe Wang Zengqiang, LeiJuntao, Ding Yongjie, Wei Chenguang , Junqi Zhang,\"Geometric Algebra Multi-order GraphNeural Network for Traffic Prediction\",IEEE Transactions on Big Data,DOI: 10.1109/TBDATA.2024.3442533,2024. [4]. HaoTang, Cheng Wang*, Shengbo Chang, Junqi Zhang,\"Priority Over Quantity: A Self-Incentive Credit Assignment Scheme forCooperative Multi-Agent Reinforcement Learning\", IEEE Transactions on Computational Social Systems,DOI: 10.1109/TCSS.2024.3428334,2024. [5]. JunQi Zhang,YuXuan Lin, MengChu Zhou*,\"Virtual-source and Virtual-swarm-based Particle Swarm Optimizer forLarge-scale Multisource Location via Robot Swarm\", IEEE Transactions on Evolutionary Computation (IF: 14.3，JCR一区，进化计算领域的旗舰性顶尖国际期刊，JCR计算机-人工智能领域排名第一，中科院一区Top),DOI: 10.1109/TEVC.2024.3391622, 2024. [6]. JunQi Zhang*, Peng Zu, Kun Liu, MengChu Zhou*, \"AHerd-Foraging-Based Approach to Adaptive Coverage Path Planning in DualEnvironments\", IEEE Transactions on Cybernetics(IF: 11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 54, no. 3, pp. 1882-1893, 2024. [7]. JunQi Zhang, Peng Zu, PengZhan Qiu, MengChuZhou*, \"ANew Learning Automaton for Selecting an Arbitrary Subset of Actions\"，IEEE Transactions on Systems, Man, andCybernetics: Systems(IF: 8.7，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top),vol. 54, no. 1,pp. 568-577,2023. [8]. Huan Liu（博士生）, JunQiZhang*, Peng Zu, MengChu Zhou*, \"Evolutionary Algorithm-basedAttack Strategy with Swarm Robots in Denied Environments\", IEEE Transactions onEvolutionary Computation (IF: 14.3，JCR一区，进化计算领域的旗舰性顶尖国际期刊，JCR计算机-人工智能领域排名第一，中科院一区Top), vol. 27, no. 6, pp. 1562-1574, 2023.（*通讯作者） [9]. JunQi Zhang*, Huan Liu, Peng Zu, MengShi Zhao, Cheng Wang, Aiiad Albeshri, AbdullahAbusorrah, Mengchu Zhou*, \"Using Tabu Search to Avoid Concave Obstaclesfor Source Location\", IEEE Transactions on IntelligentTransportation Systems (IF: 8.5，智能交通领域的国际顶级期刊，JCR交通科学与技术领域一区，中科院一区Top), vol. 24, no. 11, pp. 11720-11732, 2023. [10]. JunQi Zhang*,YeHao Lu, YunZhe Wu, Cheng Wang, Di Zang, Abusorrah Abdullah, Mengchu Zhou*,\"PSO-Based Sparse Sources Location in Large-Scale Environments With a UAVSwarm\", IEEE Transactions on Intelligent Transportation Systems (IF: 8.5，智能交通领域的国际顶级期刊，JCR交通科学与技术领域一区，中科院一区Top), vol. 24, no. 5, pp. 5249-5258, 2023.（*通讯作者） [11]. Huan Liu, JunQi Zhang*, MengChu Zhou*, \"Adaptive Particle SwarmOptimizer Combining Hierarchical Learning with Variable Population\"，IEEE Transactions on Systems, Man, and Cybernetics: Systems(IF: 8.7，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 53, no. 3, pp. 1397-1407, 2023.（*通讯作者） [12]. JunQiZhang,PengZhan Qiu, MengChu Zhou*, \"Extension of Stochastic Point Location forMultimodal Problems\", IEEE Transactions on Cybernetics (IF:11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 53, no. 9, pp. 5403-5413, 2023. [13]. JunQi Zhang, PengZhan Qiu, ChunHui Wang, MengChu Zhou*,\"Weak Estimator-based Stochastic Searching on the Line in Dynamic DualEnvironments\", IEEE Transactions on Cybernetics (IF:11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 52, no. 7, pp. 6109-6118, 2022. [14]. JunQi Zhang, YeHao Lu, Lei Che，MengChu Zhou*,\"Moving-distance-minimized PSO for Mobile Robot Swarm\", IEEE Transactions on Cybernetics (IF: 11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 52, no. 9, pp. 9871-9881, 2022. [15]. JunQi Zhang*,XiXun Zhu, YuHeng Wang，MengChu Zhou*, \"Dual-EnvironmentalParticle Swarm Optimizer in Noisy and Noise-free Environments\",IEEE Transactions On Cybernetics (IF: 11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 49, no. 6, pp. 2011-2021, 2019. [16]. JunQi Zhang*,YuHeng Wang，Cheng Wang, MengChu Zhou*, \"FastVariable Structure Stochastic Automaton for Discovering and TrackingSpatiotemporal Event Patterns\", IEEETransactions On Cybernetics (IF:11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 48, no. 3, pp. 890-903, 2018. [17]. JunQi Zhang*, YuHeng Wang, Cheng Wang, Mengchu Zhou, \"SymmetricalHierarchical Stochastic Searching on the Line in Informative and DeceptiveEnvironments\", IEEE Transactions On Cybernetics (IF:11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top), vol. 47, no. 3, pp. 626-635, 2017. [18]. JunQi Zhang*, Liang Zhang，Cheng Wang, MengChu Zhou*, \"ApproximatelyOptimal Computing-Budget Allocation for Selection of Best and Worst Designs\", IEEE Transactions On Automatic Control (IF: 6.8，自动化与控制系统领域的国际顶级期刊，JCR自动化-控制系统一区，中科院二区Top), vol. 62, no. 7, pp. 3249-3261, 2017. [19]. JunQi Zhang*, ZeZhou Li, Cheng Wang, Di Zang, Mengchu Zhou, \"Approximate Simulation Budget Allocation for Subset Ranking\", IEEE Transactions on Control Systems Technology(IF: 4.8，JCR自动化-控制系统二区，中科院二区), vol. 25, no. 1, pp. 358-365, 2017. [20]. Xin Wang, Cheng Wang, JunQi Zhang,Mengchu Zhou, ChangJun Jiang, \"Improved Rule Installation for Real-time Query Service in Software-DefinedInternet of Vehicles\", IEEE Transactions on IntelligentTransportation Systems (IF: 8.5，智能交通领域的国际顶级期刊，JCR交通科学与技术领域一区，中科院一区Top),vol. 18, no. 2,pp. 225-235, 2017. [21]. JunQi Zhang*, Cheng Wang, DiZang, MengChu Zhou*, \"Incorporationof Optimal Computing Budget Allocation for Ordinal Optimization into LearningAutomata\", IEEE Transactions on Automation Scienceand Engineering (IF: 5.6，自动化与控制系统领域的国际顶级期刊，JCR自动化-控制系统二区，中科院一区Top), vol. 13, no. 2, pp. 1008-1017, 2016. [22]. JunQi Zhang, Cheng Wang, Mengchu Zhou*, \"Fast and Epsilon-optimal DiscretizedPursuit Learning Automata\", IEEE Transactions on Cybernetics (1区，IF: 19.118，自动化与控制系统领域的国际顶级期刊，JCR自动化-控制系统二区，中科院一区Top),vol. 45, no. 10,pp. 2089-2099, 2015. [23]. Jie Li（博士生）, JunQi Zhang*,ChangJun Jiang*,Mengchu Zhou, \"Composite Particle Swarm Optimizer with Historical Memoryfor Function Optimization\", IEEE Transactions on Cybernetics (1区，IF: 19.118，自动化与控制系统领域的国际顶级期刊，JCR自动化-控制系统二区，中科院一区Top),vol. 45, no. 10,pp. 2350-2363, 2015(SCI, EI), (通讯作者). [24]. JunQi Zhang, Cheng Wang, MengChu Zhou*, \"Last-positionElimination-based Learning Automata\", IEEETransactions On Cybernetics (IF:11.8，计算机：控制论领域的国际顶级期刊，JCR计算机-控制论领域一区，中科院一区Top),vol. 44, no. 12,pp. 2484-2492, 2014. 科研项目 1. 国家自然科学基金委员会, 面上项目, 62472313, 极端环境下群体机器人的自主协同搜索算法研究, 2025-01至2028-12, 50万元,主持 2. 上海市教育委员会，科研创新计划自然科学重大项目，202101070007E00098，双环境下群体智能学习与优化方法研究，2021-01至2025-12, 300万元，在研, 主持 3. 同济大学学科交叉联合攻关项目，无人系统集群博弈对抗的进化计算方法，2022年6月1日-2023年11月30日，20万元, 在研,主持 4. 国家自然科学基金委员会, 面上项目, 61572359, 噪声环境下粒子群的个体学习与群体智能, 2016-01至2019-12, 79.2万元, 已结题,主持 5. 国家自然科学基金委员会, 面上项目, 61272271, 变结构学习自动机的自适应与协同优化算法, 2013-01至2016-12, 81万元, 已结题, 主持 6. 国家自然科学基金委员会, 青年项目, 60803065, 过程神经网络的智能学习算法研究, 2009-01至2011-12,20万元, 已结题, 主持 7. 上海市自然科学基金, 面上项目, 12ZR1434000, 基于粒子群与学习自动机的智能优化算法研究, 2012-07至2015-06,10万元, 已结题, 主持 8. 中国博士后科学基金会, 特别资助基金, 200801029, 粒子群优化算法智能搜索策略的理论研究与应用, 2008-01至2009-12,10万元, 已结题, 主持 9. 中央高校基本科研业务费专项资金青年教学科研骨干计划（英才类），不确定环境下的群体智能优化算法研究，2016年-2017年, 已结题, 主持 10. 中央高校基本科研业务费专项资金基础研究人才培养计划，大规模复杂网络软件的演化与协同，0800219201，2012年-2013年, 已结题, 主持 11. 中国博士后基金，基于历史信息与数据分析的群体计算方法研究，2007年-2008年,3万元, 已结题, 主持 12. 同济大学青年优秀人才培养行动计划基金，粒子群方法研究及其在服务组合与脑电检测中的应用， 2010年-2011年（考核结果为优秀）。 项目情况简介 1. 国家自然科学基金委员会, 面上项目, 62472313, 极端环境下群体机器人的自主协同搜索算法研究, 2025-01至2028-12, 50万元,主持 机器人群体智能是新一代人工智能和十四五规划的攻关方向。群体机器人因数量不足，在深海等极端环境下，其搜索更加困难甚至失败。本项目凝练提出“少量机器人群智涌现”和“极端环境下探测协同”两个关键科学问题。针对机器人数量不足，突破传统方法中将实体机器人与仿生群体智能算法中的虚拟个体一一对应绑定为单群的固化模式，提出少量机器人映射大量虚拟个体的实虚双群自主协同搜索方法，先利用虚群演化勘探位置，再用实群规划路径对其高效评估以反演虚群，双群交替迭代，达到传统方法中大量机器人才有的自主协同水平。在此基础上，针对极端环境约束，建立全局网格化实虚双群搜索方法以避免遗漏稀疏目标，探索机群在复杂未知地形中的被困区域识别与自主脱离方法，提出基于位置探测的机群协同方法以突破传统方法中的通信依赖。构建实体系统验证，为群体机器人的搜救勘探等繁重危险任务提供“规模易伸缩、被困可脱离、目标速定位、搜索无遗漏”的新型群体智能！ 2.上海市教育委员会，科研创新计划自然科学重大项目，202101070007E00098，双环境下群体智能学习与优化方法研究，2021-01至2025-12, 300万元，在研, 主持 群体智能优化方法从抗噪角度分为两类，一类是不考虑环境中的噪声，性能随噪声出现急剧下降；另一类通过大量重采样精化适应值，但实际中噪声的有无不仅未知且动态变化，重采样量无法预定。本项目面向噪声或有或无的双环境，围绕群体智能的自适应排序与选择问题开展研究，重点研究解决双环境下群体智能学习与优化方法和多智能体协同、搜索与博弈对抗等关键理论和技术问题，突破传统群体智能优化方法仅适用于单一环境且自适应能力差的限制，实现在双环境下能无需重采样、无需人工干预、搜索精细、自适应抗噪能力强的高效群体智能鲁棒优化方法，形成双环境下基于学习自动机的群体智能学习理论和基于精英子群与群体决策的新型群体智能技术体系。构建双环境高维多模态标准函数库，研发双环境群体智能优化软件。完成双环境下钢铁生产制造业节能优化，多智能体协同的编队行驶与避障、目标定位与协同跟踪、目标的广域与细化搜索，无人机与无人车多智能体集群的博弈对抗3个典型任务中应用示范，研究成果达到国际领先水平，为钢铁行业实现节能提效的绿色可持续发展做出更大贡献，为未来智能化战争创建动态、协调和高度自治的群体智能致胜基石，推动新一代人工智能基础理论和应用发展。 3. 同济大学学科交叉联合攻关项目，无人系统集群博弈对抗的进化计算方法，2022年6月1日-2023年11月30日，20万元, 在研,主持 无人系统集群博弈对抗为目前国家重大需求和国际科技前沿，其群体智能水平决定了无人系统集群在实际场景中的应用效能。深度强化学习是无人系统集群博弈对抗的主流方法，却因需要大量离线预训练与真实环境通信限制，存在环境依赖强、集群规模扩大难与变化态势认知慢等问题。因此，本项目通过将离线预训练问题转化为在线优化与学习问题，提炼变化态势实时认知与对抗决策在线推演两大关键科学问题，基于生物集群和无人集群的相似性与相容性，结合仿生群体智能自适应优化与基于认知结构的规则方法，提出拒止环境下以占位时效与对抗奖励为目标的群智适应度函数构建方法和基于虚拟种群在线演化最优占位的对抗决策机制，突破无人系统集群博弈对抗需要大量预训练的技术瓶颈，形成无需预训练、仅需简单规则即可自主涌现环境自适应群智行为的无人系统集群在线推演与学习方法，与深度强化学习方法形成优势互补。 团队展示 已毕业学生流向为国内外高校、研究机构、一线公司等，特别是2023年度博士毕业学生，直接被上海高校录用为有编制教师，博士毕业即能成为高校教师表明本实验室的科研水平与所培养学生的社会认可度。 上海市计算机学会优秀硕士学位论文：1人 卢烨昊（硕士，2023）、 同济大学优秀博士硕士学位论文：3人 刘欢（博士，2023）、卢烨昊（硕士，2023）、仇鹏展（硕士，2022）。 上海市优秀毕业研究生：3人 王宇恒，张亮，李泽州 研究生国家级奖学金：13人次 吴韵哲（2024），祖鹏（2022），刘欢（2022，2023），卢烨昊（2021，2022，2023），朱希迅，王宇恒（2次），张亮，徐林薇，李泽州，马季 同济大学优秀硕士生奖学金：3人 仇鹏展，朱善文，朱熊 陈建清： 同济大学硕士社会活动奖学金，2019 年11 月 同济大学研究生太原奖学金，2020 年11 月 2015级 王宇恒：2016年度研究生国家奖学金；2017年度研究生国家奖学金； 朱善文：2016年同济大学优秀硕士生奖学金 2014级 徐林薇：2015年度研究生国家奖学金；德国巴登符腾堡州州立奖学金；IEEE CEC会议Runner-Up Overall Paper Award奖；同济大学2015-16冬季学期赴德语地区高校（卡尔斯鲁厄理工学院KIT）交流项目； 张亮：2015年度研究生国家奖学金；上海市优秀毕业研究生；科磊企业奖学金；全国研究生数学建模竞赛二等奖 陆思宇： 2013级 李泽州：2014年度研究生国家奖学金；上海市优秀毕业研究生；新奥新能源奖学金 马季：2014年度研究生国家奖学金； 朱熊：2014年同济大学优秀硕士生奖学金"
  },
  {
    "title": "张林",
    "relative_url": "../info/1061/2726.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2726.htm",
    "html_content": "张林 博士教授，教育部青年长江学者，上海市曙光学者Website: https://cslinzhang.github.io/home/Google Scholar: https://scholar.google.com/citations?user=8VOk_S4AAAAJ&hl=en 主讲课程 研究方向计算机视觉 机器视觉机器学习 环境感知与理解 导师简介 他曾于2003年和2006年在上海交通大学计算机科学与技术系分别获得学士和硕士学位。之后曾先后在Microsoft和Autodesk公司工作。2008年3月至香港理工大学攻读博士学位，导师为张磊教授（IEEE Fellow、Chair Professor）。2011年8月博士毕业后进入同济大学工作。主要研究兴趣为机器视觉与图像理解。他以第一或通信作者身份已在IJCV、IEEE T-PAMI、IEEE T-IP、IEEE T-MM、IEEE T-CSVT、IEEE T-IV、Pattern Recognition等期刊上发表论文40余篇，在CVPR、AAAI、ACM MM等顶级国际会议上发表论文40余篇。根据Google Scholar统计，截至目前，其所发表论文总的被引用次数为15000+次；其中，4篇论文入选ESI Highly Cited Papers。 他目前是IEEE高级会员、中国计算机学会（CCF）杰出会员、中国计算机学会（CCF）计算机视觉专业委员会委员、中国图象图形学学会机器视觉专业委员会委员、中国自动化学会混合智能专业委员会委员、视觉与学习青年研讨会（VALSE）资深领域主席（Senior Area Chair）。目前是国际期刊IEEE Robotics and Automation Letters、Journal of Visual Communication and Image Representation编委（Associate Editor）。2020-2023连续四个年度入选Elsevier（爱思唯尔）中国高被引学者，入选2022年、2023年全球顶尖前10万名科学家（计算机科学与技术），入选2023年、2024年全球前2%顶尖科学家榜单。获2019年全国软件工程教学案例比赛一等奖（排名1），2020年上海市科技进步一等奖（排名2），2022年教育部技术发明一等奖（排名2），2022年上海市高等教育优秀教学成果二等奖（排名3），2023年全国计算机类课程实验教学案例设计竞赛一等奖（排名1）。他于2013年入选上海市浦江人才计划，2020年入选教育部长江学者奖励计划青年学者，2021年入选上海市曙光计划，2023年入选高校计算机专业优秀教师奖励计划。2024年1月，所主讲的课程《计算机视觉》入选上海高校市级一流本科课程。 在理论与技术方面的主要贡献包括： 1. 提出了神经强度场声音表达模型“傅里叶-KAN神经网络”（AAAI 2025）； 2. 提出了LiDAR-视觉-惯导连续时间里程计与建图模型（IEEE T-CSVT 2024）； 3. 提出了面向“LiDAR-惯导”里程计与建图任务的紧耦合直接法（IEEE T-MM 2023）； 4. 提出了面向多智能体视惯SLAM的协同定位与稠密建图框架（IEEE T-IP 2022）； 5. 根据大气成像学物理知识，提出了霭、均匀雾、异质雾、自然霾、工业霾、沙尘暴现象的物理成像计算模型，并给出它们的计算机仿真管线（IEEE T-IP 2021）; 6. 提出面向单张图像去雾问题的弱监督学习框架（IEEE T-IP 2021）; 7. 提出了联合优化相机系统位姿的环视系统标定方法和环视相机系统位姿在线动态补偿模型 (ACM MM 2019、ACM MM 2021、IEEE T-MM 2023)； 8. 提出并建立了融合前视自然特征、环视语义特征、惯导数据的紧耦合SLAM系统（ACM MM 2020、IEEE T-CSVT 2022）; 9. 建立了雾霾图像与对应的清晰图像均来自真实场景的去雾霾算法度量图像数据集，提出了基于能见度与真实度两个维度的去雾霾算法性能评测准则（IEEE T-IP 2020）； 10. 提出了基于自适应无监督学习的病态图像复原算法（ACM MM 2019、ACM MM 2022）； 11. 提出了基于机器学习理论的泊车位检测与定位算法，并建立了标准数据集（IEEE T-IP 2018）； 12. 提出了面向生物特征识别问题的图像快速分类算法，首次提出了基于指关节纹图像的身份鉴别概念，系统研究了非接触式掌纹识别技术、移动掌纹识别技术，设计制造了原型样机并建立了大规模公开数据集 (IEEE T-PAMI 2015、IEEE T-MM 2016、PR 2010、PR 2011、PR 2012、PR 2017、IEEE T-MM 2020)； 13. 提出了基于自然场景统计模型特征的无参考图像质量评价模型IL-NIQE (IEEE T-IP 2015)； 14. 提出了全参考图像质量评价模型FSIM和VSI （IEEE T-IP 2011、IEEE T-IP 2014）。 学术活动 1. IEEE Robotics and Automation Letters编委（Associate Editor） 2. Journal of Visual Communication and Image Representation编委（Associate Editor） 3. IEEE Senior Member 4. 中国计算机学会（CCF）杰出会员 5. 中国计算机学会（CCF）计算机视觉专业委员会委员 6. 中国图象图形学学会机器视觉专业委员会委员 7. 中国自动化学会混合智能专业委员会委员 8. 中国计算机学会传播大使 9. 视觉与学习青年研讨会（VALSE）资深领域主席（Senior Area Chair） 代表性论文 代表性期刊论文（中科院一区） 1. Tianjun Zhang, Lin Zhang*, Fengyi Zhang, Shengjie Zhao, and Yicong Zhou \"I-DACS: Always Maintaining Consistency between Poses and the Field for Radiance Field Construction without Pose Prior,\" IEEE Transactions on Circuits and Systems for Video Technology, vol. 35, no. 3, pp: 2646-2661, 2025. 2. Yang Chen, Lin Zhang*, Shengjie Zhao, and Yicong Zhou \"Online Indoor Visual Odometry with Semantic Assistance under Implicit Epipolar Constraints,\" Pattern Recognition, vol. 159, pp: 111150 (1-10), 2025. 3. Zhong Wang, Lin Zhang*, Shengjie Zhao, and Yicong Zhou, \"Global Localization in Large-scale Point Clouds via Roll-pitch-yaw Invariant Place Recognition and Low-overlap Global Registration\", IEEE Trans. Circuits and Systems for Video Technology, vol. 34, no. 5, pp. 3846-3859, 2024. 4. Zhong Wang, Lin Zhang*, Shengjie Zhao, and Yicong Zhou, \"Ct-LVI: A Framework Toward Continuous-time Laser-Visual-Inertial Odometry and Mapping\", IEEE Trans. Circuits and Systems for Video Technology, vol. 34, no. 6, pp. 4378-4391, 2024. 5. Jiafeng Huang, Shengjie Zhao, Tianjun Zhang, and Lin Zhang*, \"MC-VEO: A Visual-Event Odometry with Accurate 6-DoF Motion Compensation,\" IEEE Transactions on Intelligent Vehicles, vol. 9, no. 1, pp. 1756-1767, 2024. 6. Zhong Wang, Lin Zhang*, Ying Shen, and Yicong Zhou, \"D-LIOM: Tightly-coupled direct LiDAR-inertial odometry and mapping,\" IEEE Trans. Multimedia, vol. 25, pp. 3905-3920, 2023. 7. Yang Chen, Lin Zhang*, Ying Shen, Brian Nlong Zhao, and Yicong Zhou, \"Extrinsic self-calibration of the surround-view system: A weakly supervised approach,\" IEEE Trans. Multimedia, vol. 25, pp. 1622-1635, June 2023. 8. Tianjun Zhang, Lin Zhang*, Yang Chen, and Yicong Zhou, \"CVIDS: A collaborative localization and dense mapping framework for multi-agent based visual-inertial SLAM,\" IEEE Trans. Image Processing, vol. 31, pp. 6562-6576, 2022. (CCF-A) 9. Xuan Shao, Lin Zhang*, Tianjun Zhang, Ying Shen, and Yicong Zhou, \"MOFISSLAM: A multi-object semantic SLAM system with front-view, inertial and surround-view sensors for indoor parking\", IEEE Trans. Circuits and Systems for Video Technology, vol. 32, no. 7, pp. 4788-4803, 2022. 10. Lin Zhang, Anqi Zhu, Shiyu Zhao, and Yicong Zhou, \"Simulation of Atmospheric Visibility Impairment\", IEEE Trans. Image Processing, vol. 30, pp. 8713-8726, 2021. (CCF-A) 11. Shiyu Zhao, Lin Zhang*, Ying Shen, and Yicong Zhou, \"RefineDNet: A Weakly Supervised Refinement Framework for Single Image Dehazing\", IEEE Trans. Image Processing, vol. 30, pp. 3391-3404, 2021. (CCF-A) 12. Shiyu Zhao, Lin Zhang*, Shuaiyi Huang, Ying Shen, and Shengjie Zhao, \"Dehazing evaluation: Real-world benchmark datasets, criteria and baselines\", IEEE Trans. Image Processing, vol. 29, pp. 6947-6962, 2020. (CCF-A) 13. Lin Zhang, Junhao Huang, Xiyuan Li, and Lu Xiong, \"Vision-based parking-slot detection: A DCNN-based approach and a large-scale benchmark dataset\", IEEE Trans. Image Processing, vol. 27, no. 11, pp. 5350-5364, 2018. (CCF-A) 14. Lin Zhang, Lida Li, Anqi Yang, Ying Shen, and Meng Yang, \"Towards contactless palmprint Recognition: A novel device, a new benchmark, and a collaborative representation based identification approach\", Pattern Recognition, vol. 69, pp. 199-212, 2017 15. Lin Zhang, Lida Li, Hongyu Li, and Meng Yang, \"3D ear identification using block-wise statistics based features and LC-KSVD\", IEEE Trans. Multimedia, vol. 18, no. 8, pp. 1531-1541, 2016. 16. Lin Zhang, Ying Shen, Hongyu Li, and Jianwei Lu, \"3D palmprint identification using block-wise features and collaborative representation\", IEEE Trans. Pattern Analysis and Machine Intelligence, vol. 37, no. 8, pp. 1730-1736, 2015. (CCF-A) 17. Lin Zhang, Lei Zhang, and Alan C. Bovik, \"A feature-enriched completely blind image quality evaluator\", IEEE Trans. Image Processing, vol. 24, no. 8, pp. 2579-2591, 2015. (CCF-A) 18. Lin Zhang, Ying Shen, and Hongyu Li, \"VSI: A visual saliency induced index for perceptual image quality assessment\", IEEE Trans. Image Processing, vol. 23, no. 10, pp. 4270-4281, 2014. (CCF-A) 19. Lin Zhang, Lei Zhang, David Zhang, and Zhenhua Guo, \"Phase congruency induced local features for finger-knuckle-print recognition\", Pattern Recognition, vol. 45, no. 7, pp. 2522-2531, 2012. 20. Lin Zhang, Lei Zhang, Xuanqin Mou, and David Zhang, \"FSIM: a feature similarity index for image quality assessment\", IEEE Trans. Image Processing, vol. 20, no. 8, pp. 2378-2386, 2011. (CCF-A) 21. Lin Zhang, Lei Zhang, David Zhang, and Hailong Zhu, \"Ensemble of local and global information for finger-knuckle-print recognition\", Pattern Recognition, vol. 44, no. 9, pp. 1990-1998, 2011. 22. Lin Zhang, Lei Zhang, David Zhang, and Hailong Zhu, \"Online finger-knuckle-print verification for personal authentication\", Pattern Recognition, vol. 43, no. 7, pp. 2560-2571, 2010. 代表性会议论文（CCF-A会议） 1. Zhanbo Shi, Lin Zhang*, Linfei Li and Ying Shen, Towards Audio-Visual Navigation in Noisy Environments: A Large-Scale Benchmark Dataset and an Architecture Considering Multiple Sound-Sources, in: Proc. AAAI, 2025. 2. Linfei Li, Lin Zhang*, Zhong Wang, Fengyi Zhang, Zelin Li and Ying Shen, Representing Sounds as Neural Amplitude Fields: A Benchmark of Coordinate-MLPs and A Fourier Kolmogorov-Arnold Framework, in: Proc. AAAI, 2025. 3. Linfei Li, Lin Zhang*, Zhong Wang, and Ying Shen, GS3LAM: Gaussian semantic splatting SLAM, in: Proc. ACM Int'l Conf. Multimedia, pp: 3019-3027, 2024. 4. Zhong Wang, Lin Zhang*, Ying Shen and Yicong Zhou, LVI-ExC: A target-free LiDAR-Visual-Inertial extrinsic calibration framework, in: Proc. ACM Int'l Conf. Multimedia, pp. 3319-3327, 2022. 5. Fengyi Zhang, Hui Zeng, Tianjun Zhang, and Lin Zhang*, CLUT-Net: Learning adaptive compressed representations of 3DLUTs for lightweight image enhancement, in: Proc. ACM Int'l Conf. Multimedia, pp. 6493-6501, 2022. 6. Yang Yang, Chaoyue Wang, Risheng Liu, Lin Zhang, Xiaojie Guo, and Dacheng Tao, Self-augmented unpaired image dehazing via density and depth decomposition, in: Proc. IEEE Conf. Computer Vision and Pattern Recognition, pp. 2037-2046, 2022. 7. Tianjun Zhang, Nlong Zhao, Ying Shen, Xuan Shao, Lin Zhang*, and Yicong Zhou, \"ROECS: A Robust Semi-direct Pipeline Towards Online Extrinsics Correction of the Surround-view System\", in Proc. ACM Int'l Conf. Multimedia, pp. 3153-3161, 2021. 8. Xuan Shao, Lin Zhang*, Tianjun Zhang, Ying Shen, Hongyu Li, and Yicong Zhou, \"A Tightly-coupled Semantic SLAM System with Visual, Inertial and Surround-view Sensors for Autonomous Indoor Parking\", in Proc. ACM Int'l Conf. Multimedia, pp. 2691–2699, 2020. 9. Lin Zhang, Lijun Zhang, Xiao Liu, Ying Shen, Shaoming Zhang, and Shengjie Zhao, \"Zero-Shot Restoration of Back-lit Images Using Deep Internal Learning\", in Proc. ACM Int'l Conf. Multimedia, pp. 1623-1631, 2019. 10. Xiao Liu, Lin Zhang*, Ying Shen, Shaoming Zhang, and Shengjie Zhao, \"Online Camera Pose Optimization for the Surround-view System\", in Proc. ACM Int'l Conf. Multimedia, pp. 383-391, 2019. 重要科研项目 1. 国家自然科学基金面上项目“面向室内环境自主泊车任务的定位与建图关键技术研究”（62272343），2023.01~2026.12，主持人 2. 教育部高等学校科学研究发展中心中国高校产学研创新基金“异构传感器配置无人机集群系统的协同感知技术”（2021ZYA08003），2022.7~2023.12，主持人， 3. 上海市教育委员会曙光计划项目“紧耦合多源传感器语义建图关键技术研究”（ 21SG23），2021.10~2024.10 4. 同济大学学科交叉联合攻关首批示范重点项目“面向韧性城市智能规划的多智能体动态监测、虚拟建模及模拟推演”，2021.08~2022.07，主持人 5. 国家重点研发计划重点专项\"物联网与智慧城市关键技术及示范\"课题\"城市韧性的在线跨尺度虚实融合模拟/预测/推演技术\"(2020YFB2103903），2020.10~2023.9，主持人 6. 上海市“科技创新行动计划”港澳台科技合作项目（20510760400），2020.10~2023.9，主持人 7. 国家自然科学基金面上项目“基于视觉的泊车位检测技术中关键问题的研究”（61973235），2020.01~2023.12，主持人 8. 国家自然科学基金重点项目“面向海洋鱼类识别的视觉数据智能分析理论与关键技术”（61936014），2020.01~2024.12，课题主持人 9. 腾讯科技（上海）有限公司项目“面向智能手机的掌纹识别算法与系统”, 2019.10~2020.06, 主持人 10. 华为技术有限公司项目“环视泊车位检测系统及其关键技术研究”, 2019.04~2020.04, 主持人 11. 2017中央高校基本科研业务费-学科交叉类项目“面向无人驾驶平台的视觉感知”，2017.09~2019.08，主持人 12. 上海汽车工业科技发展基金会项目“基于深度神经网络的泊车位识别与人车识别”，2017.10~2018.12，主持人 13. 上海市科学技术委员会高新技术领域项目，面向“最后一公里”的智能驾驶关键理论及应用（17DZ1100202.），2017.07~2019.06，二级课题主持人 14. 国家自然科学基金面上项目“基于深度神经网络的图像中雾霾的度量与去除”（61672380），2017.01~2020.12，主持人 15. 中兴通讯产学研合作项目“面向手机Camera的图像质量评测研究”，2016.09~2017.12，主持人 16. 上海市经济和信息化委员会产学研合作项目“智能化裂隙灯显微镜及图像处理系统”（沪CXY-2014-016），2014.06~2016.06，主持人 17. CCF-腾讯犀牛鸟科研基金项目“基于智能手机和云计算平台的多生物特征融合”（CCF-Tencent RAGR20150112），2015.10～2016.10，主持人 18. 上海市浦江人才计划项目\"非接触式掌纹掌脉识别系统的研究与开发\"（13PJ1408700），2013.09.01~2015.08.01，主持人 19. 国家自然科学基金青年科学基金项目“基于视觉显著性和稀疏表示的图像质量评价”（61201394），2013.01～2015.12，主持人 荣誉与获奖 1. 2025年1月，“跨学科融合与产教协同：引领 AI 赋能软件工程专业示范性人才培养新模式”获同济大学教学成果一等奖（排名第二，共10人），同济大学 2. 2025年1月，“需求引领，学科交融，育才创新：学科交叉推动软件工程研究生培养模式创新”获同济大学教学成果二等奖（排名第二，共10人），同济大学 3. 2024年10月，入选全球前2%顶尖科学家榜单2024（World’s Top 2% Scientists 2024），斯坦福大学 4. 2024年3月，2023年度Elsevier（爱思唯尔）中国高被引学者 5. 2024年1月，入选2023年度全球顶尖前10万名科学家（计算机科学与技术） 6. 2024年1月，所主讲的《计算机视觉》入选上海高校市级一流本科课程，上海市教育委员会 7. 2023年12月，入选高校计算机专业优秀教师奖励计划，教育部高等学校计算机类专业教学指导委员会，中国教师发展基金会 8. 2023年11月，“单目目标检测与测距”获第八届全国计算机类课程实验教学案例设计竞赛一等奖，国家级实验教学示范中心联席会，中国计算机实践教育联合会 9. 2023年10月，所主讲的《计算机视觉》入选上海高校市级重点课程，上海市教育委员会 10. 2023年10月，入选全球前2%顶尖科学家榜单2023（World’s Top 2% Scientists 2023），斯坦福大学 11. 2023年4月，2022年度Elsevier（爱思唯尔）中国高被引学者 12. 2022年，高等学校科学研究优秀成果奖（科学技术）技术发明一等奖（排名2），获奖项目“城市空间信息全域物联感知与三维建模关键技术及应用”，中华人民共和国教育部 13. 2022年，上海市高等教育优秀教学成果二等奖（排名3），获奖项目“筑基建魂，二十年砥砺求索，新时代一流软件工程人才培养体系的构建与实践”，上海市教育委员会 14. 2022年，Journal of Visual Communication and Image Representation最佳编委（Best Editor Award） 15. 2021年，Elsevier（爱思唯尔）中国高被引学者 16. 2021年，上海市曙光计划，上海市教育委员会 17. 2020年，教育部“长江学者奖励计划”青年学者，中华人民共和国教育部 18. 2020年，上海市科技进步一等奖（排名2），获奖项目“面向应急抢险与事故处理的数据高效传输与智能分析关键技术与应用”，上海市人民政府 19. 2020年，Elsevier（爱思唯尔）中国高被引学者 20. 2020年6月，“深化教学改革与创新，建设一流的软件工程专业基础和数字媒体课程群”获同济大学教学成果特等奖（排名第三，共14人），同济大学 21. 2019年12月，首届芯创杯高校未来汽车人机交互设计大赛优秀指导教师，中国电子信息产业发展研究院 22. 2019年11月，“CV之旅：环视系统构建及基于环视的泊车位检测”获第十八届全国软件与应用学术会议（NASAC2019）全国软件工程教学案例比赛一等奖（排名第一），中国计算机学会软件工程专业委员会、系统软件专业委员会 23. 2019年10月，同济大学育才教育奖励金二等奖优秀教师，同济大学 24. 2018年5月，“面向计算机视觉课程的综合实验平台”获同济大学校级教学成果三等奖 (排名第一)，同济大学 25. 2017年9月，同济大学师德师风优秀教师提名奖，同济大学 26. 2013年7月，上海市浦江人才计划，上海市科学技术委员会 27. 2013年6月，同济大学青年岗位能手，同济大学 28. 2012年11月，同济大学铭创教育基金优秀教师奖，同济大学 29. Oct. 2013, Best Paper Award (Honorable Mention) for the paper \"Lin Zhang et al., Online finger-knuckle-print verification for personal authentication, Pattern Recognition 43 (7) 2560-2571, 2010\" in the journal Pattern Recognition 30. Oct. 2010, Silver Medal in the iENA (International Trade Fair for Ideas-Inventions-New Products) exhibition held at Nuremberg Germany for our system \"Digital Image/ Video Quality Enhancement\" 31. Apr. 2010, The Most Promising Researcher, Dept. Computing, The Hong Kong Polytechnic University 32. Mar. 2008~Feb. 2011, Edward Sai Kim Hotung Scholarship, The Hong Kong Polytechnic University 33. 2003年06月，优秀毕业论文，上海交通大学 34. 2002年10月，第二轮选优考优秀生，上海交通大学 部分代表性优秀研究生 1. 2020级博士生（在读）， 陈阳，优秀博士奖学金，同济大学优秀博士研究生 2. 2025届博士毕业生（入职上海交通大学自动化系博士后），张天骏，光华奖学金，博士研究生国家奖学金，同济大学优秀博士研究生 3. 2024届博士毕业生（入职上海交通大学自动化系博士后），王忠，联合电子奖学金，中交二公院志业精英奖学金，优秀博士奖学金， 4. 2024届硕士毕业生，张峰溢，硕士研究生国家奖学金 5. 2023届硕士研究生，郭超政，2020年奥比中光“3D视觉创新应用（三维重建）竞赛”二等奖 6. 2022届硕士毕业生，陈钧涛，博世奖学金，上海市“明日科技之星”科创竞赛特等奖（排名2） 7. 2022届硕士毕业生，朱安琪，2020年度、2021年度二度硕士研究生国家奖学金，上海市“明日科技之星”科创竞赛特等奖（排名1），同济大学优秀研究生，上海市优秀毕业研究生 8. 2022届博士毕业生 （入职东华大学），邵玄，博士研究生国家奖学金，博世奖学金，优秀博士奖学金，同济大学优秀博士研究生，上海市科委扬帆计划 9. 2021届硕士毕业生，张映艺，硕士研究生国家奖学金，同济大学优秀毕业研究生 10. 2020届硕士毕业生，黄君豪，硕士研究生国家奖学金，上海市优秀毕业研究生，同济大学优秀硕士毕业论文 11. 2020届硕士毕业生，赵世雨，硕士研究生国家奖学金，上海市优秀毕业研究生，同济大学优秀硕士毕业论文 12. 2020届硕士毕业生，朱西宁，华特奖学金，同济大学优秀硕士毕业论文 13. 2019届硕士毕业生，李曦媛，硕士研究生国家奖学金，上海市优秀毕业研究生，同济大学优秀硕士毕业论文 14. 2019届硕士毕业生，张荔郡，硕士研究生国家奖学金，上海市优秀毕业研究生，同济大学优秀硕士毕业论文 15. 2019届硕士毕业生，朱雅梅，同济大学校级研究生优秀奖学金 16. 2019届硕士毕业生，程载熙，华为奖学金 17. 2018届硕士毕业生，李林申，硕士研究生国家奖学金 18. 2016届硕士毕业生，梁青君，光华奖学金 19. 2016届硕士毕业生，李力达，硕士研究生国家奖学金，上海市优秀毕业研究生 20. 2015届硕士毕业生，顾中一，硕士研究生国家奖学金 21. 2015届硕士毕业生，丁志轩，硕士研究生国家奖学金，同济大学学术先锋"
  },
  {
    "title": "张苗苗",
    "relative_url": "../info/1061/2727.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2727.htm",
    "html_content": "张苗苗 ZHANG MIAO MIAO 博导、研究员电子邮件: miaomiao@tongji.edu.cn 主讲课程：实时系统软件工程形式化方法 研究方向： 智能系统的模型学习和验证 强化学习 人机物联网系统的软件定义 可信人工智能 欢迎对模型算法、机器和模型学习以及智能系统验证等方面感兴趣的同学报考本实验室！ 部分科研项目简介 国家自然基金重点项目\"人机物三元融合场景的泛在计算抽象和软件定义方法”子课题负责人 2021-2025 国家自然科学基金项目“时间系统的模型学习”2020/1-2023/12，第一负责人 国家自然科学基金项目“扩展的线性时段不变式的模型检验”（No.61472279）2015/1-2018/12，第一负责人 国家自然科学基金项目“基于构件的异构嵌入式系统的模型驱动设计”（No.61073022）2011/1-2013/12，第一负责人 国家自然科学基金项目“基于概率时间自动机的概率时段演算的模型检验及应用研究”（No.60603037）2007/1-2009/12，第一负责人 教育部留学回国人员科研启动基金 部分论文简介 Jie An, Lingtai Wang, Bohua Zhan, Naijun Zhan, Miaomiao Zhang: Learning real-time automata. Sci. China Inf. Sci. 64(9) (2021) Xiangyu Jin, Jie An, Bohua Zhan, Naijun Zhan, Miaomiao Zhang: Inferring Switched Nonlinear Dynamical Systems. Formal Aspects Comput. 33(3): 385-406 (2021) Jie An, Bohua Zhan, Naijun Zhan, Miaomiao Zhang: Learning Nondeterministic Real-Time Automata. ACM Trans. Embed. Comput. Syst. 20(5s): 99:1-99:26 (2021) Jian Wang, Jie An, Mingshuai Chen, Naijun Zhan, Lulin Wang, Miaomiao Zhang, Ting Gan: From model to implementation: a network algorithm programming language. Sci. China Inf. Sci. 63(7) (2020) Bai Xue, Miaomiao Zhang, Arvind Easwaran, Qin Li: PAC Model Checking of Black-Box Continuous-Time Dynamical Systems. IEEE Trans. Comput. Aided Des. Integr. Circuits Syst. 39(11): 3944-3955 (2020) Wei Shen, Jie An, Bohua Zhan, Miaomiao Zhang, Bai Xue, Naijun Zhan: PAC Learning of Deterministic One-Clock Timed Automata. ICFEM 2020: 129-146 Jin Xu, Zishan Li, Bowen Du, Miaomiao Zhang, Jing Liu:Reluplex made more practical: Leaky ReLU. ISCC 2020: 1-7 Jie An, Mingshuai Chen, Bohua Zhan, Naijun Zhan, Miaomiao Zhang: Learning One-Clock Timed Automata. TACAS (1) 2020: 444-462 Jie An, Lintai Wang, Bohua Zhang, Naijun Zhan and Miaomiao Zhang. Learning real-time automata. accepted by SCIENCE CHINA Information Sciences Yilong Yang, Quan Zu, Wei Ke, Miaomiao Zhang, Xiaoshan Li: Real-Time System Modeling and Verification Through Labeled Transition System Analyzer. IEEE Access 7: 26314-26323 (2019) Xiaoxue Hou, Jie An, Miaomiao Zhang, Bowen Du, Jing Liu: High-Speed Rail Operating Environment Recognition Based on Neural Network and Adversarial Training. ICTAI 2019: 840-847 Jie Liu, Jing Liu, Miaomiao Zhang, Haiying Sun, Xiaohong Chen, Dehui Du, Mingsong Chen: A proof-based method of hybrid systems development using differential invariants. Frontiers Comput. Sci. 12(5): 1026-1028 (2018) Jie An, Naijun Zhan, Xiaoshan Li, Miaomiao Zhang, Wang Yi: Model Checking Bounded Continuous-time Extended Linear Duration Invariants. HSCC 2018: 81-90 Quan Zu, Miaomiao Zhang, Bin Yu: Fast Dynamic Weight Matchings in Convex Bipartite Graphs. MFCS (2) 2015: 601-612 Quan Zu, Miaomiao Zhang, Jiaqi Zhu, Naijun Zhan: Bounded model-checking of discrete duration calculus. HSCC 2013: 213-222 Jasper Berendsen, Biniam Gebremichael, Frits W. Vaandrager, Miaomiao Zhang: Formal specification and analysis of zeroconf using uppaalS. ACM Trans. Embed. Comput. Syst. 10(3): 34:1-34:32 (2011) Miaomiao Zhang, Zhiming Liu, Naijun Zhan. Model Checking Linear Duration Invariants of Networks of Automata. 3rd International Conference on Fundamentals of Software Engineering, FSEN 2009, LNCS 5961, 244-259 Miaomiao Zhang, Zhiming Liu, Charles Morisset, Anders P. Ravn. Design and Verification of Fault-Tolerant Components . In Methods, Models and Tools for Fault Tolerance (MEMoT 2009), LNCS 5454, 57-84. Quan Zu, Miaomiao Zhang, Jing Liu, Qingfeng Du: Designing, Modelling and Verifying a Container Terminal System Using UPPAAL. 11th IEEE High Assurance Systems Engineering Symposium (HASE 2008): 445-448. Miaomiao Zhang, Dang Van Hung, Zhiming Liu. Verification of Linear Duration Invariants by Model Checking CTL Properties. 5th International Colloquium on Theoretical Aspects of Computing (ICTAC 2008), LNCS 5160 , 395-409 Dang Van Hung, Miaomiao Zhang. On verification of probabilistic timed automata against probabilistic duration properties. Proceedings of the 13th IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA 2007), pp 165-172 B. Gebremichael, F.W. Vaandrager, M. Zhang, K. Goossens, E. Rijpkema, A. Radulescu. Deadlock Prevention in the Aethereal Protocol. Proceedings 13th IFIP Advanced Research Working Conference on Correct Hardware Design and Verification Methods (CHARME'05), LNCS 3725, pp 345-348 Miaomiao Zhang, Dang Van Hung. Formal Analysis of Streaming Downloading Protocol for System Upgrading. In the proceedings of the 4th Workshop on Quantitative Aspects of Programming Languages (QAPL 06), Electr. Notes Theor. Comput. Sci. 164(3): 205-224 B. Gebremichael, F.W. Vaandrager, Miaomiao Zhang. Analysis of a Protocol for Dynamic Configuration of IPv4 Link Local Addresses using Uppaal. Appear in Proceedings 6th Annual ACM Conference on Embedded Software (EMSOFT 2006), pp 242-251 Fehnker, F.W. Vaandrager, Miaomiao Zhang. Modeling and Verifying a Lego Car Using Hybrid I/O Automata. In the book \"Models, Algebras, and Logic of Engineering Software\", Nato ASI Series III: Computer and Systems Sciences, Volume 191, pages 385-402, IOS Press, 2003 Fehnker, F.W. Vaandrager, Miaomiao Zhang. Modeling and Verifying a Lego Car Using Hybrid I/O Automata. In Third International Conference on Quality Software (QSIC 2003), pp 280-289"
  },
  {
    "title": "张亚英",
    "relative_url": "../info/1061/2790.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2790.htm",
    "html_content": "姓 名 张亚英 职 称 教授 学 科 计算机科学与技术学科 专 业 计算机科学与技术 研究方向 大数据挖掘，时空大数据分析，智能交通信息系统，分布式系统 导师类型 博导/硕导 电子邮件 yaying.zhang@tongji.edu.cn 联系电话 69589864 通讯地址 上海市曹安路4800号同济大学智信馆217室 张亚英，教授，2004年毕业于上海交通大学计算机科学与技术系，获工学博士学位，毕业后进入同济大学计算机系任教，主要的研究方向包括大数据与人工智能、智能交通系统以及分布计算。 主讲本科课程“数据结构”、“算法设计与分析”和硕士课程“分布式系统”。 长期从事时空大数据挖掘和分布式计算等方面的基础研究工作。先后承担和参与了包括国家自然科学基金、国家重点研发计划、科技部国际重点合作项目、国家基金委重大集成计划、上海市基础重大计划等各类科研项目20余项。对多源数据的融合与清洗、时空大数据的 挖掘与分析、数据驱动的漂移检测、分布计算环境中的大数据存储与计算任务调度、数据流中的不确定性建模与评估等领域进行研究，并在智能交通信息系统等多个领域进行应用验证。 近年来主要的学术论文： (1) Aoyu Liu,Yaying Zhang: Spatial-Temporal Dynamic Graph Convolutional Network With Interactive Learning for Traffic Forecasting, IEEE Transactions on Intelligent Transportation Systems,(early access), 2024, DOI:10.1109/TITS.2024.3362145 (2) Qi Zheng,Yaying Zhang: DSTAGCN: Dynamic Spatial-Temporal Adjacent Graph Convolutional Network for Traffic Forecasting. IEEE Trans. Big Data 9(1): 241-253 (2023), DOI:10.1109/TBDATA.2022.3156366； (3) Yang Li,Yaying Zhang: Spatial-Temporal Dynamic Graph Diffusion Convolutional Network for Traffic Flow Forecasting.2023 IEEE International Conference on Big Data (BigData), 2023: 700-709, DOI:10.1109/BigData59044.2023.10386250 (4) Canyang Zhang, Qi Zheng,Yaying Zhang:Spatial-Temporal Flow Holistic Interaction Graph Convolution Network for Bidirectional Traffic Flow Forecasting.2023 IEEE International Conference on Big Data (BigData), 2023: 1262-1268, DOI:10.1109/BigData59044.2023.10386746 (5) Qi Zheng,Yaying Zhang:TAGnn: Time Adjoint Graph Neural Network for Traffic Forecasting. 28th International Conference on Database Systems for Advanced Applications (DASFAA), 2023: 369-379 (6) Xuancheng Jin,Yaying Zhang:Adaptive Random Forest with Dynamic Detectors for Evolving Data Stream Classification. ICCAI 2023: 678-684 (7) Jiankai Zuo,Yaying Zhang: SGED-Net: A Self-organizing Graph Embedding Deep Network for Travel Time Estimation.2023 International Joint Conference on Neural Networks(IJCNN) 2023: 1-9,DOI:10.1109/IJCNN54540.2023.10191790 (8)Yaying Zhang,Xinyuan Sui: RCIVMM: A Route Choice-Based Interactive Voting Map Matching Approach for Complex Urban Road Networks. IEEE Trans. Big Data 8(5): 1414-1427 (2022), DOI:10.1109/TBDATA.2021.3057095 (9) Huiyun Yu, Qi Zheng, Shuyun Qian,Yaying Zhang: A Fuzzy-based Convolutional LSTM Network Approach for Citywide Traffic Flow Prediction. 2022 IEEE Intelligent Transportation System s Conference (ITSC), 2022: 3360-3367 (10) Yixi Wu andYaying Zhang, \"Dynamic Time-Constrained Path Recommendation with User’s Preference,\" 2021 IEEE International Conference on Systems, Man, and Cybernetics (SMC), Melbourne, Australia, 2021, pp. 1641-1648. (11) Yang Liankun;Zhang Yaying; Zuo Jiankai ; \"An Attention-Based Spatial-Temporal Traffic Flow Prediction Method with Pattern Similarity Analysis\", 2021 IEEE Intelligent Transportation System s Conference (ITSC), Indianapolis, USA, 2021. (12) Xinyuan Sui andYaying Zhang, \"Entropy-based Traffic Congestion Propagation Pattern Mining with GPS Data,\" 2021 IEEE 6th International Conference on Big Data Analytics (ICBDA), Xiamen, China, 2021, pp. 128-132. (13) Chuanfei Gong;Yaying Zhang; \"Urban Traffic Data Imputation With Detrending and Tensor Decomposition\", IEEE Access, 2020, 2020(8): 11124-11137. (14)Yaying Zhang; Guan Huang ; \"traffic flow prediction model based on deep belief network and genetic algorithm\", IET Intelligent Transport Systems, 2018, 12(6): 533-541. (15)Yaying Zhang,Wei Qiang, Zhengyu Yang: \"A New Traffic Signal Control Method Based on Hybrid Colored Petri Net in Isolated Intersections\". International Journal of Intelligent Transportation Systems Research. 15(2): 98-107 (2017)"
  },
  {
    "title": "赵才荣",
    "relative_url": "../info/1061/2789.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2789.htm",
    "html_content": "姓 名 赵才荣 职 称 教授 学 科 计算机科学与技术 专 业 计算机应用技术 研究方向 模式识别，机器学习、计算机视觉、图像内容理解等 导师类型 博导/硕导 电子邮件 zhaocairong@tongji.edu.cn 联系电话 通讯地址 上海市曹安公路4800号电信学院405室 赵才荣，工学博士。现任同济大学电子与信息工程学院计算机系教授，博士生导师。曾任香港理工大学兼职研究员（2016-2017）。担任上海市计算机学会计算机视觉专委会主任，中国图象图形学学会青工委副秘书长，中国自动化学会模式识别与机器智能专业委员会副秘书长，中国计算机学会杰出会员。担任IEEE TMM Guest Editor、 担任IET IP Associate Editor。研究聚焦于视觉与智能学习，研究方向包括：人工智能、计算机视觉等，主要涉及行人再识别、识别中隐私保护与安全防御、场景文字检测与识别、X光图像智能分类等领域。已在IEEE TIP、TIFS、TMM、TCSVT、TNNLS、PR、中国科学.信息科学等国内外重要学术期刊及国际学术会议CVPR，ICLR, ICML, AAAI，ACM MM, ICCV等发表论文40余篇，研究成果获上海市科技进步一等奖。主持国家自然科学基金3项，主持国家重点研发计划子课题以及企业横向课题十余项。主讲《计算机视觉》、《人工智能原理》、《机器学习》等专业核心课程，建设国家级线下精品课程1门，上海市精品课程1门。 在研项目中，以智能视频分析为背景，聚焦于视频内容中“人物”因素，以计算机视觉和模式识别理论为基础，研究面向行人再辨识，人脸识别，图像分类与理解的粒化建模，多模态融合，视觉大模型等问题。热烈欢迎对世界充满好奇心，对科学研究充满热情的同学一起探索未知世界！热烈欢迎优秀本科生、硕士生、博士生、博士后加入我们。 视觉与智能学习实验室主页：https://vill.tongji.edu.cn/"
  },
  {
    "title": "赵生捷",
    "relative_url": "../info/1061/2744.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/2744.htm",
    "html_content": "赵生捷 赵生捷教授是国际欧亚科学院院士、国家级海外高层次人才、原同济大学软件学院院长、同济大学计算机科学与技术学院教授。 赵生捷教授持有中国科学技术大学无线电电子学本科学位、中国航天科工集团第二研究院电子与计算机工程硕士学位、美国著名的工科大学德克萨斯A&M大学电子与计算机工程博士学位。美国贝尔实验室技术学院院士、中国发明协会会士。科学中国人2014年度人物奖获得者。人工智能和无线通信等领域资深专家，主持国家自然科学基金委重点项目、国家“十二五”重大专项新一代宽带无线移动通信网项目、国家“十三五”重点研发计划物联网与智慧城市关键技术与应用专项项目、国家“十四五”重点研发计划城镇可持续发展关键技术与装备”专项项目等国家级项目。以第一完成人获2020年上海科技进步奖一等奖和2022年度教育部技术发明一等奖。"
  },
  {
    "title": "朱磊",
    "relative_url": "../info/1061/3378.htm",
    "absolute_url": "https://cs.tongji.edu.cn/info/1061/3378.htm",
    "html_content": "朱磊，同济大学研究员、博士生导师，计算机科学与技术学院院务助理。目前主要研究方向是高效能多模态大模型和具身智能。在Proceedings of the IEEE, IEEE TPAMI等中国计算机学会推荐（下简称CCF） A类期刊和会议上发表学术论文100余篇，主编英文学术专著2部，ESI高被引/热点论文9篇，Google引用1万多次，H因子53。获得CCF A类会议ACM SIGIR 2019和ACM MM 2019的最佳论文提名，CCF C类会议ADMA2020最佳论文奖，ChinaMM 2022最佳学生论文奖，1篇论文入选2019年中国百篇最具影响国际学术论文。担任ACM TOMM、IEEE TBD两个ACM/IEEE汇刊的编委，CCF A类会议的领域主席（AC）或高级程序委员会委员（SPC），CSIG青年工作委员会副秘书长。主持/参与基金委青年/面上/重点等10余项横纵课题。获得山东省自然科学二等奖（序1），吴文俊人工智能自然科学二等奖（序2），ACM中国SIGMM新星奖，中国图象图形学学会（CSIG）青年工作突出贡献奖（连续3年），入选斯坦福大学发布的全球前2%终身科学影响力榜单，国际学术机构ScholarGPS发布的2024年全球前0.05%顶尖科学家榜单（近5年），2023~2024年连续两年获research.com发布的Rising Star of Science Award。指导研究生获省优秀博士论文、中国自动化学会优秀硕士生学位论文奖、入选中国电子学会硕士学位论文激励计划。 近5年指导研究生在CCF A类会议、ACM/IEEE汇刊、中科院SCI一区期刊发表高水平论文40多篇，2篇论文获得CCF A类会议最佳论文提名奖。指导的学生获得省级以上各种荣誉20余人次，包括中国自动化学会优秀硕士论文、入选中国电子学会硕士学位论文激励计划、省优秀博士学位论文、省优秀硕士学位论文、省研究生优秀成果一等奖、省高等学校优秀学生等。 欢迎对课题组感兴趣的硕博、博士后及研究助理来信垂询！兴趣对象是计算机、软件、自动化、数学、统计等相关专业学生。希望您是这样的：1）有兴趣从事学术研究；2）踏实肯干，积极进取，勤动手脑；3）具备良好的编程能力，英语和数学基础。有兴趣者可以发邮件垂询送至leizhu0608@gmail.com，也非常欢迎当面交流。"
  }
]